{"Chapter 15 - [Title from PDF Content]": "Chapter 15 - Plumbing\nSection 15-1.  International Plumbing Code.\nSee Chapter 5, Section 5-3 (Ord. No. 1913, Eff. 6-17-11).\n\n", "Chapter 16 - [Title from PDF Content]": "Chapter 16 - Public Peace, Morals and Welfare\nARTICLE 1.  OFFENSES AGAINST PUBLIC PEACE.\nSections:\n16-1                       Disturbing the public peace.\n16-2                       Unlawful assembly.\n16-3                       Disturbing religious assembly.\n16-4                       Disturbing lawful assembly.\n16-5                       Loitering - Police order to disperse.\n16-6                       Schools, loitering about, disturbing, annoying or molesting students.\n16-7                       False impersonation of an officer.\n16-8                       Resisting and obstructing police officers.\n16-9                       Assisting prisoners to escape.\n16-10                     Quarreling and fighting.\n16-11                     Noises - Scope of prohibition.\n16-12                     Exceptions from provisions.\n16-13                     Throwing stones.\n16-14                     Participating in or inciting a riot or disturbance.\nARTICLE 2.  OFFENSES AGAINST PROPERTY.\n16-15                     Injuring, defacing or destroying publicly-owned property.\n16-16                     Injuring, defacing or destroying private property.\n16-16.1                  Graffiti\n16-17                     Trespassing upon publicly or privately owned property.\n16-17.1                  Theft.\n16-18                     Loitering about railroad yards; exception.\n16-19                     Peddlers going upon premises uninvited.\n16-20                     Abatement of nuisance by police.\n16-21                     Possession of license no bar to prosecution.\nARTICLE 3.  OFFENSES AGAINST PUBLIC SAFETY.\n16-22                     Carrying concealed weapons.\n16-23                     Discharging firearms.\n16-24                     False fire alarm.\nARTICLE 4.  OFFENSES INVOLVING MINORS.\n16-25                     Loitering defined.\n16-26                     Loitering after curfew.\n16-27                     Responsibility of parents; penalty for violation.\n16-28                     Furnishing tobacco to minor under age 16.\n16-28.1                  Minors in possession.\n16-29                     Abandoned refrigerators; removal of locks.\nARTICLE 5.  OFFENSES AGAINST MORALS.\n16-30                     Common gambler defined.\n16-31                     Permitting gambling in premises.\n16-32                     Playing games for money.\n16-33                     Gambling with intoxicated persons or minors.\n16-34                     Indecent exposure.\n16-35                     Urinating in public.\n16-36                     Allowing prostitution on premises.\n\n16-37                     Prostitution - Plying vocation.\n16-38                     Prostitution prohibited; cohabitation with prostitute.\n16-39                     Enticing to house of ill repute.\n16-40                     Keeping of disorderly house.\nARTICLE 6.  OFFENSES AGAINST PUBLIC HEALTH.\nDIVISION 1.  GENERAL PROVISIONS.\n16-41                     Poison to be labeled.\n16-42                     Tainted provisions not to be sold.\n16-43                     Unwholesome provisions not to be sold.\n16-44                     Cleaning of cesspools, grease traps and privy vaults; when required.\n16-45                     Discontinuance of cesspools, grease traps and privy vaults; filling.\n16-46                     Removal of contents of cesspools, grease traps and privy vaults.\n16-47                     Substances of abuse.\nDIVISION 2.  SMOKING IN PUBLIC PLACES AND PLACES OF EMPLOYMENT.\n16-48                     Legislative intent.\n16-49                     Repealed.\n16-50                     Repealed.\n16-51                     Repealed.\n16-52                     Repealed.\n16-53                     Repealed.\n16-54                     Repealed.\n16-55                     Repealed.\nARTICLE 7.  NUISANCES.\n16-56                     Discharging foul substances into street.\n16-57                     Accumulating offensive substances.\n16-58                     Offensive cellars; sewers.\n16-59                     Accumulation of junk.\n16-60                     Exclusion from provisions.\n16-61                     Barbed wire and other obstructions into thoroughfares.\n16-62                     Placing obstructions on public right-of-way.\n16-63                     Dangerous or hazardous conditions.\n16-63.5                  Broken windows\n16-64                     Notice to abate nuisance.\n16-65                     Assessment of costs and collection of assessments.\n16-66                     General notice to clean up.\n16-67                     Summary abatement of nuisances.\nARTICLE 8. PENALTIES\n16-68                     Penalty for violations by minors.\nCHAPTER 16.  PUBLIC PEACE MORALS AND WELFARE.\nARTICLE 1.  OFFENSES AGAINST PUBLIC PEACE\nSection 16-1.        Disturbing the public peace.\nIt shall be unlawful for any person intentionally, knowingly, or recklessly to:\n(1)  Make unreasonable noise in a public place or near a private residence that he/she has no right to occupy; or\n(2)  Repeatedly insult, taunt or challenge another person in a manner likely to provoke a violent or disorderly response; or\n(3)  Not being a peace officer, display a deadly weapon in a public place in a manner calculated to alarm; or\n(4)  In a public place, threaten to assault in any manner another person; or\n(5)  Strike, shove, kick or otherwise subject any person to unwanted physical contact.\nSection 16-2.        Unlawful assembly.\nIt shall be unlawful for any two (2) or more persons to assemble together with an intent to do any unlawful act, or being so\nassembled, to mutually agree to do any unlawful act with force or violence against the property of the City, or the person or\nproperty of another, or against the peace or to the terror of others; or make any movement or preparation therefor; and\nevery person present at such an assembly who shall not endeavor to prevent the commission or perpetration of such\nunlawful act, shall be deemed guilty of a misdemeanor.  (Code 1958, Sec. 17-53.)\nSection 16-3.        Disturbing religious assembly.\nIt shall be unlawful for any person to disturb or disquiet any congregation or assembly of persons met for or engaged in\nreligious worship by making any unreasonable loud and unnecessary noise, or by rude or indecent behavior, or discourse\nwithin their place of worship or so near it as to disturb the order and solemnity of the meeting.  (Code 1958, Sec. 17-20.)\nSection 16-4.        Disturbing lawful assembly.\nIt shall be unlawful for any person to obstruct or interfere significantly with any lawful meeting, assembly, procession or\ngathering by physical action, verbal utterance or any other means, with the intent to prevent or disrupt said meeting,\nassembly, procession or gathering.\nSection 16-5.        Loitering - Police order to disperse.\n(1)  It shall be unlawful for any person to loiter, loaf, wander, stand or remain idle either alone or in consort with others in\na public place in such manner so as to:\n(a)  Obstruct any public street, public highway, public sidewalk or any other public place or building by hindering or\nimpeding or tend to hinder           or impede the free and uninterrupted passage of vehicles, traffic or    pedestrians.\n(b)  Commit in or upon any public street, public highway, public sidewalk or any other public place or building any\nact or thing which is an obstruction or interference to the free and uninterrupted use of property or with any\nbusiness lawfully conducted by anyone in or upon or facing or fronting on any such public street, public highway,\npublic sidewalk or any other public place or building, all of which prevents the free and uninterrupted ingress,\negress, and regress, therein, thereon and thereto.\n(2)  Any person who causes or commits any of the conditions enumerated in Subsection (1) herein and who fails or refuses\nto stop causing or committing such conditions and to move on or disperse as directed by a police officer or any other lawful\nauthority shall be guilty of a violation of this Section.\nSection 16-6.        Schools, loitering about; disturbing, annoying or molesting students.\nIt shall be unlawful for any person, at any time, to loiter, idle, wander, stroll or play in or about any public, private or\nparochial school, college or seminary grounds or buildings, either on foot or in or on any vehicle, without having some\nlawful business therein or thereabout or in connection with such school or the employees thereof, or for any person to:\n(1)  Annoy, disturb or otherwise prevent the orderly conduct of classes and activities of any such school; or\n(2)  Annoy, disturb, assault or molest any student or employee of any such school or college while in any such school\nbuilding, school grounds; or\n(3)  Conduct himself/herself in a lewd, wanton or lascivious manner in speech or behavior in or about any such school\nbuilding or school grounds; or\n(4)  Park or move a vehicle at any time in the immediate vicinity of or on the grounds of any such school, college or\nseminary for the purpose of annoying or molesting the students or employees thereof or in an effort to induce, entice or\ninvite students into such vehicles for immoral purposes. (Code 1958, Sec.17-46.1.)\nSection 16-7.        False impersonation of an officer.\nIt shall be unlawful for any person to impersonate a policeman or any City, County, State or Federal officer by wearing a\nbadge or star, or by any acts or words which may lead others to believe that he/she is such officer when in fact he/she is\nnot such officer.  (Code 1958, Sec. 17-24.)\nState law references: As to penalty under State law, 1973, Sec. 29-5-102.\nSection 16-8.        Resisting and obstructing a police officer.\n(1)       (a)  It shall be unlawful for any person to resist arrest by a police officer of the City.  A person commits the crime of\nresisting arrest if he/she knowingly prevents or attempts to prevent a police officer acting under color of his/her official\nauthority from effecting an arrest of the actor or another by using or threatening to use physical force or violence against\nthe police officer or another, or using any other means which creates substantial risk of causing physical injury to the\npolice officer or another.\n(b)  It is no defense to a prosecution under this section that the police officer was attempting to make an arrest which in\nfact was unlawful, if he/she was acting under color of his/her official authority, and in attempting to make the arrest\nhe/she was not resorting to unreasonable or excessive force giving rise to the right of self-defense.  A police officer acts\n\"under color of his/her official authority\" when, in the regular course of assigned duties, he/she is called upon to make,\nand does make, a judgment in good faith based upon surrounding facts and circumstances that an arrest should be made\nby him/her.\n(c)  The term \"police officer\" as used in this section means a police officer, in uniform or, if out of uniform, one who has\nidentified himself/herself by exhibiting his/her credentials as such police officer to the person whose arrest is attempted.\n(2)       (a)  It is unlawful for a person to obstruct a police officer.  A person commits the crime of obstructing a police\nofficer, when, by using or threatening violence, force or physical interference, or an obstacle, he/she knowingly obstructs,\nimpairs or hinders the enforcement of the penal law or the preservation of the peace by a police officer acting under color\nof his/her official authority.\n(b)  It is no defense to a prosecution under this section that the police officer was acting in an illegal manner, if he/she was\nacting under color of his/her official authority as defined in subsection (1)(b).\nSection 16-9.        Assisting prisoners to escape.\nIt shall be unlawful for any person to aid or assist any person in custody of a police officer, to escape from such custody or\nsuch confinement.\nSection 16-10.      Quarreling and fighting.\nIt shall be unlawful for any person to fight with another upon public property or upon private property which is open to\nview from any other place within the City or in the presence of persons not engaged in said fight.  It shall not be unlawful\nto engage in a fight which is a contest of amateur or professional athletic skill.\nSection 16-11.      Noises - Scope of prohibition.\n(1)  Subject to the provisions of this Section, the creation of any unreasonably loud, disturbing and unnecessary noises at\nany time is prohibited.  Noises of such character and of such intensity and duration as to be detrimental to the public\nhealth and welfare is prohibited.  Noises which unreasonably interfere with the sleep, comfort and repose of any individual\nare prohibited.\n(2)  The following acts are declared to be a violation of this Section; the enumeration shall not be deemed to be exclusive or\nin any way limited by the generality of Subsection (1):\n(a)  The keeping in any building or upon any premises of any animal or bird which by frequent or long continued\nnoise shall disturb the comfort and repose of any person in the vicinity.\n(b)  The use of any automobile, motorcycle, streetcar or vehicle so out of repair, so loaded or in such a manner as to\ncreate loud and unnecessary grating, grinding, rattling or other noise.\n(c)  The sounding of any horn or signaling device on any automobile, motorcycle, streetcar or other vehicle on any\nstreet or public place except as a danger warning; the creation by means of any such signaling device of any\nunreasonably loud or harsh sound; and the sounding of any such device for an unnecessary and unreasonable period\nof time.\n(d)  The playing of any radio, phonograph or any musical instrument in any place at any time in such manner or with\nsuch volume as to annoy or disturb any person thereby.\n(e)  The creation of any excessive noise on any street adjacent to any public or parochial school, college, or institution\nof learning while it is in session, which unreasonably interferes with the work of pupils or instructors; provided,\nconspicuous signs are displayed on such street indicating, in substance, that it is a school street and that quiet is\nrequired.\n(f)  The creation of loud and excessive noise in connection with loading or unloading any vehicle or the opening and\ndestruction of bales, boxes, crates and containers.\n(g)  The playing of any game not for public exhibition, which results in the creation of any noise or disturbance that\nin any manner unreasonably interferes with the health, comfort or repose of any inhabitants of the City.  (Ord. 2084,\nSec. 16-11, amended, eff. 9/27/19.)\nSection 16-12.      Exceptions from provisions.\n(1)  Nothing contained in Section 16-11 shall be construed to prevent the production of music with any military, civic, or\nauthorized parade, funeral procession or religious ceremony, or any musical performance conducted with the consent of\nmunicipal authority, or to prevent public exhibitions of sports or other events.\n(2)  The provisions of Section 16-11 shall not apply to police officers or firemen in the discharge of their official duties.\n (Code 1958, Sec. 16-14.)\nSection 16-13.      Throwing stones.\nIt shall be unlawful for any person to throw any stone or other missile at or upon any building, tree or other public or\nprivate property, or at any person.  (Code 1958, Sec. 17- 50.)\nSection 16-14.      Participating in or inciting a riot or disturbance.\nIt is unlawful for any person who collects or assembles in crowds and bodies to become involved in or incite or attempt to\nincite a riot or public disturbance.\nARTICLE 2.  OFFENSES AGAINST PROPERTY.\nDivision 1.  General Provisions.\nSection 16-15.      Injuring, defacing, or destroying publicly-owned property.\nIt is unlawful for any person to knowingly injure, deface or destroy any real property or improvements thereon, or movable\nor personal property owned by the City or any other public entity. (Ord. 1499, 3/3/95.)\nSection 16-16.      Injuring, defacing or destroying private property.\nIt is unlawful for any person to knowingly injure, deface or destroy the real or personal property belonging to any person\nor other private entity.  (Ord. 1499, 3/3/95.)\nSection 16-16.1    GRAFFITI\n(1) Definitions: for purposes of Sections 16-16.1.: (Ord. 1756, eff., 7-16-04)\n(a) “Graffiti” means the defacing of public or private property without the consent of the property owner by means of\nany method of defacement, including but not limited to painting, drawing, writing, etching, carving or otherwise\nmarring the surface of the property by use of paint, spray paint, ink or any other substance or object. (Ord. 1756, eff.,\n7-16-04)\n(b) “Prohibited graffiti material” means and includes spray paint, spray paint nozzles, glass cutting tools and glass\netching tools or instruments. (Ord. 1756, eff., 7-16-04)\n(c) “Spray paint” means any aerosol container that is made or adapted for the purpose of applying paint or other\nsubstance capable of defacing property. (Ord. 1756, eff., 7-16-04)\n(d) “Spray paint nozzle” means a nozzle designed to deliver a spray of paint of a particular width or flow from a can of\nspray paint. (Ord. 1756, eff., 7-16-04)\n(2) Application of Graffiti. (Ord. 1756, eff., 7-16-04)\n(a) It is unlawful for any person to deface public or private property with graffiti. (Ord. 1756, eff., 7-16-04)\n(b) The City may order the occupant or owner of any property on which graffiti is found to remove the graffiti, at the\noccupant or owner’s sole expense, within twenty-four (24) hours, or such additional time as determined by the City.\n It is unlawful for any occupant or owner of property on which graffiti is found to fail to remove or cause to be\nremoved graffiti as directed by the City. (Ord. 1756, eff., 7-16-04)\n(c) Upon conviction of a violation of this Section, in addition to any other penalty allowed by law, the Municipal\nCourt may order the defendant to personally make repairs to the damaged property, or may enter an order\nauthorizing the City to enter upon the property and remove the graffiti, assessing the cost of removal against the\ndefendant. (Ord. 1756, eff., 7-16-04)\n(3)   Sale and Possession of prohibited graffiti materials. (Ord. 1756, eff., 7-16-04)\n(a) Possession. It is unlawful for any minor, except under the direct supervision of such minor’s parent, legal\nguardian, school teacher, tutor, counselor, art instructor or a law enforcement officer, to purchase, obtain, possess or\nattempt to purchase, obtain or possess any prohibited graffiti materials. (Ord. 1756, eff., 7-16-04)\n(b) Contributing to unlawful possession.  It is unlawful for any person, except a law enforcement officer in the\nperformance of official duty, to knowingly allow a minor to possess prohibited graffiti materials upon any real\nproperty unaccompanied by such minor’s parent, legal guardian, school teacher, tutor, counselor, art instructor or\nlaw enforcement officer. (Ord. 1756, eff., 7-16-04)\n(c) It is unlawful for any person, other than a parent or legal guardian, school teacher, tutor, counselor, art instructor\nor law enforcement officer, to sell, exchange, give, deliver, loan or otherwise furnish or cause or permit to be sold,\nexchanged, delivered, loaned or otherwise furnished any prohibited graffiti material to any minor unless the minor is\naccompanied by his or her parent, legal guardian, school teacher, tutor, counselor, art instructor or a law\nenforcement officer. (Ord. 1756, eff., 7-16-04)\n(4) Signs Required.  It is unlawful for any person who sells or offers for sale any prohibited graffiti material to fail to\ndisplay a warning sign in a prominent place in the building at all times.  Such warning sign shall have a minimum height of\nfourteen inches and a minimum width of eleven inches, shall use capital lettering of at least one-half of one inch in height,\nand shall read as follows: (Ord. 1756, eff., 7-16-04)\nWARNING: IT IS ILLEGAL FOR ANY PERSON UNDER EIGHTEEN YEARS OF AGE TO PURCHASE OR POSSESS ANY\nSPRAY PAINT, SPRAY PAINT NOZZLE, GLASS CUTTING TOOL OR GLASS ETCHING TOOL OR INSTRUMENT,\nUNLESS ACCOMPANIED BY HIS OR HER PARENT,\nLEGAL GUARDIAN, SCHOOL TEACHER, TUTOR, COUNSELOR, ART INSTRUCTOR OR A LAW ENFORCEMENT\nOFFICER, AND UPON CONVICTION, A FINE OF UP TO $300.00 MAY BE IMPOSED.\n(5) Affirmative Defenses. (Ord. 1756, eff., 7-16-04)\nIt shall be an affirmative defense to an alleged violation of Subsections 3(A) or (B) hereof that the minor possessing the\nprohibited graffiti materials was: (Ord. 1756, eff., 7-16-04)\n(a) Within his or her residence; (Ord. 1756, eff., 7-16-04)\n(b) At his or her place of employment; or (Ord. 1756, eff., 7-16-04)\n(c) Upon real property with permission from the owner, occupant or person having lawful control of such property to\npossess such materials. (Ord. 1756, eff., 7-16-04)\nIt shall be an affirmative defense to an alleged violation of Section 3(C) hereof that the person charged in an\nemployer and; (Ord. 1756, eff., 7-16-04)\n(a) Has adopted and enforces a written policy against selling prohibited graffiti materials to minors; (Ord. 1756, eff.,\n7-16-04)\n(b) Requires employees to verify the age of purchasers of prohibited graffiti materials by way of photo identification;\nand (Ord. 1756, eff., 7-16-04)\n(c) Has established and imposes sanctions for noncompliance. (Ord. 1756, eff., 7-16-04)\nAny person convicted of a violation of this Section shall be punished by a fine not to exceed three hundred dollars.\n(Ord. 1756, eff., 7-16-04)\nSection 16-17.      Trespassing upon publicly or privately owned property.\n(1)  It shall be unlawful for any person to knowingly use, occupy, or remain on or in any publicly owned property, except\nduring those times in which such property is open to the public, unless permission has been granted by a person properly\nauthorized to do so.\n(2)  It shall be unlawful for any person to knowingly use, occupy, or remain on or in any privately owned property, real or\npersonal, without the permission of the owner or person entitled to possession thereof.\n(3)  Any person who violates this Section shall be subject to a fine not exceeding Three Hundred Dollars ($300.00).\nSection 16-17.1. Theft.\nIt shall be unlawful for any person to commit theft.\n(1) A person commits theft when he or she knowingly obtains or exercises control over anything of value of another\nwithout authorization or by threat or deception when such person:\n(a) Intends to deprive the other person permanently of the use or benefit of the thing of value;\n(b) Knowingly uses, conceals or abandons the thing of value in such manner as to deprive the other person\npermanently of its use or benefit:\n(c) Uses, conceals or abandons the thing of value, intending that such use, concealment or abandonment will deprive\nthe other person permanently of its use and benefit; or\n(d) Demands any consideration to which he or she is not legally entitled as a condition of restoring the thing of value\nto the other person.\n(2) If any person willfully conceals unpurchased goods, wares or merchandise owned or held by and offered or displayed\nfor sale by any store or other mercantile establishment, whether the concealment is on his or her own person or otherwise\nand whether on or off the premises of the store or mercantile establishment, such concealment constitutes prima facie\nevidence that the person intended to commit the crime of theft.\n(3) This Section shall not apply when the aggregate value of the property involved in any one criminal episode is valued at\n$750.00 or more.\n(4) Penalty for violation.\n(a) Any person who violates this Section shall be subject to a fine of no less than Fifty Dollars ($50.00) and no more than\nSeven Hundred Fifty Dollars ($750.00). (Ord. 3025, Sec. 16-17.1, enacted 9/17/21)\nSection 16-18.      Loitering about railroad yards; exception.\nIt shall be unlawful for any person not an employee of the railroad to loiter about cars, car yards, transfer grounds, or to\nenter in or upon any car, depot or freight house or to move any car door or sleep in any car, or disturb any car or other\nproperty belonging to the railroad company doing business in the City; provided, this Section shall not apply to persons\ndoing business with any such railroad.  (Code 1958, Sec. 17-36.)\nSection 16-19.      Peddlers going upon premises uninvited.\nIt shall be unlawful and a nuisance for any solicitor, peddler, hawker, itinerant merchant or transient vendor of\nmerchandise, not having been requested or invited to do so by the owner or occupant of a private residence to enter upon\nsuch private residence for the purpose of soliciting orders for the sale of goods, wares or merchandise or for the purpose of\nor peddling or hawking the same.  (Code 1958, Sec. 17-40.)\nSection 16-20.      Abatement of nuisance by police.\nThe Chief of Police and all police officers are required and directed to suppress and abate any such nuisance as is described\nin Section 16-19.  (Code 1958, Sec. 17-41.)\nSection 16-21.      Possession of license no bar to prosecution.\nThe possession of a license issued by the City Clerk under the provisions of any ordinance of the City shall constitute no\nbar to the prosecution authorized by Sections 16-19.  (Code 1958, Sec. 17-42.)\nARTICLE 3.  OFFENSES AGAINST PUBLIC SAFETY.\nSection 16-22.      Carrying concealed weapons.\n(1)  It shall be unlawful for any person to carry concealed upon or about his/her person any pistol, revolver, bowie-knife,\ndirk, razor, slung shot, sand-bag, brass-knuckles or other deadly weapon.\n(2)  This Section shall not apply to any sheriff, deputy sheriff, constable, policeman or other peace officer within his/her\nown territory and while on duty provided such officer shall have and produce on demand a certificate from the proper\nauthority showing he/she is an officer within this exception; or, in default thereof, may be punished to the same extent an\nin the same manner of other violators.  This Section shall also not apply to any person who has been issued a valid\nConcealed Weapon Permit anywhere in the State.\nState law reference: As to provisions pertaining to carrying on concealed weapons, see C.R.S.  Sec. 18-12-105.\nSection 16-23.      Discharging firearms.\nIt shall be unlawful for any person to discharge any cannon, gun, fowling piece, pistol or firearm of any description or\nother thing containing gun powder or other combustible or explosive material.  (Code 1958, Sec. 17-25.)\nSection 16-24.      False fire alarm.\n(1)  It shall be unlawful for any person willfully and intentionally to give or cause to be given a false alarm of fire.\n(2)  Any person who shall give or cause to be given a public alarm of fire unless he/she can show that he/she had good and\nsufficient reason for believing that there was, at the time of giving such alarm, a fire in progress threatening the\ndestruction of property in the City, shall be deemed guilty of giving a false fire alarm. (Code 1958, Sec. 17-23.)\nARTICLE 4.  OFFENSES INVOLVING MINORS.\nSection 16-25.      Loitering defined.\nLoitering or loiter shall mean remaining idle in essentially one location, to be dilatory, to tarry, to dawdle and shall include\nbut not be limited to standing around, hanging out, sitting, kneeling, sauntering or prowling.\nSection 16-26.      Loitering after curfew.\n(1)  It shall be unlawful for any person under the age of 18 years to loiter on or about any street, sidewalk, curb, gutter,\nparking lot, alley, vacant lot, playground, yard, public building, or place of amusement or entertainment, whether public or\nprivate, without the consent or permission of the owner or occupant thereof, during the hours between 10:30 p.m. and\n5:00 a.m., except that for the period beginning with Friday evening and ending Sunday morning, the hours in which this\nrestriction applies shall be between 12:00 midnight and 5:00 a.m., unless accompanied by a parent, guardian or other\nadult person having care and custody of the minor.\n(2)  Any person who violates this Section shall be subject to a fine not exceeding Three Hundred Dollars ($300.00).\nSection 16-27.      Responsibility of parents; penalty for violation.\n(1)  It shall be unlawful for any parent, guardian or other adult person having the care and custody of a minor to knowingly\npermit such minor to violate the provisions of Section 16-26.\n(2)  Any person who violates this Section shall be subject to a fine of not less than Ten Dollars ($10.00) or more than Three\nHundred Dollars ($300.00) and/or a jail sentence of not less than ten (10) days or more than thirty (30) days at the\ndiscretion of the Municipal Judge.\nSection 16-28.      Furnishing tobacco to minor under age 16.\nIt shall be unlawful for any person to sell, give or furnish any tobacco or article made in whole or part of tobacco, to any\nchild under sixteen (16) years of age, without the written order of the father, mother or guardian of such child.  (Code\n1958, Sec. 17-65.)\nSection 16-28.1.     Minors in possession.\n(1) Illegal possession or consumption of ethyl alcohol by underage person.\n(a) Any person under 21 years of age who possesses or consumes ethyl alcohol anywhere in the City commits illegal\npossession or consumption of ethyl alcohol by an underage person. Illegal possession or consumption of ethyl\nalcohol by an underage person is a strict liability offense.\n(b) It is an affirmative defense to the offense described in Subsection (a) above that the ethyl alcohol was possessed\nor consumed by a person under 21 years of age under the following circumstances:\n(i.) While such person was legally upon private property with the knowledge and consent of the owner or legal\npossessor of such private property and the ethyl alcohol was possessed or consumed with the consent of his or\nher parent or legal guardian who was present during such possession or consumption; or\n(ii.) When the existence of ethyl alcohol in a person's body was due solely to the ingestion of a confectionery\nwhich contained alcoholic beverages within the limits prescribed by Section 25-5-410(1)(i)(II), C.R.S., the\ningestion of any substance which was manufactured, designed or intended primarily for a purpose other than\noral human ingestion, or the ingestion of any substance which was manufactured, designed or intended solely\nfor medicinal or hygienic purposes or solely from the ingestion of a beverage which contained less than one-\nhalf of one percent of alcoholic beverages by weight.\n(c) The possession or consumption of alcoholic beverages shall not constitute a violation of this Section if such\npossession or consumption takes place for religious purposes protected by the First Amendment to the United States\nConstitution.\n(d) Prima facie evidence of a violation of Subsection (a) above shall consist of:\n(i.) Evidence that the defendant was under the age of 21 years and possessed or consumed alcoholic beverages\nanywhere in the City of Trinidad; or\n(ii.) Evidence that the defendant was under the age of 21 years and manifested any of the characteristics\ncommonly associated with alcoholic beverage intoxication or impairment while present anywhere in the City of\nTrinidad.\n(e.) During any trial for a violation of Subsection (a) above, any bottle, can or other container with labeling indicating\nthe contents of such bottle, can or container shall be admissible into evidence; and the information contained on any\nlabel on such bottle, can or other container shall be admissible into evidence and shall not constitute hearsay. A jury\nor a judge, whichever is appropriate, may consider the information upon such label in determining whether the\ncontents of the bottle, can or other container were composed in whole or in part of ethyl alcohol. A label which\nidentifies the contents of any bottle, can or other container as \"beer,\" \"ale,\" \"malt beverage,\" \"fermented malt\nbeverage,\" \"malt liquor,\" \"wine,\" \"champagne,\" \"whiskey\" or \"whisky,\" \"gin,\" \"vodka,\" \"tequila,\" \"schnapps,\"\n\"brandy,\" \"cognac,\" \"liqueur,\" \"cordial,\" \"alcohol\" or \"liquor\" shall constitute prima facie evidence that the contents\nof the bottle, can or other container were composed in whole or in part of ethyl alcohol.\n(f). A parent or legal guardian of a person under 21 years of age, or any natural person who has the permission of\nsuch parent or legal guardian, may give, or permit the possession and consumption of, alcoholic beverages to or by a\nperson under the age of 21 years under the conditions described in Paragraph (b)(1) above. This Subsection shall not\nbe construed to permit any establishment which is or is required to be licensed pursuant to Article 46, 47 or 48 of\nTitle 12, C.R.S., or any members, employees, or occupants of any such establishment to give, provide, make available\nor sell alcoholic beverages to a person under 21 years of age.\n(2) Possession of marijuana\n(a) It is unlawful for any person under the age of 21 years to possess or use marijuana or to openly and publicly\ndisplay or consume marijuana within the City limits of the City of Trinidad.  Illegal possession or consumption of\nmarijuana by an underage person is a strict liability offense.\n(b) The possession or consumption of marijuana shall not constitute a violation of this Section if such possession or\nconsumption takes place for medical use 18-18-406.3.\n(3) Possession of drug paraphernalia\n(a) It is unlawful for any person under the age of 21 years of age who possesses marijuana paraphernalia anywhere in\nthe City of Trinidad and knows or reasonably should know that the drug paraphernalia could be used in\ncircumstances in the violation of the laws of the City commits illegal possession of marijuana paraphernalia by an\nunderage person. Illegal possession of marijuana paraphernalia by an underage person is a strict liability offense.\n(b) The possession of drug paraphernalia shall not constitute a violation of this Section if such possession takes place\nfor medical use 18-18-406.3.\n(4) Penalty for violation.\n(a) A violation of this section is an unclassified petty offense 18-13-122 (3)(d).\n(b) Any person who violates this Section shall be subject to a fine of no less than $100.00 and no more than $750.00.\n(Ord. 3024, Sec 16-28.1, enacted 9/17/21)\nSection 16-29.      Abandoned refrigerators; removal of locks.\nIt shall be unlawful for any person to leave outside of any building, dwelling or any other place accessible to children any\nabandoned, unattended, unused or discarded icebox, refrigerator or any other container of any kind which has an airtight\ndoor, snap or other device which may not be released from the inside of such icebox, refrigerator or container, without first\nremoving therefrom such door, lock or device. (Code 1958, Sec. 17-1 and 17-2.)\nARTICLE 5.  OFFENSES AGAINST MORALS.\nSection 16-30.      Common gambler defined.\nAs used herein, a common gambler shall mean a person who keeps or exhibits any gambling table, device or apparatus to\nwin or gain money or other property, or aids, assists or permits others to do the same, or engages in gambling for a\nlivelihood.  (Code 1958, Sec. 17-26.)\nSection 16-31.      Permitting gambling on premises.\n(1)  It shall be unlawful for any person to keep or as owner to rent any room, building, arbor, booth, shed or tenement of\nany description to be used or occupied for gambling or knowingly permit the same to be used or occupied for gambling.\n(2)  If the owner of the premises stipulated in Subsection (1) herein has knowledge that any gambling table, apparatus or\ndevice is kept or used in such premises he/she shall forthwith cause complaint to be made against the person so keeping or\nusing such premises; if he/she shall fail to do so he/she shall be taken, held and considered to have knowingly permitted\nthe same to be used and occupied for gambling.  (Code 1958, Sec. 17-27.)\nSection 16-32.      Gambling Unlawful.\nIt shall be unlawful for any person to engage in gambling, as that term is defined in C.R.S. 18-10-102(2).\nSection 16-33.      Gambling with intoxicated persons or minors.\nIt shall be unlawful for any person, by any device or pretense, to entice, or prevail upon, or cause any minor or intoxicated\nperson to engage in any game whatsoever, for any sum of money or property of value, or make any bet or wager with such\nminor or intoxicated person.  (Code 1958, Sec. 17-29.)\nSection 16-34.      Indecent exposure.\nIt shall be unlawful for any person to appear in any public place in a state of nudity, or make an indecent exposure of\nhis/her person, or be guilty of any lewd or indecent act or behavior. (Code 1958, Sec. 17-32.)\nSection 16-35.      Urinating in public.\nIt is unlawful for any person to urinate in any public way, or place which is public in nature, or any place within the City\nopen to public view.\nSection 16-36.      Allowing prostitution on premises.\nIt shall be unlawful for any person owning or in charge of any building or premises to permit the same to be used for\npurposes of prostitution.  (Code 1958, Sec. 17-16.)\nSection 16-37.      Prostitution - Plying vocation.\nIt shall be unlawful for any prostitute, courtesan or lewd woman, by word, gesture or action to ply or attempt to ply her\nvocation upon the streets, highways or thoroughfares, or from the door or window of any house, or in any public place.\n(Code 1958, Sec. 17-44.)\nState law reference: As to regulations pertaining to prostitution, see C.R.S., Sec.  18-7-201 et seq.\nSection 16-38.      Prostitution prohibited; cohabitation with prostitute.\nIt shall be unlawful for any female person to solicit or receive visits as a prostitute, or to occupy any house, room or\napartment, and use the same for purposes of prostitution, or for any male person to cohabit with any female prostitute.\n(Code 1958, Sec. 17-45.)\nSection 16-39.      Enticing to house of ill repute.\nIt shall be unlawful for any person to entice any male or female of good repute to any house of ill fame, or to any\nassignation house, or to any other house of bad repute. (Code 1958, Sec. 17-62.)\nSection 16-40.      Keeping of disorderly house.\n(1)  It shall be unlawful for any person to keep a bawdy house, house of ill fame, house of assignation or disorderly house,\nwithin the limits of the City or within three (3) miles beyond such limits, or be an inmate of or in any way connected with\nor contribute to the support of any such house or permit any building in his/her possession or under his/her control\nsituated within the City or within three (3) miles beyond the limits of the City or to be used for any such purpose; or within\nthe City or within three (3) miles beyond the limits thereof, suffer any drunkenness, quarreling, fighting, unlawful gaming\nor any disorderly conduct whatever on his/her premises.\n(2)  The license of any business operated in the premises described in (1) shall be subject to revocation.\nARTICLE 6.  OFFENSES AGAINST PUBLIC HEALTH.\nDIVISION 1.  GENERAL PROVISIONS.\nSection 16-41.      Poison to be labeled.\nIt shall be unlawful for any person to sell, give or deliver any deadly poison, knowing it to be such, without marking it in\nlegible letters \"Poison\".  (Code 1958, Sec. 16- 18.)\nState law reference: As to State requirements, see C.R.S. 1973, Sec. 12-22-119.\nSection 16-42.      Tainted provisions not to be sold.\nIt shall be unlawful for any person to sell or offer for sale any diseased, tainted or putrid meat, poultry, fish, game or\nprovisions of any kind or any decayed fruits or vegetables.  (Code 1958, Sec. 16-20.)\nSection 16-43.      Unwholesome provisions not to be sold.\nIt shall be unlawful for any person to sell or offer for sale in any market or elsewhere within the City, any emaciated,\ntainted or putrid meat, provisions or vegetables, which may be deemed unwholesome.  (Code 1958, Sec. 16-21.)\nSection 16-44.      Cleaning of cesspools, grease traps and privy vaults; when required.\nAll grease traps and privy vaults shall be cleaned once a year or oftener if ordered to do so by the Health Department, and\nall cesspools shall be cleaned when their contents are up to the inlet and the condition created by the failure to clean shall\nconstitute a nuisance.  (Code 1958, Sec. 16-3.)\nSection 16-45.      Discontinuance of cesspools, grease traps and privy vaults; filling.\nWhenever any grease trap, privy vault or cesspool is discontinued, it shall be cleaned to the bottom and filled up with earth\nor other suitable material and such work shall be done under the supervision of the Health Department.  (Code 1958, Sec.\n16-4.)\nSection 16-46.      Removal of contents of cesspools, grease traps and privy vaults.\nThe contents of privy vaults, grease traps, cesspools or accumulation of garbage, within the limits of the City, shall not be\nremoved or be transported through any street, alley or public place except in the most sanitary manner, through or by\nmeans of airtight suction tanks, if soft and mixed with water, and if solid or dry, in sheet steel tight tanks in such manner\nas shall prevent the escape of any noxious or offensive odors and preserve such contents from sight or exposure during\ntransportation.  All tools, appliances, and vehicles used in such removal shall be kept and maintained in a good sanitary\ncondition, subject to the inspection of the Health Department at all times.  (Code 1958, Sec. 16-5.)\nSection 16-47.      Substances of abuse.\n(1)  As used in this Ordinance, the term \"Substance of Abuse\" shall mean any toxic, noxious, or volatile chemical,\ncompound or substance containing toluene, acetone, or other solvent or chemical having the property of releasing toxic\nvapors.\n(2)  No person shall, for the purpose of causing a condition of intoxication, euphoria, excitement, exhilaration,\nstupefaction or dulling of the senses or nervous system, intentionally smell, inhale or ingest the fumes from any substance\nof abuse, provided, however, that this Section shall not apply to the inhalation of any anesthesia for medical or dental\npurposes.\n(3)  No person shall, for the purpose of violating or aiding another to violate any provision of this Ordinance, intentionally\npossess, buy, sell, transfer possession, or receive possession of any substance of abuse.\n(4)  Any person, other than a minor, violating any provision of this Ordinance shall, upon conviction, be fined not more\nthan Three Hundred Dollars ($300.00) or be imprisoned for a period not to exceed ninety (90) days or by both such fine\nand imprisonment.  Any minor violating any of the provisions of this Ordinance shall be dealt with in accordance with the\nChildren's Code as adopted by the State of Colorado.\n(5)  This section shall have no application to any alcoholic or fermented malt beverage, nor to any drug, compound, or\nsubstance regulated under Title 12 or Title 18 of the Colorado Revised Statutes as amended.\nDIVISION 2.  SMOKING IN PUBLIC PLACES AND PLACES OF EMPLOYMENT.\nSection 16-48.      Legislative intent.\nIn order to serve the public health, safety and general welfare, it is the declared policy of the City of Trinidad to prohibit\nsmoking in accordance with Colorado Revised Statutes, Section 25-14-201 et. seq. , and to recognize and enforce violations\nof the Colorado Law.\nSection 16-49. through Section 16-55 Repealed. (Ord. 1820, eff. 10/13/06)\nARTICLE 7.  NUISANCES.\nSection 16-56. Discharging foul substances into street.\nIt shall be unlawful and a nuisance for any person to allow to be discharged or permit to flow from any still house,\nworkshop, manufacture or other house or place owned or kept by him/her, foul or nauseous liquor or substance of any\nkind, upon any street or alley or other public place, so as to be a threat to the health or safety of any person, or offensive to\npersons living in the vicinity.\nSection 16-57.      Accumulating offensive substances.\nIt shall be unlawful and a nuisance for any person to permit or cause any grease traps, cesspool matter, animal or human\nexcrement, garbage, refuse or filth to be deposited, buried, or allowed to accumulate in or upon any premises owned or\nkept by him/her or to deposit, bury or allow to accumulate such offensive substances on any sidewalk, alley, premises,\nvacant lot or other place within the City.\nSection 16-58.      Offensive cellars; sewers.\nIt shall be unlawful and a nuisance for any person to permit any cellar, vault, private drain, pool, privies, sewer or grounds\nupon any premises belonging to, or occupied by him/her to become nauseous, foul or injurious to the public health.\nSection 16-59.      Accumulation of junk.\nIt shall be unlawful and a nuisance for any person to permit old rope, old iron, brass, copper, tin, lead, old lumber,\nconstruction material or debris, bricks, building remnants, rags, empty bottles, broken glass, paper, bagging or other\nsimilar junk to be deposited, stored or allowed to accumulate in or on any vacant lot, or in or on any other premises within\nthe City.  Any person who shall create, cause to be created, maintain, continue, increase or permit any nuisance specified\nin this Section, shall be deemed guilty of a nuisance.\nSection 16-60.      Exclusion from provisions.\nThe provisions of Section 16-59 shall not apply to the conduct, operation or establishment of a junk shop or junk yard\nbusiness duly licensed as such by the City.\nSection 16-61.      Barbed wire and other projections into thoroughfares.\nIt shall be unlawful and a nuisance for any person to put upon, keep or maintain any barb, barbed wire, sharpened nails or\nsharpened thing of metallic substance upon any fence, cellar guard or window guard, railing or bannister, that may front\nupon or that may be erected or constructed upon any street, avenue, lane, alley, building or sidewalk so that it shall project\nor extend beyond the surface of the wood or other material of which such fence, cellar guard or window guard, failing or\nbannister may be constructed.\nSection 16-62.      Placing obstructions on public right-of-way.\nIt shall be unlawful and a nuisance for any person to place or assist in placing or cause to be placed in or upon any street,\nalley, highway, or in or upon the track or right-of-way of any railway company, any construction material, building, fence,\nrubbish or other obstruction of any kind or description without obtaining the prior consent of the City Manager, and no\nsuch consent shall authorize the obstruction of more than one-half (½) the width of any street.\nSection 16-63.      Dangerous or hazardous conditions.\nIt shall be unlawful and a nuisance for any person to permit any building, structure or land owned or occupied by him/her\nwhich is accessible to the public, to become or remain in such a condition as to present a substantial danger or hazard to\nthe public health or safety.\nSection 16-63.5    Broken windows.\nIt is unlawful and a nuisance for any person to permit any windows on the ground level story of any building or structure\nwithin the City to remain broken or removed, or otherwise in a state of disrepair.  A window shall be considered broken or\nin a state of disrepair if glass is actually missing from the window area.  A cracked window shall not constitute a nuisance.\n Any person who shall create, cause to be created, maintain, continue, increase, or permit any such nuisance, shall be\ndeemed guilty of a nuisance.  No such nuisance shall be considered abated unless and until such broken or removed\nwindow has been replaced by glass or other translucent material.  (Ord. 1602, eff., 3/1/99)\nSection 16-64.      Notice to abate nuisance.\nAny person who violates either of sections 16-57, 16-58, 16-59, 16-61, 16-62, 16-63, or 16-63.5 of this Code shall be notified\nin writing by the City Manager or his/her designee of such violation.  Such written notice shall identify the nuisance and\norder the person in violation to abate or remedy such nuisance within a reasonable period of time from the date the notice\nis issued, to be determined by the City Manager or his/her designee.  The violator shall be served with such written notice\nby either first class mail, certified mail, or personal service.  A failure to comply with such notice shall subject such person\nin violation to punishment as provided in Section 1-8 of this Code for each day he/she neglects or refuses to abate such\nnuisance beyond the period of time he/she is given to abate the nuisance.  In addition, if the nuisance is not abated within\nthe time specified in the notice, the City Manger may then proceed to have the nuisance abated. (Ord. 1602, eff., 3/13/99)\nSection 16-65.      Assessment of costs and collection of assessments.\n(1) Upon abatement of a nuisance by City forces or by independent contractors employed by the City for such purpose, a\ncharge shall be made against the owner of the property or any other person who created or permitted the creation of such\nnuisance.  The charge shall be actual costs for labor, equipment and materials, or the contract price of an independent\ncontractor, together with a $1,000 administrative fee thereon for administrative supervision, inspection, and noticing.\n(Ord. 2050, repealed and reenacted, eff., 11/21/17)\n(2)  The City Clerk, as soon as practicable after such charge has accrued, shall send by first class mail, addressed to the\nowner of such property and/or any other person who has created or permitted the creation of such nuisance, at the last\nknown address of such person or persons, a notice of such charge, which notice shall contain a description of the lots or\ntracts of land, the name of the owner or owners and the amount of the assessment.\n(3)  It shall be the duty of the owner or any other person who has created or permitted the creation of such nuisance, to pay\nsuch charge within twenty (20) days after the mailing of such notice, and upon his/her failure to do so, provided the notice\nhas been mailed to the owner, such charge shall be certified to the officer having custody of the tax list, in the same\nmanner as the City taxes are certified to such officer, to be collected according to the laws of the State of Colorado for the\nassessment and collection of general taxes, including the laws for the sale of property for taxes and the redemption thereof.\n(4)  Provided such notice has been mailed to the property owner, such charge shall become a lien upon the respective lots\nor tracts of land at the time the City Clerk certifies such charge to the officer having custody of the tax list.\n(5)  The City may also proceed to collect such charge by obtaining a judgment in the County or District Court against  the\nproperty owner or any other person who has created or permitted the creation of such nuisance, and enforcing such\njudgment through such means as are provided by law.\nSection 16-66.      General notice to clean up.\nWhenever the Mayor deems it necessary to give a general notice to all the inhabitants and the property owners to clean up\nand remove from their premises all filth, garbage, excrement, rubbish and refuse matter of every kind, a formal notice\nissued by the City and published in a newspaper of general circulation in the City shall be deemed sufficient and legal\nnotice; and any person failing to comply with the requirements of such notice shall be liable to the penalties prescribed in\nthis Code for maintaining a nuisance.  (Code 1958, Sec. 16-26.)\nSection 16-67.      Summary abatement of nuisances.\nThe City Manager, if he/she should determine that the existence of a nuisance is an immediate threat to the public health,\nsafety or welfare, shall have the power to proceed to have the nuisance abated, without prior notice to the property owner\nor other person who created or permitted the creation of the nuisance.\nARTICLE 8. PENALTIES\nSection 16-68.      Penalty for violations by minors.\nWhenever, in this Chapter of this Code, any act or failure to do a required act is prohibited or is made or declared to be\nunlawful or an offense or a misdemeanor, the violation of any such provision by a person under the age of eighteen (18)\nyears shall be punished by a fine not exceeding three hundred dollars ($300.00), notwithstanding any other penalty for\nsuch offense which may be provided elsewhere in this Code. (Ord. 1674, 3 eff., 10-26-01)\n", "Chapter 17 - [Title from PDF Content]": "Chapter 17 - Streets and Sidewalks\nARTICLE 1.  IN GENERAL.\nSections:\n17-1                       Street names - Reference to map and plat.\n17-2                       Street names to be placed on corners.\n17-3                       Sprinkling sidewalks before sweeping.\n17-4                       Shaking or cleaning rugs in streets or sidewalks prohibited.\n17-5                       Placing obstructions on streets; consent required; limitation.\n17-6                       Obstruction to gutters prohibited.\n17-7                       Openings in sidewalk; disrepair of sidewalk.\n17-8                       Merchandise on sidewalk; passageway; time limitation.\n17-9                       Property owner to keep sidewalks cleaned.\n17-10                     Property owner to remove snow and ice from sidewalks.\n17-11                     Slippery sidewalks; City not liable.\n17-12                     Work done by City; assessment of costs.\n17-13                     Installation of underground structures; plat and data to be filed.\n17-14                     Plats - Contents.\n17-15                     Line for poles on streets.\n17-16                     Operating tractors on pavement.\n17-17                     Oil on pavement - Pouring or spilling prohibited.\n17-18                     Oil on pavement; oil delivery wagons and tanks.\n17-19                     Water and sewer connections in proposed paving districts.\nARTICLE 2.  NUMBERING BUILDINGS.\n17-20                     Owners and occupants to number buildings.\n17-21                     Manner of numbering.\n17-22                     Allotment of numbers.\n17-23                     Street maps with numbers to be prepared.\n17-24                     Assigning numbers; certificate of designation.\n17-25                     Size and location of configuration.\n17-26                     Refusal to place numbers on existing buildings.\n17-27                     Refusal to place, or placing unauthorized numbers on new buildings.\n17-28                     Altering numbers or street names - Consent required.\nARTICLE 3.  EXCAVATION.\n17-29                     Excavation permit required; contents of application.\n17-30                     Excavation permit; conditions of issuance.\n17-31                     Excavation permit; work requirements.\n17-32                     Excavation permit; indemnification.\n17-33                     Excavation permit; warranty.\n17-34                     REPEALED (Ord. 1516, 8-26-1995)\n17-35                     REPEALED (Ord. 1516, 8-26-1995)\nARTICLE 4.  CONSTRUCTION OF SIDEWALK, CURB AND GUTTER.\n17-36                     Maximum and minimum widths of sidewalks.\n17-37                     Sidewalks to conform to established grade; supervision of laying.\n17-38                     Slope.\n17-39                     Sidewalk construction - Permit required.\n17-40                     Application for permit.\n17-41                     Sidewalk openings for fuel and light to be covered.\n17-42                     Access to basement to be covered.\n\n17-43                     Curb, gutter, and/or sidewalk requirements - New construction.\n17-44                     Hearing to consider construction of curb, gutter and/or sidewalk.\n17-45                     Order to construct curb, gutter and/or sidewalk.\n17-46                     Failure of owner to construct.\n17-47                     Assessment of cost against property owner.\n17-48                     Notice of assessment.\n17-49                     Protest of assessment.\n17-50                     Failure of owner to pay assessment.\n17-51                     Curbs and gutters - Materials.\n17-52                     Curbs on curb lines; gutters to attach to curbs.\n17-53                     Street lawns and parks to conform to grade.\n17-54                     Article not applicable in commercial districts; City's jurisdiction over parks.\n17-55                     Removal of grade or line stakes prohibited.\n17-56                     Curb line and curb radius.\n17-57                     Fund established to front costs of repairs or replacement.\n17-58                     Repair or replacement of curb, gutter and/or sidewalk.\nARTICLE 5.   CULVERTS.\n17-59                     When construction of culvert required.\n17-60                     Notice to owner to construct culvert.\n17-61                     Failure of owner to construct; construction by City; certification to City Clerk.\n17-62                     Notice to owner of cost; assessment and hearing.\n17-63                     Hearing on assessments; penalty; collection.\n17-64                     Driveway - Culvert fund.\nARTICLE 6. CLOSURE OF CITY STREETS FOR ATHLETIC OR SPECIAL EVENTS.\n17-65                     Closure of City streets for athletic or special events.\n17-66                     Penalty for failure to obtain permit or to comply with terms of permit.\nARTICLE 7. VACATION PROCEEDINGS.\n17-67                     Repealed\n17-68                     Repealed\n17-69                     Repealed\n17-70                     Repealed.\nCHAPTER 17.  STREETS AND SIDEWALKS.\nARTICLE 1.  IN GENERAL.\nSection 17-1.        Street names - Reference to map and plat.\nThe several streets, avenues and public places in the City shall be known and designated by names applied thereto on the\nmap and plat of the City located in the City Clerk's office, as well as the maps and plats of the several additions by the City\nlawfully accepted, and on file with the City Clerk. (Code 1958, Sec. 25-1.)\nCross reference: As to prohibition against altering street names, see Section 17-28.\nSection 17-2.        Street names to be placed on corners.\nThe names of all streets or avenues shall be placed on the street or avenue corners.  (Code 1958, Sec. 25-2.)\nSection 17-3.        Sprinkling sidewalks before sweeping.\nIt shall be unlawful for the owner or occupant of any premises to sweep or clean or cause to be swept or cleaned the street\nsidewalks in front of the premises owned or occupied by him/her unless the same shall have first been sprinkled\nsufficiently to lay the dust and dirt to prevent the raising and scattering of the dust and dirt collected thereon.  (Code 1958,\nSec. 25-3.)\nSection 17-4.        Shaking or cleaning rugs in street or sidewalks prohibited.\nIt is unlawful for the owner or occupant of any premises to sweep, clean or shake, or cause to be swept, cleaned or shaken,\nupon any street sidewalk any rugs, carpets or other like articles.  (Code 1958, Sec. 25-4.)\nSection 17-5.        Placing obstructions on streets; consent required; limitation.\nNo person shall be granted permission to place or keep any building material in any street, alley or other public place for a\nlonger period than thirty (30) days unless expressly authorized by the Council.\nSection 17-6.        Obstruction to gutters prohibited.\nIt shall be unlawful for any person to place any obstruction in a gutter or ditch at the side of any street for the purpose of\ncarrying off water from such street, or to fill in or deposit earth, sand, gravel or other substance in such gutter or ditch at\nthe point of entrance into a driveway from the street or elsewhere.  (Code 1958, Sec. 25-7.)\nSection 17-7.        Openings on sidewalk; disrepair of sidewalks.\nIt shall be unlawful for any person to leave or keep any cellar door, pit or vault or other\nsubterraneous opening on any sidewalk, street or alley, or suffer the same when in or under his/her charge to be left or\nkept open or to be in an insecure condition so that passersby may be in danger of falling into any such place, or suffer any\nsidewalk in front of any premises owned or occupied by him/her to become so broken as to endanger life or limb or so out\nof repair as to cause water to collect and remain in pools thereon.\nSection 17-8.        Merchandise on sidewalks; passageway; time limitation.\nIt shall be unlawful for any person to place or keep or suffer to be placed or kept, upon any sidewalk any goods, wares or\nmerchandise which he/she may be receiving or delivering without leaving a passageway clear upon such sidewalk of six\nfeet (6') wide for the use of foot passengers, and no person receiving and delivering such goods shall suffer the same to be\nor remain upon such sidewalk for a longer period than three (3) hours.  (Code 1958, Sec. 25-9.)\nSection 17-9.        Property owner to keep sidewalks cleaned .\nEvery owner of real property shall keep clean or cause to be kept clean the sidewalk or sidewalk areas in front of or lying\nalong his/her property and shall remove or cause to be removed therefrom all earth, ashes, weeds, trash, refuse and\nrubbish of all kinds.  (Code 1958, Sec. 25-13.)\nSection 17-10.      Property owner to remove snow and ice from sidewalks .\nEvery owner of real property shall within four (4) hours (from 5:00 p.m. to 7:00 a.m., excepted) after any fall of snow,\ncause the same and any ice which may have formed, to be removed from the sidewalk in front of or lying along his/her\nproperty into the carriageway of the street, and in so doing, shall not interfere with water running in the gutter, with the\npassage of vehicles more than can be avoided, or to obstruct any street crossing.  (Code 1958, Sec. 25-14.)\nSection 17-11.      Slippery sidewalks; City not liable .\nWhen it is not practicable to remove all the snow and ice from any sidewalk by reason of its being frozen then the owner of\nthe real property shall sprinkle and spread or cause to be sprinkled and spread upon the sidewalk, ashes, salt or some\nsuitable material to prevent such sidewalk from being slippery.  The failure of any owner of real property to do so shall not\nrender the City liable to any person for damages on account of injuries upon such sidewalk, in any manner different than if\nthe City had not required such owner to clean or sprinkle such walk.  (Code 1958, Sec. 25-15.)\nSection 17-12.      Work done by City; assessment of costs.\nIf any owner of real property shall fail, neglect, or refuse to comply with the provisions of Sections 17-9, 17-10 and 17-11,\nthe City may at once proceed to remove from such owner's real property and from the alley in the rear thereof and from\nthe sidewalk and sidewalk area in front of or lying along such owner's real property all weeds, brush, ashes, manure,\nrefuse, trash and rubbish of all kinds and may at once proceed to remove all snow, ice, earth and mud from the sidewalk in\nfront of or lying along such owner's real property.  Such work shall be done, under the direction and supervision of the\nSuperintendent of Streets and Bridges, by employees or agents of the City or by contract.  The City may assess the cost and\nexpense of such work against each lot or tract of real property, upon and for the benefit of which such work was done.  The\ncost of such work, together with five percent (5%) for the inspection and other costs, shall be assessed, levied and collected\nin the same manner as provided by ordinance for assessing, collecting and certifying sidewalk assessment.  The\nassessment, if not paid, shall be certified by the City Clerk to the County Treasurer or to the officer of the County having\ncustody of the tax list at the time of such certification, together with a ten percent (10%) penalty thereon for collection.\n The amount of such assessment shall constitute a lien against the real property described in such assessment.  (Code 1958,\nSec. 25-16.)\nSection 17-13.      Installation of underground structures; plat and data to be filed.\nAll persons occupying or using any of the streets or alleys, or any part thereof, underground, with water mains, gas mains,\nor any other kind of main pipes or conduits for wires or in any other manner occupying any part or any of the streets or\nalleys by franchise or otherwise, with any of the aforesaid things beneath the surface of any such streets or alleys, shall,\nwithin ten (10) days after the completion thereof, file in the office of the City Engineer for the use of his/her office, a plat\nand data showing as nearly as such persons can practicably show, the location and dimensions of all such underground\nstructures so used by them.  Such plats and data shall be certified to by such person, or by some office of such company, as\nbeing practically correct.  (Code 1958, Sec. 25-17.)\nSection 17-14.      Plats - Contents.\nAll plats mentioned in Section 17-13 shall show the location thereof in reference to the side lines of the street or alley in\nwhich the same is located and the depth of the same below the surface of the ground; they shall also show the dimensions\nand kind or size of pipe or conduit or other construction used.  (Code 1958, Sec. 25-18.)\nSection 17-15.      Line for poles on streets.\n(1)  The established line for poles and posts of whatever nature upon all residence streets platted over eighty feet (80') in\nwidth, shall be nineteen feet (19') from the center line of such street measured at right angles each way.\n(2)  The established line for poles and posts of whatever nature upon all residence streets platted from forty (40) to and\nincluding eighty feet (80') shall be sixteen and one half feet (16 ½') from the center line of such streets, measured at right\nangles each way.\n(3)  Upon all other residence streets not specified in (1) and (2) and upon all business streets, all poles or posts or whatever\nnature shall be put on line next to the curb between the property line and the curb.\n(4)  All poles and posts of whatever nature will be distant at least three feet (3') from any water main or service pipe, sewer\npipe or lateral that may be upon that street.  (Code 1958, Sec. 25-19.)\nSection 17-16.      Operating tractors on pavement.\nIt shall be unlawful for any person to operate over, across or upon any pavement of whatever kind, any tractor, road-\ngrader or other machine or vehicle of such construction that the metal parts thereof come into contact with the surface of\nthe pavement, or which has caterpillar traction construction, or the wheels equipped with cleats, spikes or any other\ngripping device, which tractor, road-grader or other machine or vehicle in the course of locomotion breaks, cuts into,\nindents, leaves an imprint in, mars or defaces, in any manner or to any degree, the surface of such pavement; provided,\nhowever, if such road-grader, machine or other vehicle is propelled or moved over planks or other runways in such\nmanner as to prevent defacement of the pavement, then it shall be lawful to operate such tractor, road-grader or other\nmachine or vehicle over the pavement.  (Code 1958, Sec. 25-20.)\nSection 17-17.      Oil on pavement - Pouring or spilling prohibited.\nIt shall be unlawful for any person to pour, spill or permit to be poured or spilled, or to drip or flow upon, or to deposit or\nplace in any receptacle upon any asphalt or bituminous macadam paving on any street or alley or public place, any\nkerosene, benzoin, gasoline, lubricating oil or other similar oil or oily substance, or salt or salt water, except as the same\nmay be the ordinary and natural drip from vehicles and their axles, bearings and equipment when the same are carefully\nhandled and operated. (Code 1958, Sec. 25-21.)\nSection 17-18.      Oil on pavement, oil delivery and tanks.\nAll oil delivery wagons or tanks shall have securely fastened under the taps or faucets thereunto attached, water- tight\nboxes or trays, and in handling the contents of such wagons or tanks no drip or overflow shall be permitted to fall upon\nsuch paving, and no receptacle for handling such contents shall be placed on such paving.  (Code 1958, Sec. 25-22.)\nSection 17-19.      Water connections in proposed paving districts.\nAll property and places in areas proposed to be paved, where, in the opinion of the City Council, water service connections\nor sewer connections are likely to be needed, the owner of such property, shall be required to install water service pipes\nand sewer connections, from the trunk or main lines in such streets proposed to be paved to the curb line of such property.\n If such owner refuses to install such water and sewer lines within thirty (30) days after notice thereof from the City\nCouncil, or its authorized agent, such notice to be addressed to last known address of such owner, then the City shall make\nsuch installation and charge the same against the property, such charge to become a lien upon such property.  (Code 1958,\nSec. 25-23.)\nCross reference: As to provision requiring connection with sewer system, see Section 12-46.\nARTICLE 2.  NUMBERING BUILDINGS.\nSection 17-20.      Owners and occupants to number buildings.\nOwners and occupants of all buildings shall number the buildings in the manner prescribed in this Article and as may be\nprovided by the City Council.  (Code 1958, Sec. 25-24.)\nSection 17-21.      Manner of numbering.\nThe following is adopted and declared the manner and mode of numbering of houses in the City:\nMain street, and any and all extensions thereof that may hereafter be made, shall be the division street, dividing the City\ninto north and south sections, and the parts of each street intersecting such division street shall be designated as north or\nsouth according as the parts of such intersecting streets shall be north or south of Main Street; and Commercial Street,\nfrom its southern terminus throughout to its connection with Arizona Avenue and thence with Arizona Avenue north, and\nany and all extensions of Commercial Street south or of Arizona Avenue north, that may hereafter be made, shall be the\ndivision line, dividing the City into east and west sections, and the parts of each street intersecting Commercial Street or\nthat part of Arizona Avenue north from its connection with Commercial Street shall be designated as east or west of the\ndivision line according as such parts of the intersecting street shall be east or west of the division line.  All houses and\nbuildings on streets intersecting Main Street shall be numbered north or south from Main Street, and all houses and\nbuildings on streets intersecting Commercial Street and that part of Arizona Avenue north of its connection with\nCommercial Street shall be numbered east or west from the division streets.  Houses and buildings fronting on streets that\ndo not intersect Main Street or Commercial Street or such part of Arizona Avenue shall be numbered, as nearly as possible,\nin conformity with the manner and system of numbering hereby prescribed.  One hundred (100) numbers shall be\nassigned for each block east or west and north or south from the division streets, being fifty (50) numbers to each side of\nthe street.  Blocks approximately double the ordinary frontage shall be given two hundred (200) numbers, and across all\ntracts of land intervening between portions laid out into blocks, the lines of streets shall be considered to cross the same in\nregular continuation of streets in blocks adjoining.  Numbering shall begin with \"100\" in the first (1st) blocks north or\nsouth and east or west of the division lines.  The even numbers shall be on the south and east sides and the odd numbers\non the north and west sides of the streets.  (Code 1958, Sec. 25-25.)\nSection 17-22.      Allotment of numbers.\nWhile one hundred (100) numbers are allotted to each block from the division streets, the division numbers to the\nfrontage thereof shall be one (1) number to each twelve and one half feet (12 ½') in the business districts and one (1)\nnumber to each twenty five feet (25') in the residence sections of the City, or such other aliquot part of a lot frontage as\nshall, in the judgment of the City Engineer, be deemed most advisable, it being intended hereby to preserve as nearly as\npossible a general uniformity in numbering throughout the City.  (Code 1958, Sec. 25-26.)\nSection 17-23.      Street maps with numbers to be prepared.\nThe City Engineer shall cause to be prepared from time to time, when required by City Council, maps of the several streets\nof the City, showing the numbers of all houses. Where the number of any house shall hereafter be changed, by action of the\nCity Council, the same shall be changed and numbered on said plats or maps as directed.  (Code 1958, Sec. 25-27.)\nSection 17-24.      Assigning numbers; certificate of designation.\nThe City Engineer shall assign to each house its proper number or numbers and upon application shall deliver free of\ncharge, to the owner or occupant thereof, a certificate designating the proper number or numbers of such house. (Code\n1958, Sec. 25-28.)\nSection 17-25.      Size and location of configuration.\nEach of the figures of every number shall not be less than two (2\") inches in width, being marked as to be distinctly and\neasily read. Numbers shall be displayed in a color that contrasts with the color of the building. Such numbers shall be\nplaced in a conspicuous position as to be plainly visible and legible from the street, road, fire lane, or other right-of-way or\neasement fronting the building.\nBuildings that are setback more than one hundred (100) feet from a street's curb shall be required to display address\nnumbers within fifty (50) feet of the street curb, on a surface that is easily visible from the street of address.\nThe address for commercial complexes, including apartment complexes, shall be marked at the entrance to the complex in\naccordance with this section. In addition, the address of each building or business within the complex shall be marked on\neach building/business with the address visible from the access road or parking lot.\nAdditional displays of assigned numbers may be displayed at the property owner's discretion. (Ord. 3066, section 17-25\namended, eff. 3/3/23)\nSection 17-26.      Refusal to place numbers on existing buildings.\nIt shall be unlawful for any owner or occupant of any building now erected, after having been notified by the City that the\nhouse numbers are on record in the City office, to neglect or refuse for thirty (30) days thereafter to number such building\nin conformity with the provisions of this Article.  (Code 1958, Sec. 25-30.)\nSection 17-27.      Refusal to place, or placing unauthorized, numbers on new buildings.\nIt shall be unlawful for any owner or occupant of any building hereafter erected to fail, neglect or refuse for thirty (30) days\nafter it shall have been erected to number such building according to the provisions of this Article, or to number such\nbuilding without first having obtained from the City a certificate designating the proper number.  (Code 1958, Sec. 25-31.)\nSection 17-28.      Altering numbers or street names - Consent required.\nWhenever any street shall be named, numbered or renamed or re-numbered in pursuance of this Article or any ordinance\nthat may hereafter pass, such names or numbers shall not be changed or altered without the consent of the City Council.\n(Code 1958, Sec. 25-32.)\nARTICLE 3.  EXCAVATIONS.\n(Ord. 1516, eff., 8/26/95)\nSection 17-29.      Excavation permit required; contents of application.\n(1) It is unlawful for any person other than authorized City of Trinidad employees and those under specific written contract\nwith the City, to dig up, break, excavate, tunnel, drill, bore, undermine, or in any manner break up any Right Of Way\n(ROW) or to make or cause to be made any excavation in or under the surface of any ROW, or to place, deposit, or leave\nupon any ROW any earth or excavated material obstructing or tending to interfere with the free use of the ROW unless\nsuch person shall first have obtained an excavation permit therefore from the Public Works Department. (Ord. 1516, eff.,\n8/26/95)\n(2) In the event of any emergency in which a utility line in or under any ROW breaks, bursts, or otherwise is in such\ncondition as to immediately endanger the property, life, health, or safety of any individual, the person owning or\ncontrolling such utility line, without first applying for and obtaining an excavation permit under this regulation, shall\nimmediately take proper emergency measures to cure or remedy the dangerous conditions for the protection of property,\nlife, health and safety of individuals. Such person shall apply for an excavation permit not later than the end of the next\nbusiness day and shall not proceed with permanent repairs without first obtaining an excavation permit under this\nregulation. The normal excavation permit fees shall apply to any such emergency work. (Ord. 1516, eff., 8/26/95)\n(3) No excavation permit shall be issued unless a written application for the issuance of an excavation permit is submitted\nto the Public Works Department at least two business days prior to the anticipated time of the excavation work. The\nwritten application shall include the following:\n(a) Applicant's name\n(b) Applicant's address\n(c) Application date\n(d) Location of the excavation\n(e) Purpose of the excavation\n(f) Date of commencement of the excavation\n(g) Date of completion of the excavation\n(h) Proposed size of the excavation cut in square yards\n(i) Contractor's license number (if applicable)\n(4) The application shall be accompanied by a plan showing the location and extent of the proposed excavation and a\ntraffic control plan for the work area.\n(5) The application shall be accompanied with proper fees. The Application and Inspection Fee shall be $1.00 per square\nfoot of excavation with a minimum fee of $20.00. Any person doing any excavation work without a permit under other\nthan emergency repairs of utility lines that endanger the property, life, health, or safety of any individual shall be charged\ndouble the normal fees.\n(6) Any applicant shall be responsible for providing traffic control in accordance with the Manual on Uniform Traffic\nControl Devices. A traffic control plan shall be provided with the excavation permit application. It shall be the\nresponsibility of the applicant to provide all necessary traffic control devices per the traffic control plan and to assure the\nsafety of the public. (Ord. 1516, 8-26-1995)\nSection 17-30.      Excavation permit; conditions of issuance.\n(1) Following approval of the application and payment of all fees the Public Works Department shall issue a permit to the\napplicant for the work described in the application. All excavation work shall comply with all standards for construction,\ntraffic control standards, and safety regulations as have been adopted by the City to restore the surface to its original\ncondition, prevent subsidence and collapse, restore deterioration and otherwise protect the integrity of the ROW, and to\nprotect the public from hazards created by such excavation work. (Ord. 1516, 8-26-1995)\n(2) No permit shall be issued to any person who, in the opinion of the Public Works Department, is not qualified to\nperform the work in accordance with these regulations. Any person who is denied a permit may appeal such denial to the\nCity Manager within ten business days of such denial. (Ord. 1516, 8-26-1995)\n(3) The excavation permit will expire three months after the proposed completion date. One three month extension may be\nrequested prior to the expiration of the original permit. The application and inspection fee is non-refundable.\nSection 17-31.      Excavation permit; work requirements.\n(1) The permittee shall obtain utility locations from all utility companies prior to commencing the excavation work. (Ord.\n1516, eff. 8/26/95)\n(2) A permit issued under these regulations shall at all times be in the possession of a competent person actually on the\nsite representing the applicant. (Ord. 1516, eff. 8/26/95)\n(3) The Public Works Director may suspend or revoke any permit for:\n(a) Violation of any condition of the permit, any provision of this regulation, or any other applicable law.\n(b) The existence of any condition or the doing of any act endangering life or property. (Ord. 1516, eff. 8/26/95)\n(4) A stop work order may be issued by the Public Works Director to any person doing or causing any work to be done in\nthe public right of way without a permit or in violation of any provision of this regulation. Stop work orders shall be\neffective immediately.  It is unlawful for any person to continue work for which a stop work order has been issued.\n(5) Protection of utilities. Every permittee making an excavation in or under any street, sidewalk or right of way shall, at\nhis expense, sustain, secure and protect any pipes, poles, mains, cables, utilities or conduits laid or erected in the ROW\nfrom injury and replace and compact the earth wherever the same shall have been removed, loosened or disturbed, under\nor around them, so that they shall be well and substantially supported. If any permittee fails to sustain, secure or protect\nsuch pipes, poles, mains, cables, utilities or conduits from injury or to replace and compact the earth under or around\nthem, as the provisions of this section require, then the same may be done by the entity to whom the same may belong and\nthe cost thereof and all damages sustained by such entity thereby shall be paid by such permittee and in default thereof,\nsuch entity may maintain an action against him therefor.\n(6) Excavation backfill. The permittee shall backfill the excavation in accordance with one of the two following\nmethodologies as set forth below:\n(a) METHOD A\n(I)  Backfill below the top two (2) feet shall be compacted to 90% of its maximum Modified Proctor density\n(ASTM D 1557). Backfill material shall be clean dry material free from muck, frozen lumps, vegetative matter or\nrubbish. All fill shall be placed in uniform and relatively level layers not to exceed eight inches prior to\ncompaction.\n(II)  The top two (2) feet shall be backfilled with well graded aggregate with a maximum size of one inch\nmaterial and shall be compacted to 95% of its maximum Modified Proctor density (ASTM D 1557). The fill shall\nbe placed and compacted at a moisture content within + 2% of its optimum moisture. All fill shall be placed in\nuniform and relatively level layers not to exceed eight inches prior to compaction.\n(III)  The City may perform compaction density tests on any excavation.  Any backfill not meeting the\ncompaction requirements will be removed by the permittee and recompacted as necessary to meet the\nrequirements.\n(b) METHOD B\n(I)  Backfilling shall be accomplished via the use of flowable fill. Flowable fill is a self-leveling flowable, lean\nconcrete mix which can be placed in one or more lifts with no tamping required. The 28 day compressive\nstrength shall be less than 60 psi to ensure the backfill can be easily re-excavated to facilitate future repairs, but\nshall be greater than 40 psi to ensure stability of the trench.\n(II)  The flowable fill mix design shall be as determined by the City of Trinidad Engineering Department based\nupon the availability of materials and shall consist of water, portland cement, fine and coarse aggregates.\nFlowable fill shall be mixed in accordance with ASTM Standard Specifications for Ready Mix Concrete. The\nflowable fill shall be thoroughly mixed prior to discharging to ensure a uniform product and shall be discharged\nas close as practical to its final location to reduce segregation. Use of a spud vibrator is recommended to\nimprove the consolidation of the flowable fill mix.\n(III)  Use of flowable fill eliminates the need for any compaction of the\nbackfill. The maximum layer thickness shall be four feet. Additional layers\nshall not be placed until the flowable fill can be walked on without indenting\nmore than two inches.\n(7) Pavement repair.\n(a)  On asphalt paved streets, the contractor shall place hot bituminous pavement to the depth of the existing street\nsurface or a minimum of three (3) inches, whichever is greater.\n(b)  On bricked streets, the contractor shall reconstruct the excavated portion of the street by means of the following\nprocedure: A two inch thick asphalt base shall be placed on the compacted subbase. This is covered with a one inch\nlayer of sand on which the bricks are laid tight. The top surface of the bricks is covered with sand which is broomed\ninto the cracks around the bricks. A small vibratory compactor is used to settle the sand down into the cracks to\nprovide a tight fit.\n(c)  Any excavations done during periods that hot bituminous pavement is not available shall be temporarily patched\nwith cold bituminous asphalt. Within a one-year period of time all temporary patches shall be made permanent by\nthe permittee. The warranty period will not begin until the permanent patch has been made.\n(d) If the applicant desires the City of Trinidad Street and Bridge Department to make the street patch, said applicant\nshall pay for the necessary repairs at the following rates: (Ord. 1585, eff., 5-2-98)\nAsphalt Patch - $40.00 per square yard\nBrick Patch - $85.00 per square yard\nConcrete Patch - The City of Trinidad is not capable of performing concrete patch work.  Any such work required and\nrequested of the City shall be contracted out and the applicant shall be assessed the City’s cost plus 10%. (Ord. 1585,\neff., 5-2-98)\nTraffic Control - The applicant shall be charged a minimum of $50.00 for the setup and removal of traffic control\ndevices at each excavation patch location.  Major excavation patches will be assessed for the traffic control for the\nactual time and material costs incurred. (Ord. 1585, eff., 5-2-98)\nSection 17-32       Excavation permit; indemnification. (Ord. 1516, eff., 8/26/95)\nThe permittee shall indemnify and hold the City of Trinidad harmless and free from liability on account of any injury or\ndamage to persons or property resulting from or related to the permittee's exercise of any rights under an excavation\npermit from the City of Trinidad. Such duty of indemnification shall include, but shall not be limited to, the City's\nreasonable attorney's fees and costs in defending any claims brought against it as a result of the permittee's acts or\nomissions taken with respect to or as a result of an excavation permit issued by the City of Trinidad. In the event a claim is\nbrought either jointly or independently against the City as a result of acts or omissions of permittee covered under this\nduty of indemnification, the City, in its sole and conclusive discretion, may permit defense of it by permittee or the City\nmay separately defend, without limiting or reducing the permittee's duty of indemnification hereunder.\nSection 17-33.      Excavation permit; warranty. (Ord. 1516, eff. 8/26/95)\nAny patching, backfill compaction, or other work done as part of the excavation shall be warranted by the applicant against\nall defects for a period of twenty-four (24) months from the completion of such work. Any settlement of the surface within\nsuch twenty-four (24) month period shall be deemed conclusively to have resulted from improper construction techniques\nor defective compaction by the applicant. Nothing contained in these regulations shall be construed to require the\napplicant to maintain any repairs to pavement made by the City of Trinidad Street and Bridge Department if such repairs\nshould prove to have been defective. If any repairs are required to the excavation area (due to improper construction\ntechniques or defective compaction) during the warranty period, the applicant shall be billed for said repairs if they are\nperformed by City forces.\nSections 17-34 and 17-35 - REPEALED (Ord. 1516, eff. 8/26/95)\nARTICLE 4.  SIDEWALK CONSTRUCTION.\nSection 17-36.      Maximum and minimum widths of sidewalks.\nAll sidewalks shall be not less than five feet (5') and not more than twelve feet (12') in width, unless otherwise ordered by\nthe City Council, measured from the front line of the lots upon each street at right angles with such line toward the center\nof the street.  (Code 1958, Sec. 25-43.)\nSection 17-37.      Sidewalks to conform to established grade; supervision of laying.\nAll sidewalks shall be laid to the established grade of the City, which shall be shown or designated by the City Engineer free\nof charge to the owner of the abutting property, which grade shall be established by ordinance, or proper survey adopted\nby the City Council.  If the sidewalks are not so laid upon the grades so designated, the City Council may direct them to be\nrebuilt or repaired as hereinafter provided; and each sidewalk shall be laid under the direction and supervision of the City\nEngineer.  (Ord. 1200, Sec. 1, 4/21/81.)\nSection 17-38.      Slope.\nAll sidewalks shall be constructed with a dip or incline and with the same uniform grade or slope along the streets as the\nstreets themselves.  Whenever the streets have a grade other than longitudinal, there shall be no steps or setoffs upon the\nsidewalk other than that deemed necessary by the City Council.    (Code 1958, Sec. 25-45.)\nSection 17-39.      Sidewalk construction - Permit required.\nNo person shall begin the construction of any sidewalks without having first obtained a permit from the City Engineer.\n (Code 1958, Sec. 25-46.)\nSection 17-40.      Application for permit.\nThe City Engineer shall designate the grade upon which the sidewalk shall be built; and shall issue a permit and\ninstructions thereof, whenever application is made in due form upon printed blanks to be provided by the City, setting\nforth specifically the location and nature of the walk to be constructed.  (Code 1958, Sec. 25-47.)\nSection 17-41.      Sidewalk openings for fuel and light to be covered.\nAll openings for the admission of fuel and light in sidewalks shall be securely covered with iron or iron and glass covers.\n (Code 1958, Sec. 25-48.)\nSection 17-42.      Access to basement to be covered.\nThe owner or occupant of any building used for business purposes may construct and maintain, so long as the building\nshall be used for such purposes, upon the sidewalk in front of such building or upon any public alley at the side thereof, an\nopening for the purpose of affording ingress to and egress from the basement of such building; provided, however, no such\nopening shall be allowed unless it be constructed entirely within the lines of the lot upon which the building shall stand;\nand, provided further, every such opening shall be provided with a substantial cover or grating of iron, or shall be\nprotected by a substantial and safe railing of iron to be approved by the City Engineer.  (Code 1958, Sec. 25-49.)\nSection 17-43.      Curb, gutter and/or sidewalk requirements - New construction.\nWhenever any new building or structure is constructed or erected, and no sidewalk, curb and/or gutter exists in front of or\nalong the property where such construction is taking place or the existing sidewalk, curb and/or gutter does not extend the\nfull length of the property, that abuts an existing street right-of way, the City's Engineering Department shall order the\nproperty owner to construct such sidewalk, curb and/or gutter or portion thereof.  The Engineering Department may\nwaive such requirement upon good cause shown.  Should the property owner fail or refuse to comply with the order to\nconstruct sidewalk, curb and/or gutter, or should the property owner wish to appeal the order of the Engineering\nDepartment, either the City or the property owner may request a hearing before City Council.  Conduct of the hearing, and\naction taken pursuant to the hearing shall be in accordance with Sections 17-44 through 17-50 of this Code.  The City\nCouncil shall order the construction of such sidewalk, curb and/or gutter unless good cause be shown.  No certificate of\noccupancy with respect to the new building or structure shall be issued until the sidewalk, curb and/or gutter has been\nconstructed or the construction requirement has been waived by the City.  Any waiver granted pursuant to this Section\nshall not be permanent, and shall not prevent the City Council from ordering the construction of curb, gutter and/or\nsidewalk at such location at a later date.  (Ord. 1453, 08/03/93.)\nSection 17-44.      Hearing to consider construction of sidewalk, curb and/or gutter.\nUpon the request of the City Manager or upon its own motion, City Council may conduct a hearing to determine whether\nto order any sidewalk, curb and/or gutter or portion thereof, to be constructed by the adjacent or abutting property owner.\n Written notice of such hearing shall be served upon the adjacent or abutting property owner by either first class mail to\nthe last known address of such property owner, or by delivering a copy thereof to the owner or his/her agent, or by leaving\na copy thereof at the owner's usual place of abode with any member of the owner's family over the age of eighteen (18)\nyears, at least five (5) days prior to the date of the hearing.  At the hearing, the adjacent or abutting owner(s) shall have the\nright to be heard on the question of whether the sidewalk, curb and/or gutter or portion thereof shall be constructed or\nrepaired.  (Ord. 1453, 08/03/93.)\nSection 17-45.      Order to construct curb, gutter and/or sidewalk.\nIf following the hearing the City Council determines that it is necessary that any sidewalk, curb and/or gutter, or portion\nthereof, be constructed, it shall on its own motion, order the same to be done by the adjacent or abutting property owner.\n A written notice of said order shall be served on the adjacent or abutting property owner in the manner set forth in\nSection 17-46. Such notice shall direct the property owner to construct the sidewalk, curb and/or gutter within a period of\ntime not less than fifteen (15) days from the date of service of the notice, and shall further advise the property owner that if\nthe same is not constructed by the owner within the time specified, the City may construct or repair the same, and assess\nthe costs thereof against the property owner.  (Ord. 1453, 08/03/93.)\nSection 17-46.      Failure of owner to construct.\nWhenever any sidewalk, curb and/or gutter shall be ordered by the City Council to be constructed, and the abutting or\nadjacent property owner fails to do so within the time specified in the notice to construct, such work may be done by City\nforces or by an independent contractor retained by the City for such purpose. (Ord. 1453, 08/03/93.)\nSection 17-47.      Assessment of cost against property owner.\nUpon the completion of construction of sidewalk, curb and/or gutter by  City forces or by independent contractors\nemployed by the City for such purposes, the costs thereof shall be assessed against the abutting or adjacent property owner\nor owners.  The assessment shall be the actual costs of labor, equipment or the contract price of an independent contractor\nplus five percent of said costs for inspection and other incidental costs in connection therewith.  (Ord. 1453, 08/03/93.)\nSection 17-48.      Notice of assessment.\nThe City Clerk, as soon as practicable after such charge has accrued, shall send by first class mail, addressed to the owner\nof such abutting or adjacent property at the last known post office address of such owner, a notice of such assessment,\nwhich notice shall contain a description of such abutting or adjacent property, the name of the owner or owners of such\nproperty, the amount of the assessment, a statement advising that the owner may protest the amount of the assessment in\nwriting to the City Clerk within ten (10) days of the mailing of the Notice, and a statement that the assessment must be\npaid within thirty (30) days of the mailing of notice unless a timely written protest has been filed with the City Clerk.  (Ord.\n1453, 08/03/93.)\nSection 17-49.      Protest of assessment.\nUpon receipt of the written protest of assessment, the City Clerk shall refer the protest to the City Council, which shall\nschedule a hearing on the protest.  The property owner shall be notified in writing of the date and time of the hearing.  At\nthe hearing, the property owner shall have the right to be heard before the Council as to the justness and correctness of the\namount of the assessment.  (Ord. 1453. 08/03/93.)\nSection 17-50.      Failure of owner to pay assessment.\nIf the property owner shall fail to pay the assessment within thirty (30) days of the mailing of the notice, or the date by\nwhich City Council has ordered payment to be made in full or any installment payment, the City Clerk shall certify the\nassessment to the County Treasurer, to be collected in the same manner as other taxes assessed upon said property.  The\nassessment shall be a lien against such lot or tract of land until paid and shall have priority over all other liens except\ngeneral taxes and prior special assessments.  (Ord. 1453, 08/03/93.)\nSection 17-51.      Curbs and gutters - Materials.\nAll curbs and gutters, or curbs and gutters combined, shall be laid, constructed, rebuilt or repaired of concrete, in\naccordance with the requirements of the City ordinances and the specifications promulgated by the City Engineer.  Said\nspecifications shall be maintained in the Office of the City Engineer.  (Ord. 1200, 04/21/81.)\nSection 17-52.      Curbs on curb lines; gutters to attach to curbs.\nAll curbs shall be built upon the established curb lines of the street and the elevation of such curb shall be determined and\ndesignated by the City Engineer.  All gutters shall be laid and constructed upon the established grade of the street and shall\nabut or be attached to the outside of the curb.  (Code 1958, Sec. 25-59.)\nSection 17-53.      Street lawns and parks to conform to grade.\nThe space between the sidewalks and the street curb shall be for street lawns and parks.  All street lawns or parks shall be\nmade so as to conform to the grade of that part of the street upon which they abut, and shall be kept by the owner of the\npremises free from holes, depressions, ridges or obstructions that are liable to cause injury.  (Code 1958, Sec. 25-60.)\nSection 17-54.      Article not applicable in commercial districts; City's jurisdiction over parks.\nNothing in this Article shall in any manner be construed to conflict or interfere with the laying of sidewalks or paving in\nthe business part of the City or with the jurisdiction of the City over the parks for the construction of any public or other\nimprovement that the City may desire or authorize constructed over, upon or across such property.  (Code 1958, Sec. 25-\n61.)\nSection 17-55.      Removal of grade or line stakes prohibited.\nNo grade or line stakes set by the City Engineer for the purposes of this Article shall be removed or otherwise disturbed\nexcept by order of the City Engineer or City Council.  (Code 1958, Sec. 25-62.)\nSection 17-56.      Curb line and curb radius.\nCurb lines of all residential streets and curb radii at intersections shall be determined in accordance with the State of\nColorado Department of Highways, Roadway Design Manual, latest revised edition.  (Ord. 1200, Sec. 4, 04/21/81.)\nSection 17-57.      Fund established to front costs of repair or replacement.\nThere is established a fund to front the cost of repair or replacement of existing sidewalk, curb and gutter.  The City\nCouncil, in its discretion, shall determine when monies from such fund shall be used to front the cost of repair or\nreplacement of sidewalk, curb and/or gutter.  If the City Council directs the fronting of monies to pay such costs, the\nadjoining or abutting property owners may be required to reimburse the City for its costs.  The City may enter into an\nagreement with the adjoining or abutting property owners allowing such property owners to reimburse the City in\ninstallment payments over a period of time.  Any such agreement shall be approved by City Council.  (Ord. 1453,\n08/03/93.)\nSection 17-58.      Repair or replacement of curb, gutter and/or sidewalk.\n(1)  The City Council may in its discretion, order the repair or replacement of any sidewalk, curb and/or gutter pursuant to\nthe procedures set forth in Sections 17-44 and 17-45 of the Code of Ordinances.\n(2)  If the adjoining or abutting property owners fail to comply with the order to repair or reconstruct sidewalk, curb and\ngutter, the City Council may order that such work be done by City forces or by independent contractor pursuant to the\nprocedures set forth in Section 17-46, and assess costs for such work in accordance with the procedures set forth in Section\n17-47 through 17-50.  The City may be reimbursed for expenses pursuant to an agreement with the adjoining or abutting\nproperty owners, as set forth in Section 17-57.  (Ord. 1453, 08/03/93.)\nARTICLE 5. CULVERTS.\nSection 17-59.      When construction of culvert required.\nWhenever the owner or tenant of any property shall, in order to gain access from a public street to his/her property, fill in\nor cause to be filled in any ditch or gutter, lying between such street and such property, used for street drainage purposes,\nor shall, in order to gain access, place earth, sand, gravel or any other substance in such ditch or gutter, whereby the flow\nof water may be obstructed, the City Council, upon report of such condition by the Superintendent of Streets may, by\nresolution, order the owner of the property to place or construct in such ditch or gutter, at the point of access from the\nstreet to such property, a suitable culvert, which shall be in accordance with specifications to be prepared by the City\nEngineer, and which when in place shall be capable of carrying the full capacity of such ditch and at the same time permit\na ready ingress to and egress from such property.  The City Engineer shall, upon order of the Council, prepare\nspecifications for the type of culvert best suited for the case in question.  (Code 1958, Sec. 25-74.)\nSection 17-60.      Notice to owner to construct culvert.\nUpon the entry of an order by the Council, the Superintendent of Streets shall forthwith cause to be served on the property\nowner a written notice of such order requiring the installation of such culvert within fifteen (15) days from the date of\nservice, which service shall be accomplished by delivering a copy of said notice to such owner, or his/her agent, or by\nleaving a copy thereof at the usual place of abode of such owner with any member of his/her family over the age of\neighteen (18) years.  In case such owner be a nonresident, and have no resident agent, service shall be made by mailing\nsaid notice addressed to such owner at the latest address of such owner contained on the general tax assessment roll in the\noffice of the Treasurer of Las Animas County.  (Code 1958, Sec. 25-75.)\nSection 17-61.      Failure of owner to construct; construction by City; certification to City Clerk.\nUpon failure or refusal of the property owner to construct such culvert within the time specified, it shall be constructed\nunder the direction of the Superintendent of Streets and Bridges, who, upon completion of work shall certify in writing to\nthe City Clerk the cost of such culvert, together with a description of the real estate served by it and the name of the owner\nof such real estate.  (Code 1958, Sec. 25-79.)\nSection 17-62.      Notice to owner of cost; assessment and hearing.\nThe Clerk shall, by registered mail, return receipt requested, notify the owner of the property to be assessed that the\nculvert has been constructed, the cost thereof, and that any complaints or objections which may be made in writing by\nsuch owner to the City Council shall be filed in the office of the Clerk within fifteen (15) days from the date of such notice\nand will be heard and determined by the Council before the passage of a resolution assessing the cost of such culvert; and\nthe date when and place where such complaints and objections will be heard.  (Code 1958, Sec. 25-77.)\nSection 17-63.      Hearing on assessments; penalty; collection.\nAt the time specified in the notice, or, at some adjourned time, the Council shall hear and determine all such complaints\nand objections, and shall thereupon, by resolution, assess the cost of the culvert, together with all costs and expenses of\nthese proceedings, on the property it serves.  The amount so assessed shall from the date of such assessment constitute a\nlien against the real estate of such owner, and unless the same be paid within ten (10) days after such assessment, it shall,\ntogether with ten percent (10%) penalty, be certified by the City Clerk to the County Treasurer in the same manner as\nspecial improvement taxes are certified to such officer, to be collected according to law.  (Code 1958, Sec. 25-78.)\nSection 17-64.      Driveway - Culvert Fund.\nThere is created the driveway - culvert fund to be composed of money paid in under the provisions of this Article, warrants\nin payment of culvert construction costs shall be drawn on and payable out of this fund; provided, however, when there\nshall be insufficient moneys in said fund to meet a payment, such deficit may be met from the street and bridge fund which\nshall thereafter be reimbursed from such driveway - culvert fund.  (Code 1958, Sec. 25-79.)\nARTICLE 6.  CLOSURE OF CITY STREETS FOR ATHLETIC OR SPECIAL EVENTS.\nSection 17-65.      Closure of City streets for athletic or special event.\n(1)       (a)  City streets or designated portions of City streets may be partially or completely closed for the purpose of\nconducting athletic or special events thereon or for the purpose of ensuring the safe and efficient movement of traffic to\nand from or around an athletic event or special event which is in such  proximity to a City street that the event or any\ntraffic attendant thereto will have a significant effect on the normal traffic flow.\n(b)  When the term \"close\" or \"closure\" is used in this Section, it shall be deemed to include the partial closure of any land\nor other portion of a City street or the restriction or regulation of traffic on the City street by the Trinidad Police\nDepartment.\n(c)  The City Manager has the authority to close a City street or portion thereof for the purposes of paragraph (a) of this\nsubsection (1), when an athletic or special event is proposed to be held on such street or when a proposed event may cause\na significant disruption to the normal flow of traffic on a City street.\n(d)  The City Manager shall not approve an event which the City does not have sufficient resources to properly manage in\nthe manner consistent with the preservation of the public peace, health and safety.\n(2)  A closure by the City Manager may be authorized only if:\n(a)  A written application therefor is submitted to the City Manager at least fifteen (15) days prior to the date of the\nproposed closure, containing such information as the City Manager deems necessary, and the application is approved by\nthe City Manager.\n(b)  If in the opinion of the City Manager, liability coverage by the applicant is necessary in order to protect the public\npeace, health and safety, the applicant shall pay for and provide evidence of liability coverage in amounts deemed\nadequate by the City Manager to protect the City from any injuries or damages which may arise out of the closure of the\nCity's assistance in ensuring the safe conduct of the closure.\n(c)  The closure is implemented in a manner that will cause the least inconvenience to the driving public consistent with\nthe requirements of the athletic or special event and the event can be conducted in a manner consistent with the\npreservation of the public peace, health and safety.\n(3)  If the City Manager approves the application, a permit shall be issued to the applicant authorizing the closure as\nrequested by the applicant or as modified by the City.\n(4)  No liability shall attach to the City of Trinidad for any injuries or damages which are caused solely by the use of a City\nstreet for an athletic or special event when such event has not been approved by the City Manager.  (Ord. 1396, 6/04/91.)\nSection 17-66.      Penalty for failure to obtain permit or to comply with terms of permit.\nAny person who conducts an athletic or special event on a City street when a permit for said event has not been issued or\nany person who violates the terms of a permit which has been issued for an athletic or special event, commits a\nmisdemeanor and is subject to a fine of up to Three Hundred Dollars ($300.00) or imprisonment of up to ninety (90)\ndays, or both.  (Ord. 1306, 6/04/91.)\nARTICLE 7.  VACATION PROCEEDINGS.\nSection 17-67.      Repealed (Ord. 3007, eff. 10/30/20)\nSection 17-68.      Repealed (Ord. 3007, eff. 10/30/20)\nSection 17-69.      Repealed (Ord. 3007, eff. 10/30/20)\nSection 17-70.      Repealed (Ord. 3007, eff. 10/30/20)\n", "Chapter 18 - [Title from PDF Content]": "Chapter 18 - Television Franchise\nSections:\n18-1                 Approval of Cable Television System Franchise Agreement with Comcast of Colorado/Pennsylvania/West\nVirginia, LLC. (Ord. 1880, eff., 3/27/09, Ord. 1577, eff., 12/27/97)\n18-2 to 18-14  REPEALED (Ord. 1577, eff., 12/27/97)\nCHAPTER 18.  TELEVISION FRANCHISE.\nSection 18-1.  Approval of Cable Television System Franchise Agreement with Comcast of\nColorado/Pennsylvania/West Virginia, LLC\nThe City of Trinidad, Colorado, acting by and through its Mayor and City Council, having previously approved a CABLE\nTELEVISION SYSTEM FRANCHISE AGREEMENT with Century Trinidad Cable Television Corp., which agreement is\nattached hereto and incorporated herein by this reference as if fully set forth in this Ordinance, does hereby approve a\nFRANCHISE RENEWAL AGREEMENT with Comcast of Colorado/Pennsylvania/ West Virginia, LLC, successor and\nassignee to Century Trinidad Cable Television Corp., which renewal agreement is attached hereto and incorporated herein\nby this reference as if fully set forth in this Ordinance.\nSection 18-2 through 18-14.  REPEALED  (Ord. 1577, eff. 12/27/97).\n\n", "Chapter 19 - [Title from PDF Content]": "Chapter 19 - Trees and Vegetation\nARTICLE 1.  PROTECTION, MAINTENANCE AND REMOVAL OF  TREES, SHRUBS AND\nOTHER VEGETATION.    \nSections:  \n19-1                       Purpose and intent.   \n19-2                       Definitions.   \n19-3                       License required to cut or remove trees; liability insurance; license fee.   \n19-4                       Public nuisances.   \n19-5                       Unlawful to permit public nuisance.   \n19-5.1                    Unlawful to permit tree topping.\n19-6                       Inspection.   \n19-7                       Abatement procedure and notice.   \n19-8                       Rights of property owner.   \n19-9                       Responsibility for damaging trees on public property.   \n19-10                     Interference unlawful.   \n19-11                     Penalty clause.   \n19-12                     Severability.   \nARTICLE 2.  HAZARDOUS GROWTH.    \n19-13                     Hazardous growth - Defined.   \n19-14                     Declaration by City Council.   \n19-15                     Cutting and removal of hazardous growth required.   \n19-16                     General notice to cut and remove.   \n19-17                     Notice; failure to comply.   \n19-18                     Assessing costs.   \n19-19                     Notice of assessment.   \n19-20                     Collection of assessments.   \n19-21                     Penalty.   \n19-22                     Payment of assessment will not avoid fine.   \nARTICLE 3.  URBAN FORESTRY BOARD.    \n19-23                     Creation and Establishment.         \n19-24                     Term of Office.            \n19-25                     Compensation.   \n19-26                     Duties and Responsibilities.      \n19-27                     Operation.   \nCHAPTER 19.  TREES AND VEGETATION.  \n  \nARTICLE 1.  PROTECTION, MAINTENANCE AND REMOVAL OF TREES, SHRUBS AND OTHER\nVEGETATION.    \nSection 19-1.        Purpose and intent.    \n   (1)  Purpose.  It is the purpose of this ordinance to promote and protect the public health, safety and general welfare by\nproviding for regulation of protective methods, maintenance and removal of trees, shrubs and other plants within the City\nof Trinidad.   \n\n   (2)  Intent.  It is the intent of the City Council of the City of Trinidad to promote:   \n   (a)  The protection, maintenance, removal and survival of desirable trees, shrubs, and other plants within the City; and   \n   (b)  The control of Dutch Elm Disease by accepted methods of treatment, removal and disposal of infected wood; and   \n   (c)  The protection of citizens from personal injury and property damage, and the protection of the City of Trinidad from\nproperty damage, caused by improper protective efforts, maintenance, or removal of trees, shrubs, or other plants located\nwithin the City.   \nSection 19-2.        Definitions.    \n   (1)  City Inspector  shall mean a City employee and/or contractor designated by the City Manager of the City of Trinidad\nto enforce and carry out the purpose and intent of this ordinance including issuance of permits.   \n   (2)  City-owned property  shall mean property owned by the City, or implied or expressly dedicated to the public for\npresent or future use or purposes of vehicular or pedestrian traffic, or for public easements.   \n   (3)  Parkway  shall mean City-owned property located within the sidewalk area in front of privately-owned property,\nwhich includes the area between the private property line and the curb line, if curb exists, and between the private\nproperty line and the traveled portion of the public street, if no curb exists.   \n   (4)  Property owner  shall mean the record owner or contract purchaser of any parcel of land.   \n   (5)  Trees, shrubs, or other plants  shall mean all vegetation, woody or otherwise, except lawn grass and flowers less than\ntwenty four inches (24\") in height.   \nSection 19-3.        License required to cut or remove trees; liability license fee.    \n  (1)  Scope.  Any person who engages in or solicits the business of cutting, trimming, pruning, removing or spraying trees,\nshrubs or vines, shall not do so without first procuring a license therefor from the City Clerk.   \n   (2)  No license shall be issued unless the applicant has presented to the City Clerk a satisfactory public liability insurance\npolicy covering all operations within the scope of this Chapter in the amount of One Hundred Thousand Dollars\n($100,000.00) per accident and Twenty-Five Thousand Dollars ($25,000.00) for any accident involving bodily injury and\nFifty Thousand Dollars ($50,000.00) aggregate for property damage liability.   \n   (3)  The license fee shall be Fifteen Dollars ($15.00) per year or fraction thereof, payable in advance.   \nSection 19-4.        Public nuisances.    \n   (1)  Definition.  The following are hereby declared  public nuisances  under this ordinance:   \n     \n   (a)  Any dead or dying tree, shrub, or other plant, whether located on city-owned property or on private property.   \n     \n   (b)  Any otherwise healthy tree, shrub, or other plant, whether located on city-owned property or on private\nproperty which harbors insects or diseases which reasonably may be expected to injure or harm any tree, shrub, or\nother plant.   \n     \n   (c)  Any tree, shrub, or other plant or portion thereof whether located on city-owned property or on private\nproperty which by reason of location             or condition constitutes an imminent danger to the health, safety, or\nwelfare of the general public.   \n   (d)  Any tree, shrub, or other plant or portion thereof whether located on city-owned property or on private\nproperty which obstructs the free passage of pedestrian or vehicular traffic or which obstructs a street light.   \n     \n   (e)  Any tree, shrub, or other plant or portion thereof whether located on city-owned property or on private\nproperty which dangerously obstructs the view in the \"visibility triangle\" as such may be determined by the City.   \n     \n   (f)  Any dead, severely damaged, diseased and/or infested elm tree as follows:   \n   (I)   Any living or standing elm tree or part thereof infected with the Dutch Elm Disease, Ceratoycystis ulmi\n(Buisman), Mureau, or any of the elm bark beetles, Scolytus multistriatus (Eich.), or Hylurgopinus rufipes (Marsh.)\nor European Elm Scale, Gossyparia supria (Mod.), or Elm Leaf Beetle, Galerucella xanthomelaena (Schrank).  As\nused herein, the word \"infected\" or \"infection\" shall mean also infested or infestation.   \n   (II)  Any dead elm tree or part thereof, including logs, branches, stumps, firewood or other elm material from\nwhich the bark has not been removed.   \n   (III) Any dead or severely damaged branch or part of an elm tree.   \nSection 19-5.        Unlawful to permit public nuisance.    \n   It shall be unlawful for any person to permit any public nuisance as defined in this Chapter to remain on any premises\nowned or controlled by him/her within the City, or in the alley behind such property, or in the parkway in front of such\nproperty.  Any such nuisance may be abated in the manner prescribed in this Chapter.   \nSection 19-5.1.           Unlawful to permit tree topping.   \n  (1)  It shall be unlawful as a normal practice for any person, firm, or city department to top any street tree, park tree, or\nother tree on public property.  Topping is defined as the severe cutting back of limbs to stubs larger than three (3) inches\nin diameter within the tree’s crown to such a degree so as to remove the normal canopy and disfigure the tree.  Trees\nseverely damaged by storms or other causes, or certain trees under utility wires or other obstructions where other pruning\npractices are impractical may be exempted from this ordinance at the determination of the City’s Urban Forestry Board, or\nat the determination of the City of Trinidad Public Works Department if an emergency situation exists.  (Ord. 2027, eff.\n5/12/17)  \nSection 19-6.        Inspection.    \n   (1)  The City Inspector or designated contractor shall inspect all premises and places within the City as often as\npracticable to determine whether any condition described in Section 19-4 exists therein, subject to the provisions of\nsubsection B of this Section.  The City Inspector or designated contractor shall also investigate all reports of conditions\ndescribed in Section 19-4.   \n   (2)  The City Inspector or designated contractor may enter upon private premises at any reasonable time for the purpose\nof carrying out any of the duties assigned to him/her hereunder provided he/she has either received the consent of the\nowner, agent or lessee of such premises to enter upon the premises, or has obtained a search warrant from the Municipal\nJudge authorizing him/her to enter upon such premises for inspection purposes.  The City Inspector or designated\ncontractor shall follow the procedures set forth in \"Colorado Municipal Court Rules of Procedure\" in obtaining a search\nwarrant.   \n   (3)  Upon finding conditions described in Section 19-4, the City Inspector or designated contractor shall immediately\ntake such steps for diagnosis as may be necessary to remedy such condition.   \nSection 19-7.        Abatement procedure and notice.    \n   (1)  Any public nuisance as defined in this Chapter, which is located on city-owned property, except the alleys behind\nprivately-owned property and the parkways in front of privately-owned property shall be pruned, removed, or otherwise\ntreated by the City to whatever fashion is required to cause the abatement of the nuisance within a reasonable time after its\ndiscovery.  \n   (2)  With respect to any elm tree-related public nuisance under this ordinance which is located either on city-owned or\nprivately-owned property, the elm tree or part thereof constituting such a nuisance shall be removed, trimmed and\ndisposed of, or otherwise effectively treated so as to destroy and prevent as fully as possible the spread of any condition\ndescribed in Section 19-4.  Such abatement procedures shall be carried out in accordance with the current technical and\nexpert methods and plans as may be determined by the City Inspector or designated contractor. The City Inspector or\ndesignated contractor shall establish specifications for removal, treatment, trimming, and disposal methods consistent\ntherewith.   \n   (3)  Any public nuisance as defined in this Chapter, which is located on privately-owned property or in the alleys behind\nsuch privately-owned property or within the parkway in front of such property, shall be pruned, removed, or otherwise\ntreated by the property owner, his/her agent, lessee or occupant of such property in whatever fashion is required to cause\nthe abatement of the nuisance.   \n   (4)  Upon the determination by the City Inspector that any public nuisance as defined in this Chapter exists on privately-\nowned property or in the alleys behind such privately-owned property or parkway in front of such privately-owned\nproperty, the City Inspector shall cause a written notice to be personally served upon the owner or owners of record of\nsuch privately-owned property or sent by certified mail, return receipt requested to the last known address of the owner or\nowners of such privately-owned property.  In those instances where the nuisance consists of a diseased tree, the Inspector\nshall also tag and/or mark said tree, which tag and/or marking shall not be removed until the nuisance has been abated.   \n   (5)  Such notice shall contain the following:   \n     \n   (a)  Such notice shall describe the kind of tree, shrub or other plant or plant part which has been declared to be a\npublic nuisance, its location on the property, and the reason for declaring it a nuisance.   \n     \n   (b)  Such notice shall describe by legal description or by street address the premises;   \n     \n   (c)  Such notice shall state the actions that shall be undertaken to abate the nuisance;   \n     \n   (d)  Such notice shall require the abatement of the nuisance no less than twenty (20) days after the notice is\ndelivered or sent to the record owner or owners;   \n     \n   (e)  Such notice shall also state that if such nuisance shall not have been abated within the time provided, the\nowner, lessee or occupant may be charged with a violation of Section 19-4 for maintaining a public nuisance and\nassess the cost against such property.   \n     \n   (6)  If the owner, person in control, lessee or occupant of such property fails to abate such nuisance within twenty (20)\ndays after personal service of the notice or twenty (20) days after the date of mailing of the notice, if service was by\ncertified mail, the City Inspector shall proceed to have such nuisance abated.  Any expense incurred by the City in so doing\nshall be a charge and lien upon said property and shall be collected as a special assessment in the same manner as other\nspecial assessments, or such expenses may be collected from the owner of the property in an action at law.   \nSection 19-8.        Rights of property owner.    \n   (1)  The owner, agent, lessee or occupant of any privately- owned property abutting a parkway shall have the right to:   \n   (a)  Plant or transplant trees, shrubs, or other plants within such parkway, except that the location and, spacing of\nany tree or trees planted or transplanted, must be first approved by the City;   \n   (b)  Place a container or enclosure for trees, shrubs, or other plants on such parkway;   \n     \n   (c)  Water or fertilize any tree, shrub, or other plant located in such parkway.     \n   (2)  This Section shall not be construed to permit such owner, agent, lessee or occupant to create a public nuisance as\ndefined in this Chapter on either privately-owned property or within a parkway.   \nSection 19-9.        Responsibility for damaging trees on public property.    \n   (1)  Any person who shall injure, damage or destroy any tree situate in any public place shall promptly notify the City\nInspector of such fact.   \n   (2)  The City Inspector shall cause to be done the necessary repairing or replacement, and the person responsible for\nsuch damage or destruction shall be required to pay to the City the costs of such repair or replacement.   \nSection 19-10.      Interference unlawful.    \n  It shall be unlawful for any person to prevent, delay or interfere with the City Inspector or designated contractor while\nengaged in the performance of duties imposed by this Section.   \nSection 19-11.      Penalty clause.    \n   The penalty for violation of any provision of this Chapter shall be a fine of not more than Three Hundred Dollars\n($300.00) or imprisonment of not more than ninety (90) days or both such fine and imprisonment.   \nSection 19-12.      Severability.    \n   If any provision of this Article or application thereof to any person or circumstance is held invalid by any court, other\nprovisions or applications of the Article which can be given effect without the invalid provision or application shall not be\naffected, and to this end the provisions of this Article are declared to be severable.  (Ord. 1426, Sec. 1, 07/21/92.)   \nARTICLE 2.  HAZARDOUS GROWTH.     \n(1) Hazardous growth shall mean weeds, grass, brush, volunteer growth of bushes or herbaceous plants and other\nvegetation which is in excess of six inches (6\") in height and shall include: common ragweed, common milkweed, common\nsunflower, dandelion, invasive thistles, invasive mustards, sandburs, stickseeds, kochia and turf and non-ornamental\ngrasses. The foregoing enumeration is not exclusive, but rather intended to be indicative of those types of plants which are\nconsidered detrimental to health and safety and/or are invasive. The above list does not apply to non-hazardous\nornamental shrubs or non-hazardous plants growing in flowerbeds, vegetable gardens and small grain plots. \n(2) Hazardous growth shall also include all noxious weeds found on the State of Colorado Noxious Weeds List, which\nincludes A, B, C and Watchlist species. Common State listed species that occur within the City of Trinidad include, but are\nnot limited to:\nList A: Myrtle spurge\nList B: Canada thistle, dalmation toadflax, hoary cress, houndstongue, oxeye daisy, Russian knapweed, Scotch\nthistle, yellow toadflax\nList C: Bindweed, common burdock, common mullein, dame’s rocket, perennial sowthistle, puncturevine\n(a)Per the Colorado Noxious Weed Act, §§ 35-5.5-101 through 119, C.R.S. (2003), List A species must be eradicated\nand local governing bodies must report population locations to the State. Citizens are required to cooperate with the\nCity in carrying out its obligations pursuant to this act. List A species must be eliminated prior to seed development\nand\ncontinued prescribed management techniques need to be applied to every population of noxious plant.\n(b) List B species may not be allowed to spread and Colorado’s Agriculture Commissioner’s management plans for\nelimination must be followed for every population of List B species. (Elimination procedures can be found at\nhttps://ag.colorado.gov/conservation/noxious-weeds/publications.)\n(c) List C species will be addressed per local governmental jurisdiction and weed management plans, with support\nfrom the State through education, research and biological control efforts.\n(d) Watch List species are species of concern to the State and may be added to List A or List B if certain criteria are\nmet. (Ord. 3018, Repealed and re-enacted, eff. 5-14-21)\nSection 19-14. Declaration by City Council.\nThe City Council finds that hazardous growth contributes to and aggravates respiratory disease; that hazardous growth is a\npotential fire hazard endangering the inhabitants of the City of Trinidad; and that hazardous growth may conceal\naccumulations of debris and filthy deposits. \nThe City Council also finds, in keeping with the values of the State of Colorado, that hazardous growth in the form of\nnoxious weeds have a negative impact on the economy and the environment, most specifically to agricultural crops and\nnative plant populations. Many noxious weeds are toxic to livestock and people and are highly invasive. Once positive\nidentification is confirmed, control and eradication strategies shall follow professionally prescribed management\ntechniques in a timely manner in order to limit costs to property owners and damage to both infested and un-infested\nlands. (Ord. 3018, Repealed and re-enacted, eff. 5-14-21)\nSection 19-15. Cutting and removal of hazardous growth required.\n(1) It shall be the duty of each and every owner, lessee or occupant of any lot or tract of land in the city to cut below a\nheight of six inches (6\") all hazardous growth, with the exception of List A and B species (see below), on each such lot or\ntract of ground, on or along any street or roadway adjoining the same, between the property line and curb line thereof, or\non or along any alley adjoining the same between the property line and the center of such alley; and to keep said growth\ncut below six inches (6\") during all times of the year.\n(2) List A species are required to be eradicated , and List B species need to be contained and control methods must be\napplied to eradicate, if possible, such as through chemical (herbicide, etc.) or mechanical (digging up entire plants by the\nroots, etc.) methods. Removal is recommended for all List C species. Successful control/eradication methods will depend\non the species, and professional treatment recommendations shall be sought and utilized for each individual species.\n(3) All hazardous growth shall, immediately upon cutting or elimination, be removed from the lot or tract of land to a\ndisposal site which conforms with the law, by the owner, lessee or occupant of same.\n(4) It shall be the duty of the owner, lessee or occupant of any lot or tract of land in the City to remove from said lot or tract\nof land, cut or eliminated hazardous growth lying upon said land regardless of source or origin. \n(5) Hazardous growth, specifically noxious weeds, shall be collected in their entirety, including the roots and seeds, placed\nin sealed plastic bags, and disposed of at the landfill, or destroyed by another Commissioner of Agriculture-approved\nmethod. (Ord. 3018, Repealed and re-enacted, eff. 5-14-21)\nSection 19-16. General notice to cut and remove.\nThe City Clerk shall, from time to time, publish a notice in a newspaper of general circulation in the City, to all owners of\nproperty, without naming them, that it is their duty to remove hazardous growth and debris from their properties and\nfrom the streets and alleys as provided in this Article; and that, in default of cutting or elimination and removal, the work\nmay be done under the orders of the City Manager and the cost thereof, together with an administrative fee,\nwould be charged to said properties in the manner provided in this Article and that, in default of cutting and removing, the\nowners, lessees or occupants of said properties will be subject to penalties provided in this Article. (Ord. 3018, Repealed\nand re-enacted, eff. 5-14-21)\nSection 19-17. Notice; failure to comply.\n(1) In case of failure of any owner, lessee or occupant of lots or tracts of land within the City, to cut or eliminate and\nremove hazardous growth as provided in this Article, the City Manager or any officer or employee of the City designated by\nhim/her, is authorized to give notice to the owner, lessee or occupant of such property by any one of the following\nmethods:\n(a) Certified mail addressed to the last known post office address of the owner, lessee or occupant;\n(b) First class mail addressed to the last known post office address of the owner, lessee, or occupant;\n(c) Personal service of the Notice on the owner, lessee or occupant;\n(d) Or if an occupied dwelling is located on such lot or tract of land and no one is on the premises at the time service\nis attempted, by posting the Notice in some conspicuous place on the premises.\n(2) Such notice shall require the cutting or elimination and removal of such growth within fifteen (15) days of the date of\nthe notice. In the event such work is not done within the fifteen (15) days, the City Manager may then proceed to have the\nwork done as soon as practicable. (Ord. 3018, Repealed and re-enacted, eff. 5-14-21)\n(3) Any notice issued pursuant to this Section, which is served in one of the methods set forth in subsection (1), complies\nwith the requirements of subsection (2), is issued to and served on the owner of record as shown by the most current\nrecords of the County Assessor; and advises such owner of record of the right to request an administrative hearing before\nthe City Manager or his/her designee on the issue of ownership, shall be deemed valid and legally enforceable, unless as a\nresult of such hearing the City Manager or his/her designee finds that such owner of record is not the current owner of\nsaid property. (Ord. 3018, Repealed and re-enacted, eff. 5-14-21)\nSection 19-18. Assessing costs.\n(1) Upon cutting or elimination and removing hazardous growth by City forces or by independent contractors employed by\nthe City for such purpose, a charge shall be made against the owner of the property. The charge shall be actual costs for\nlabor, equipment and materials, or the contract price of an independent contractor, together with a $500 administrative\nfee thereon for inspection, noticing, and other incidental costs in connection therewith. (Ord. 3018, Repealed and re-\nenacted, eff. 5-14-21)\nSection 19-19.      Notice of assessment.    \n   The City Clerk, as soon as practicable after such charge has accrued, shall send by mail, addressed to the owner of such\nproperty, at the last known post office address of such owner, a notice of such charge, which notice shall contain a\ndescription of the lots or tracts of land, the name of the owner or owners and the amount of the assessment.  (Ord. 1176,\n7/1/80.)  \nSection 19-20.      Collection of assessments.   \n   (1)  It shall be the duty of the owner to pay such charge within twenty (20) days after the mailing of such notice, and upon\nhis/her failure to do so, such charge may be certified by the Clerk to the County Treasurer who shall collect the\nassessment, together with a ten percent (10%) penalty for cost of collection, in the same manner as other taxes are\ncollected. The laws of the State of Colorado for assessment and collection of general taxes, including the laws for the sale\nand redemption of property for taxes shall apply to the collection of such assessments.   \n   (2)  Such assessment shall be a lien against each lot or tract of land until paid and shall have priority over all other liens\nexcept general taxes and prior special assessments.  (Ord. 1330, Sec. 2, 10/20/87.)   \nSection 19-21.      Penalty.    \n   (1)  Any owner, agent, lessee, occupant or person in possession or control of land within the City who shall violate any of\nthe provisions of this Article shall, upon conviction thereof, be subject to a fine of not more than Three Hundred Dollars\n($300.00) nor less than Thirty Dollars ($30.00) or imprisonment for not more than ninety (90) days, or both.   \n   (2)  Regardless of whether a notice pursuant to Section 19- 17 has been issued to any person in violation of Section 19-15\nor a notice by the City Clerk has been published in a newspaper of general circulation in the City pursuant to Section 19-16,\nany person in violation of Section 19-15 shall be subject to prosecution in the Municipal Court and to the penalties set forth\nin this Section.  (Ord. 1330, 10/20/87.)   \nSection 19-22.      Payment of assessment will not avoid fine.   \n   \n   The fact that assessments have been made against property as provided in this Article for cutting and removing\nhazardous growth, shall not prevent the owner, lessee or occupant from being punished by fine or jailing, but such fine or\npenalty may be imposed on those found guilty of violating the provisions of this Article in all cases, whether an assessment\nhas or has not been made in accordance with the provisions of this Article. (Ord. 1176, 7/1/80.)   \nARTICLE 3.  URBAN FORESTRY BOARD.    \n     (Ord. 2027, repealed and reenacted, eff. 5/12/17)     \nSection 19-23.      Creation and Establishment.    \n   There is hereby created and established the Urban Forestry Board (formerly the City Tree Board) for the City of Trinidad,\nColorado which shall consist of up to seven (7) members, citizens and residents of this city who shall be selected and\nappointed by the City Council.    At the time of adoption of this ordinance, the existing members of the City’s Tree Board\nwill remain seated and transition to the Urban Forestry Board under their existing terms.   \nSection 19-24.      Term of Office.    \n   The term of office of the seven (7) persons selected and appointed by the City Council shall be three (3) years.  In the\nevent that a vacancy shall occur during the term of any member, a successor shall be appointed for the unexpired portion\nof the term.   \nSection 19-25.      Compensation.    \nMembers of the Urban Forestry Board shall serve without compensation.   \n Section 19-26.      Duties and Responsibilities.    \n   (1) It shall be the responsibility of the Urban Forestry Board to study and develop and/or update a written proposed work\nplan.  Said plan will include recommended practices and associated costs for the care, preservation, trimming, planting,\nreplanting, removal or disposition of street and park trees and landscape plantings.  The Board will create a plan for the\nCity to assist with Hazardous trees in residential areas.   \n   (2)  The Public Works Director shall be consulted by the Urban Forestry Board prior to presentation of the proposed\nannual work plan to the City Council to ensure said plan does not conflict with ongoing and/or proposed City activities.   \n   (3)  The plan will be presented annually to the City Council and, upon its acceptance and approval, shall constitute the\nofficial comprehensive urban forestry plan for the City.  The City Council will attempt to follow, as closely as possible, the\nplan submitted by the Urban Forestry Board.   \n   (4)  The Urban Forestry Board, when requested by the City Council, shall consider, investigate, make findings, report and\nrecommend upon any special matter of question coming within the scope of its work.   \n   (5)  The Urban Forestry Board shall develop and implement a public education plan.  The plan should include assisting\nresidents determine what are appropriate, climate-adapted, drought tolerant species of trees and landscape plantings, as\nwell as proper planting techniques of the same.   \n   (6)  The Urban Forestry Board shall work with City staff to ensure trees are pruned properly, through training efforts\nimplemented by the Board.   \n   (7)  The Urban Forestry Board will act as advocates of the existing urban forest by identifying areas or specific vegetation\nin need of care to City staff, and work with staff to ensure proper upkeep.   \n   (8)  The Urban Forestry Board may be consulted with planning choices for street landscaping and municipal projects.   \nSection 19-27.      Operation.    \n   The Urban Forestry Board shall choose its own officers, make its own rules and regulations, and keep a journal of its\nproceedings.  A majority of the members shall be a quorum for the transaction of business.  Interested individuals may\nattend meetings but will not vote.\n", "Chapter 20 - [Title from PDF Content]": "Chapter 20 - Vehicles and Traffic\nARTICLE 1.  MUNICIPAL TRAFFIC CODE.       \nSections:    \n20-1                       Model Traffic Code for Colorado - Adoption.    \n20-2                       Additions and modifications.    \n20-3                       Penalties.    \n20-4                       Application.    \n20-5                       Validity, Repeal and Interpretation.    \nARTICLE 2.  GENERAL PROVISIONS.               \n20-6                       Certain streets as part of State Highway.    \n20-7                       Commercial activity within right of way prohibited.    \n20-8                       Parking restrictions; traffic control devices.    \n20-9                       Parking prohibited during snow removal.    \n20-10                     Traffic regulations subject to approval by Department of Transportation.    \n20-11                     Penalty for violation.    \n20-11.1                  State of Colorado, State Highway Access Code, Volume 2, Code of Colorado Regulations 601-1, March\n2002, as amended    \nARTICLE 3.  AUTHORITY TO IMPOUND VEHICLES AND DISPOSE OF IMPOUNDED\nVEHICLES.     \n20-12                     Definitions.    \n20-13                     Impounding of vehicles; emergency circumstances.    \n20-14                     Impoundment of illegally parked vehicles.   \n20-15                     Abandonment of vehicles; procedures preceding impoundment.    \n20-16                     Leaving of wrecked, junked or partially dismantled vehicles on the street or other public property.    \n20-17                     Wrecked, junked or partially dismantled vehicles on private property.    \n20-18                     Disposal of vehicles removed and impounded pursuant to this Article.    \nARTICLE 4.  ADDITIONAL TRAFFIC REGULATIONS.      \n20-19                     Parking in freight loading zone.    \n20-20                     Limitations on parking.    \n20-21                     Repealed (Ord. 1854, eff. 6/27/08)    \n20-22                     Registered owner liable for parking violations.    \n20-23                     Persons prohibited from restricting parking on public streets.    \n20-24                     Parking not to obstruct traffic.    \nARTICLE 5. PARKING RESTRICTIONS FOR RECREATIONAL VEHICLES AND UTILITY\nTRAILERS.      \n20-25                     Definitions.    \n20-26                     Restricted areas and times.    \n20-27                     School zones.    \n20-28                     Penalty for violation.    \nARTICLE 6. COMMERCIAL TRUCK TRAFFIC          \n20-29                     Definitions    \n\n20-30                     Designation of routes, maps    \n20-31                     Operation of commercial trucks    \n20-32                     Use of engine compression brake prohibited    \n20-33                     Penalty for violation    \n   \nCHAPTER 20.  VEHICLES AND TRAFFIC.      \nARTICLE 1.  MUNICIPAL TRAFFIC CODE.     \nSection 20-1.        Model Traffic Code for Colorado - Adoption.     \n    Pursuant to parts 1 and 2 of article 16 of title 31 and part 4 of article 15 of title 30, C.R.S., there is hereby adopted by\nreference the 2020 edition of the \"Model Traffic Code” promulgated and published as such by the Colorado Department of\nTransportation, Traffic Engineering and Safety Branch, 2829 W Howard Place, Denver, CO 80204. The subject matter of\nthe Model Traffic Code relates primarily to comprehensive traffic control regulations for the City. The purpose of this\nOrdinance and the Code adopted herein is to provide a system of traffic regulations consistent with state law and generally\nconforming to similar regulations throughout the state and the nation. Three (3) copies of the Model Traffic Code adopted\nherein are now filed in the office of the Clerk of the City of Trinidad Colorado, and may be inspected during regular\nbusiness hours.  (Ord. 3016, repealed and reenacted, eff. 4/1/21)         \nSection 20-2.        Additions and modifications.  (Ord. 1822, eff., 12/15/06)    \n    The adopted Model Traffic Code is subject to the following modification:    \n    (1)   Section 1412(10)(b).    \n    No person shall ride a bicycle or skateboard upon any sidewalk located within the following street segments of the\ndowntown area:    \n    Commercial Street from Colorado Avenue (Five Points) to First Street;    \n    Main Street from Carbon Street and Santa Fe Trail to Walnut Street;    \n    Animas Street from Nevada Avenue and University Street to First Street.    \n    (2)   A violation of any provision of Chapter 20 of this code shall be deemed to be a traffic infraction if, at the time of the\ncommission of the violation, its counterpart violation under the provisions of Article 4 in Title 42 of the Colorado Revised\nStatutes, if any, is designated by state law as being a traffic infraction.  If no counterpart violation exists under state law,\nthe violation shall be deemed to be a traffic infraction.  All other violations under Chapter 20 of this code shall be\nconsidered misdemeanors punishable as described in paragraph (2) of Section 20-3.  Any person against whom judgment\nis entered for a traffic infraction under this code shall be subject to the penalty of a fine not exceeding one thousand dollars\nand shall not be subject to imprisonment on account of such judgment.  \n \n    (a)   Model Traffic Code Parts 1 and 2, and 5 to 15 and 19 are traffic infractions, except as otherwise provided in\nsubsections (b), (c), and (d) below.    \n      \n    (b)   Model Traffic Code Sections 107, 228(8), 233, 235, 507, 508, 509, 1005, 1401, 1402(1), 1413, and 1903(1)(a)\nare class 2 traffic misdemeanors.    \n       \n    (c)   In section 1101 of the Model Traffic Code a violation of driving one to twenty-four miles per hour in excess of\nthe reasonable and prudent speed or in excess of the maximum lawful speed limit of seventy-five miles per hour is a\ntraffic infraction; a violation of driving twenty-five or more miles per hour in excess of the reasonable and prudent\nspeed or in excess    \n    of the maximum lawful speed limit of seventy-five miles per hour is a class 2 misdemeanor traffic offense.    \n       \n    (d)   Violation of subsection (2) of section 1402 is a class 1 traffic misdemeanor.    \nSection 20-3.        Penalties.   (Ord. 3016, Sec. 20-3 repealed and reenacted, eff. 4/1/21)    \nThe following penalties, herewith set forth in full, shall apply to this ordinance:\n(1) It is unlawful for any person to violate any of the provisions adopted in this Ordinance.\n(2) Every person convicted of a violation of any provision adopted in this ordinance shall be punished by a fine not to\nexceed Two\nThousand Six Hundred and Fifty Dollars ($2,6500.00) or by imprisonment not exceeding ninety (90) days, or by both\nsuch fine and imprisonment.\n(3) (a) Any persons convicted of a violation of the Compulsory Insurance requirements of the State, MTC 1409(1), (2), or\n(3), shall be subject to a mandatory minimum fine of not less than five hundred dollars ($500.00). The court may suspend\nup to one half of the fine upon a showing that appropriate insurance as required pursuant to CRS 10-4-619 or 10-4-624 has\nbeen obtained.\n(b) Nothing in this paragraph (3) shall be construed to prevent the court from imposing a fine greater than the minimum\nmandatory fine.\n(c) Upon a second or subsequent conviction under MTC 1409(1), (2), or (3), within a period of five years following a prior\nconviction under said MTC 1409(1), (2), or (3), in addition to any imprisonment imposed pursuant to paragraph 2 of this\nsection, the defendant shall be punished by a maximum mandatory fine of one thousand dollars ($1,000.00). The court\nmay suspend up to one half of the fine upon a showing that appropriate insurance as required pursuant to CRS 10-4-619 or\n10-4-624 has been obtained.\n(d) In addition to the penalties prescribed in paragraphs 3(a), (b), and (c) of this section, any person convicted pursuant to\nthis section may, at the discretion of the court, be sentenced to perform not less than forty hours of community service.\n(e) Testimony of the failure of any owner or operator of a motor vehicle to present immediate evidence of a complying\npolicy or certificate of self-insurance in full force and effect as required by law, when requested to do so by a peace officer,\nshall constitute prima facie evidence, at a trial concerning a violation charged under this paragraph (3), that such owner or\noperator of a motor vehicle violated said MTC 1409(1), (2), or (3).\n(4) All penalties collected pursuant to this article shall be paid to the City Department of Finance and deposited into the\nGeneral Fund of the City of Trinidad in support of the Trinidad Police Department.\nSection 20-4.        Application.  (Ord. 3016, Sec. 20-4 repealed and reenacted, eff. 4/1/21)    \n    This ordinance shall apply to every street, alley, sidewalk area, driveway, park, and to every other public way or public\nplace or public parking area, either within or outside the corporate limits of this municipality, the use of which this\nmunicipality has jurisdiction and authority to regulate. The provisions of section 1401, 1402, 1413, and part 16 of the\nadopted Model Traffic Code, respectively concerning reckless driving, careless driving, eluding a police officer, and\naccidents and accident reports shall apply not only to public places and ways but also throughout this municipality.    \nSection 20-5.        Validity, Repeal and Interpretation.     (Ord. 3016, Sec. 20-5 repealed and reenacted 4/1/21)    \n(1) Validity. If any part or parts of this ordinance are for any reason held to be invalid such decision shall not affect the\nvalidity of the remaining portions of this ordinance. The City Council hereby declares that it would have passed this\nordinance and each part or parts thereof, irrespective of the fact that any one part or parts be declared invalid.\n(2) Repeal. Existing or parts of ordinances covering the same matters as embraced in this ordinance are hereby repealed\nand all ordinances or parts of ordinances inconsistent with the provisions of this ordinance are hereby repealed, except\nthat this repeal shall not affect or prevent the prosecution or punishment of any person for any act done or committed in\nviolation of any ordinance hereby repealed prior to the taking effect of this ordinance.\n(3) Interpretation. This ordinance shall be so interpreted and construed as to effectuate its general purpose to conform\nwith the State’s uniform system for the regulation of vehicles and traffic. Article and section headings of the ordinance and\nadopted Model Traffic Code shall not be deemed to govern, limit, modify or in any manner affect the scope, meaning or\nextent of the provisions of any article or section thereof.    \nARTICLE 2.  GENERAL PROVISIONS.  \n Section 20-6.        Certain streets as part of State Highway.     \n    The portions of the streets in the City which State Highway 12 lies are hereby dedicated to the people of the State as\nconnecting links in and as a part of Colorado State Highway No. 12 and the streets or highways shall have priority over\nlocal intersecting streets.  (Ord. 914, 7/3/67.)    \nSection 20-7.        Commercial activity within right of way prohibited.     \n    No commercial activity or encroachment shall be permitted within the right-of-way boundaries of the streets described\nin Section 20-6 and that the width from curb to curb of said streets shall be a minimum of fifty-six feet (56'). (Ord. 914,\n7/3/67.)    \nSection 20-8.        Parking restrictions; speed limitations.     \n   Parking on the streets described in Section 20-4 or portions thereof is prohibited at certain places as specified in Section\n42-4-1204 C.R.S., as amended; parking when and where permitted shall be parallel unless otherwise specifically provided\nby other Sections of this Code; traffic control devices on said streets shall conform to the uniform standards as adopted by\nthe State Department of Highways.    \nSection 20-9.        Parking prohibited during snow removal.  (Ord. 1515, eff., 8/26/95)   \n    (1) No person shall park or otherwise leave unattended a motor vehicle within any of the following street segments\nwithin the City, which shall be designated as emergency snow routes by official signs containing the snowflake symbol,\nbetween the hours of 2:00 A.M. and 6:00 A.M. until snow removal has been completed, whenever there exists an\naccumulation of three inches of snow or more, necessitating the use of the City's emergency snow removal equipment\nwithin such designated snow emergency routes:    \n    (a)    Pine Street between State Street and Commercial Street.    \n    (b)    Commercial Street between Pine Street and First Street    \n    (c)    Animas Street between Purgatoire Drive and Main Street.    \n    (d)    Maple Street between Elm Street and First Street.    \n    (e)    Chestnut Street between Elm Street and First Street.    \n    (f)     Santa Fe Trail between Main Street and First Street.    \n    (g)    Beech Street between Main Street and First Street.    \n    (h)    Convent Street between Cedar Street and First Street.    \n    (i)     Main Street between Interstate 25 and Ash Street.    \n    (j)     Elm Street between Commercial Street and Maple Street.    \n    (k)    Plum Street between Commercial Street and Maple Street.    \n    (1)    Church Street between Commercial Street and Animas Street.        \n   (m)   First Street between Maple Street and Chestnut Street.      \n   (2) Any vehicle parked or otherwise left unattended within an emergency snow route in violation of this Section which\ncauses an obstruction to snow removal equipment, shall be subject to immediate impoundment and removal.   \nSection 20-10.      Traffic regulations subject to approval by Department of Transportation.    \n   All traffic and parking regulations hereafter adopted which pertain to the streets and roadways which form a part of the\nState Highway System and constitute a connecting link thereof shall be submitted to the Colorado Department of\nTransportation for approval in accordance with the provisions of Section 43-2-135. C.R.S., before they shall become\neffective.   \nSection 20-11.      Penalty for violation.    \n   Any violation of this Article shall be punishable in the Municipal Court of the City by penalty as provided by the Model\nTraffic Code for Colorado Municipalities, 1977, as adopted herein.  Any police officer of the City is authorized and required\nto enforce the provisions of this Article and the said Court shall have jurisdiction to hear and try any person charged with\nits violation.  (Ord. 914, 7/3/67.)   \n  \nSection 20-11.1.   State of Colorado, State Highway Access Code, Volume 2, Code of Colorado Regulations\n601-1, March 2002, as amended.    \n  The State of Colorado, State Highway Access Code, Volume 2, Code of Colorado Regulations 601-1, March 2002, as\namended originally adopted June 18, 1998 by the Transportation Commission of Colorado pursuant to §43-2-147(4),\nC.R.S. in accordance with §24-4-103, C.R.S. effective August 31, 1998 and any amendments made to the same through\nMarch, 2002, promulgated and published by the Colorado Department of Transportation, 4201 East Arkansas Avenue,\nDenver, Colorado 80222, be and the same is hereby adopted by reference and incorporated as fully as if set out at length\nherein.  At least one copy of said Access Code as above set forth has been and is now filed in the office of the City Clerk.  \n  The subject matter of the Access Code relates primarily to comprehensive standards for the design and location of\ndriveways and other points of access to public highways, including streets under the jurisdiction of the City that are not\npart of the state highway system.  The purpose of the Access Code and the City’s adoption thereof is to provide the\nprocedures and standards necessary to protect the public health, safety and welfare, to maintain smooth traffic flow, to\nmaintain highway right-of-way drainage and to protect the functional level of public highways while meeting state,\nregional, local and private transportation needs and interests.  (Ord. 1746, eff., 2/17/04, Ord. 1890, eff., 11/14/09)  \nARTICLE 3.  AUTHORITY TO IMPOUND VEHICLES AND DISPOSE OF IMPOUNDED VEHICLES.\n(Ord. 3020, Sec 20-12 to 20-18 amended, eff. 5-14-21)\nSection 20-12.      Definitions.    \n   The following definitions shall apply in the interpretation and enforcement of this Article:   \n   (1)  Vehicle  shall mean a machine propelled by power other than human power designed to travel along the ground by\nuse of wheels, treads, runners or slide to transport persons or property or pull machinery and shall include, without\nlimitation, automobile, airplane, truck, trailer, motorcycle, motor scooter, tractor, buggy and wagon.   \n   (2)  Street or highway  shall mean the entire width between the boundary lines of every right-of-way publicly maintained\nwhere any part thereof is open to the use of the public for purposes of vehicular travel.   \n   (3)  Property  shall mean any real property within the City which is not a street or highway.   \n   (4)  Collector's item  shall mean a motor vehicle which is either at least twenty-five (25) years old, a make or model\nrecognized by the Executive Director of the State Department of Revenue as being antique, or a make or model of motor\nvehicle recognized by the Executive Director of the State Department of Revenue as having unique interest or historic\nvalue.   \n   (5)  Wrecked or junked vehicle and/or recreational vehicle shall mean any vehicle and or recreational vehicle which is\nextensively damaged, such damage including but not limited to any of the following: one or more flat tires, a broken\nwindow, windshield or both, missing wheels, tires, motor or transmission; is in a general state of disrepair, or cannot be\noperated mechanically or is not legally registered to operate upon the public right-of-way.  \n   (6) Recreational Vehicle shall mean any recreational vehicle, whether machine propelled by power other than human\npower designed to travel along the ground by use of wheels, treads, runners or slide, or meant to be pulled by a Vehicle as\nherein defined.\nRecreational Vehicles is further defined as any vehicular type portable structure without permanent foundation, which can\nbe towed, hauled, or driven, and designed to serve as temporary living accommodations for recreational, camping, or\ntravel use, and including, but not limited to travel trailers, camping trailers, converted buses, and self-propelled motor\nhomes. Excluded from this definition are passenger vehicles designed for everyday use, and stock vans customized as\nconversion vans. Recreational vehicle shall include campers, trailers, and boats. Recreational vehicles are required to be\nlocated at the property where it is registered and at a legally-inhabited/inhabitable residence pursuant to Section 14-\n49.2(C)(9).\nSection 20-13.      Impounding of vehicles; emergency circumstances.    \nIn the circumstances hereinafter enumerated, preservation of the public safety and welfare requires that vehicles and/or\nrecreational vehicles be removed from the public right-of-way without delay. Therefore, police officers are hereby\nauthorized to remove, or have removed, at their discretion, a vehicle and/or recreational vehicle from any street, alley,\nhighway, roadway, sidewalk, bridge, viaduct, public parking lot, or from any other public way or place, to the lot\nmaintained by the City or the Police Department for the storage of impounded vehicles, or to any other place of safety\nunder any of the circumstances hereinafter enumerated:\n(1) When any vehicle and/or recreational vehicle is left unattended upon any street or other public way or place,\nwhere such vehicle or recreational vehicle constitutes an obstruction to traffic;\n(2) When a vehicle and/or recreational vehicle upon a street or other public way is so disabled as to constitute an\nobstruction to traffic, or the person or persons in charge of the vehicle and/or recreational vehicle are by reason of\nphysical injury incapacitated to such an extent as to be unable to provide for its custody and removal;\n(3) When any vehicle and/or recreational vehicle is left unattended upon a street or any other public way or place,\nand is parked so illegally as to constitute a hazard or obstruction to the normal flow of traffic;\n(4) When the driver of such vehicle and/or recreational vehicle is taken into custody by the Police Department and\nsuch vehicle or recreational vehicle would thereby be left unattended upon a street or other public way or place;\n(5) When the driver of any vehicle and/or recreational vehicle or the vehicle and/or recreational vehicle which\nhe/she is driving is reasonably suspected of having been involved in any hit and run accident;\n(6) When removal is necessary in the interest of public safety because of fire, flood, storm or other emergency\nreason;\n(7) When any vehicle and/or recreational vehicle is reasonably suspected of being stolen, or parts thereof to be stolen\nparts; or\n(8) When the driver of any vehicle and/or recreational vehicle is taken into custody for a suspected felony or\nmisdemeanor, or when the vehicle and/or recreational vehicle is suspected of containing stolen goods or other\ncontraband\nSection 20-14.      Impoundment of illegally parked vehicles.    \nAny vehicle and/or recreational vehicle, not subject to immediate removal under Section 20-13, which is parked in\nviolation of any provision of the Code of Ordinance of the City of Trinidad, within a public street or highway or on any\nother public property within the City for a period of twenty four (24) hours or more shall be subject to removal and\nimpoundment either by or at the direction of a police officer, without prior notice.   \nSection 20-15.      Abandonment of vehicles; procedures preceding impoundment.    \n(1) Promotion and preservation of the public health and safety requires that vehicles and/or recreational vehicles left\nabandoned on public property or private property without permission of the owner, be removed. No person shall abandon\nany vehicle and/or recreational vehicle on any street, highway or other public property within the City, or on any private\nproperty other than his/her own without the consent of the owner thereof.\n(2) A vehicle and/or recreational vehicle meeting any of the following criteria is an abandoned vehicle:\n(a) Any vehicle and/or recreational vehicle left unattended on private property for a continuous period of twenty four (24)\nhours or more without the consent of the owner or lessee of such property or his/her legally authorized agent;\n(b) Any vehicle left unattended on public property, other than a street or highway, for a continuous period of seventy two\n(72) hours or more; and any recreational vehicles left on public property, including public streets, row, lot, highway, alley,\npublic property not zoned for parking, public property that is not improved, for a continuous period of more than forty-\neight (48) hours, or in any school zone when school is in session, in accordance with Section 20-26 and 20-27 of the\nMunicipal Code, respectively;\n(c) Any vehicle left unattended within a public street or highway for a continuous period of more than seven (7) days,\nunless such vehicle is parked entirely within the area abutting residential property occupied by the owner of such vehicle\nand has current registration and at least one current license plate.\n(3) Whenever an officer has reason to believe that a vehicle and/or recreational vehicle may be abandoned within a street\nor highway, he/she shall securely affix to the windshield, the driver's side door, or other conspicuous location, a warning\nnotice, indicating that the vehicle and/or recreational vehicle is believed to be abandoned in violation of this Section, and\nthe reason for such a belief. If the vehicle and/or recreational vehicle does not have current registration and at least one (1)\ncurrent license plate, the notice shall state that the vehicle and/or recreational vehicle must be removed from the public\nright-of-way unless current registration is obtained and current license plates are affixed to the vehicle and/or recreational\nvehicle, and the\nvehicle is moved to a location in the public street or highway immediately abutting the owner's residence within seven (7)\ndays and in the case of a recreational vehicle, removed to the owner’s private property abutting their residence and not in\nthe public street or highway. If the vehicle does have current license plates, the notice shall state that the vehicle must be\neither removed from the public right-of-way or to a location in the public street or highway immediately abutting the\nowner's residence, and in the case of a recreational vehicle, removed to the owner’s private property abutting their\nresidence and not in the public street or highway, within seven (7) days. The Notice shall further state that if the vehicle\nand/or recreational vehicle is not removed as set forth above, within the seven (7) day time period, a Municipal Court\ncitation may be issued, and the vehicle and/or recreational vehicle shall be subject to immediate impoundment by the City\nfollowing the expiration of the seven (7) day period, unless a hearing has been requested in writing during that period.\n(4) No vehicle and/or recreational vehicle alleged to be abandoned may be removed and impounded by the City until the\nfollowing additional steps have been taken:\n(a) Reasonable efforts shall be made to find the owner of the vehicle and/or recreational vehicle, including checking the\nrecords of the State Department of Motor Vehicles and County Clerk and Recorder, and inquiring of residents of abutting\nproperties.\n(b) If the owner is located, he/she shall be notified by first class mail, certified mail or personal service that his/her vehicle\nand/or recreational vehicle is believed to be abandoned in violation of this Section, and the reason for such a belief, and\nthat unless either the vehicle and/or recreational vehicle is removed or a hearing is requested within seven (7) days after\nthe mailing or service of the notice, the vehicle and/or recreational vehicle shall be subject to removal and impoundment\nwithout delay.\n(c) If the owner, after reasonable efforts to locate have been made, cannot be located, the vehicle and/or recreational\nvehicle may be removed and impounded by the City without delay, provided that seven (7) days have elapsed since the\nwarning notice was affixed to the vehicle and/or recreational vehicle.\n(5) Any hearing must be requested in writing to the City Manager within seven (7) days after a warning notice has been\naffixed to the vehicle and/or recreational vehicle, if the owner cannot be located, or within seven (7) days after mailing or\nservice of the second notice, if the owner is located. If a written request is made for a hearing, a vehicle and/or recreational\nvehicle may not be impounded until after the hearing has been held and a decision rendered.\n(6) If a hearing is requested pursuant to this Section, the City Manager or his/her designee shall conduct a hearing as soon\nas practicable, at which time testimony and evidence may be presented relative to the propriety of impounding such\nvehicle and/or recreational vehicle, and the City Manager or his/her designee shall issue a written decision following the\nhearing as to whether the vehicle and/or recreational vehicle is abandoned pursuant to this Article and therefore, subject\nto impoundment. If the City Manager or his/her designee determines that such vehicle and/or recreational vehicle is\nsubject to impoundment, the owner shall have twenty four (24) hours to remove the vehicle and/or recreational vehicle\nfrom the public right-of-way, or to a location within the public right-of-way immediately abutting the owner's residence\nand in the case of a recreational vehicle, removed to the owner’s private property abutting their residence and not in the\npublic street or highway, or to satisfy any other requirement set forth in the written decision. Should he/she fail to do so,\nthe vehicle and/or recreational vehicle shall be subject to immediate impoundment by the City.\n(7) Any vehicle and/or recreational vehicle left unattended on private property for twenty four (24) hours or more without\nthe consent of the owner or lessee of such property or the owner's legally authorized agent, shall be subject to removal and\nimpoundment, without prior notice or hearing, upon the request of such owner, lessee or agent.\n(8) Any vehicle and/or recreational vehicle left unattended on public property, other than a street or highway, for a period\nof seventy two (72) hours or more, shall be subject to removal and impoundment, without prior notice or hearing.\n(9) A Municipal Court Summons and Complaint for violation of this Section may be issued after either completion of the\nadministrative hearing and rendering of the hearing officer's decision, if a hearing has been requested, and the hearing\nofficer has determined the vehicle and/or recreational vehicle to be abandoned, or expiration of all periods during which a\nhearing may be requested, if no hearing has been requested.\nSection 20-16.      Leaving of wrecked, junked or partially dismantled vehicles on the street or other public\nproperty.    \n(1) Preservation of the public health and safety requires that junked, wrecked and partially dismantled vehicles and/or\nrecreational vehicle left on public property, including streets and highways, be removed or repaired. Therefore, wrecked,\njunked or partially dismantled vehicles and/or recreational vehicle left on public property are declared to be a nuisance.\nNo person shall leave any wrecked, junked or partially dismantled vehicle and/or recreational vehicle on any public\nproperty within the City.\n(2) Whenever a vehicle and/or recreational vehicle has been left wrecked, junked or partially dismantled within a public\nstreet or highway or any other public property continuously for more than forty-eight (48) hours, an officer shall securely\naffix to the windshield or driver's side door, or other obvious location on a recreational vehicle, a conspicuous warning\nnotice indicating that the vehicle and/or recreational vehicle is believed to be wrecked, junked or partially dismantled in\nviolation of this Section and the reason for such a belief. The notice shall also state that if the vehicle and/or recreational\nvehicle is not removed from the street, highway or other public property or necessary repairs are not made within seven (7)\ndays, a Municipal Court citation may be issued, and the vehicle and/or recreational vehicle shall be subject to immediate\nimpoundment by the City following the expiration of the seven (7) day period, unless a hearing has been requested in\nwriting during that period.\n(3) No vehicle and/or recreational vehicle alleged to be wrecked, junked or partially dismantled, may be removed and\nimpounded by the City until the following additional steps have been taken:\n(a) Reasonable efforts shall be made to find the owner of the vehicle and/or recreational vehicle, including checking the\nrecords of the State Department of Motor Vehicles and the County Clerk and Recorder, and inquiring of residents of\nabutting properties.\n(b) If the owner is located, he/she shall be notified by first class mail, certified mail or personal service that his/her vehicle\nand/or recreational vehicle is believed to be wrecked, junked or partially dismantled in violation of this Section, and the\nreason for such a belief, and that unless the vehicle and/or recreational vehicle is removed from the street, highway or\nother public right-of-way or adequately repaired, or a hearing is requested within seven (7) days after the mailing or\nservice of the notice, the vehicle and/or recreational vehicle shall be subject to removal and impoundment without delay.\n(c) If the owner, after reasonable efforts to locate have been made, cannot be located, the vehicle and/or recreational\nvehicle may be removed and impounded by the City without delay, provided that seven (7) days have elapsed since the\nwarning notice was affixed to the vehicle and/or recreational vehicle.\n(4) Any hearing must be requested in writing to the City Manager within seven (7) days after a warning notice has been\naffixed to the vehicle and/or recreational vehicle, if the owner cannot be located, or within seven (7) days after mailing or\nservice of the second notice, if the owner is located.\n(5) If a hearing is requested pursuant to this Section, the City Manager or his/her designee shall conduct a hearing as soon\nas practicable, at which time testimony and evidence may be presented relative to the propriety of impounding such\nvehicle and/or recreational vehicle, and the City Manager or his/her designee shall issue a written decision following the\nhearing as to whether the vehicle and/or recreational vehicle has been left wrecked, junked or partially dismantled on\npublic property and is therefore, subject to impoundment. The hearing officer shall have the authority to require the\nvehicle and/or recreational vehicle owner to demonstrate that the vehicle and/or recreational vehicle is mechanically\noperable. If the hearing officer determines that such vehicle and/or recreational vehicle is subject to impoundment, the\nowner shall have twenty-four (24) hours to remove the vehicle and/or recreational vehicle from public property or have it\nadequately repaired. Should he/she fail to do so, the vehicle and/or recreational vehicle shall be subject to immediate\nimpoundment by the City.\n(6) A Summons and Complaint for violation of this Section may be issued after either completion of the administrative\nhearing and rendering of the hearing officer's written decision, if a hearing has been requested, and the hearing officer has\ndetermined the vehicle and/or recreational vehicle to be wrecked, junked or partially dismantled, or expiration of all\nperiods during which a hearing may be requested, if no hearing has been requested.\nSection 20-17.      Wrecked, junked or partially dismantled vehicles on private property.    \n(1) Preservation of the public health and safety requires that vehicles and/or recreational vehicles left wrecked, junked or\npartially dismantled on private property, be removed. It is therefore unlawful for any person who is the owner of any\nvehicle and/or recreational vehicle, or the owner of any real property, or who is in charge or control of any such real\nproperty, whether as owner, tenant, occupant lessee or otherwise, to permit or allow any wrecked, junked or partially\ndismantled vehicle and/or recreational vehicle or parts thereof to remain on such real property longer than thirty (30)\ndays, as determined by recorded observation or signed complaint, and such vehicle and/or recreational vehicle is declared\nto be a nuisance, provided that this Section shall not apply with regard to a collector's item where the provisions of C.R.S.\n42-12-103 have been complied with; a vehicle and/or recreational vehicle or parts of a vehicle and/or recreational vehicle\nin an enclosed building; a vehicle and/or recreational vehicle on the premises of a business enterprise operated in a lawful\nplace and manner, when necessary to the operation of such business enterprise; or a vehicle and/or recreational vehicle in\nan appropriate storage place or depository maintained for impounded vehicles by the City.\n(2) If any wrecked, junked or partially dismantled vehicle and/or recreational vehicle or parts thereof has remained on any\nprivately owned premises for more than thirty (30) days, as determined by recorded observation or signed complaint, the\npolice department shall require the removal of such vehicle and/or recreational vehicle within ten (10) days, by written\nnotice personally served on the owner of the vehicle and/or recreational vehicle, or on the owner or agent of the owner of\nthe premises whereon is situated such vehicle and/or recreational vehicle, or sent by certified mail to either the owner of\nthe vehicle and/or recreational vehicle, at his/her last known address, or owner or agent of the premises whereon is\nsituated such vehicle and/or recreational vehicle. The vehicle and/or recreational vehicle or parts thereof must be removed\nfrom public view or adequately repaired within ten (10) days of the mailing of or personal service of the notice, unless a\nwritten request for a hearing is made to the City Manager during that time period. A vehicle and/or recreational vehicle or\nparts thereof moved onto the public right-of-way or onto other public or private property after service or mailing of the\nnotice, shall be subject to removal without further notice. Change in ownership of the vehicle and/or recreational vehicle\nor the real property where it is located, after service or mailing of the notice shall not necessitate the giving of any\nadditional notice prior to removal and impoundment of the vehicle and/or recreational vehicle by the City or at its\ndirection.\n(3) The notice referred to in this Section shall state that the vehicle and/or recreational vehicle must be removed from\npublic view or repaired within ten (10) days of the mailing or service of the notice, unless a hearing is requested in writing\nwithin the ten (10) day period. The notice shall indicate that failure to remove or repair the vehicle and/or recreational\nvehicle will result in it being impounded, and any expenses incurred by the City being assessed against the owner or\nhis/her property.\n(4) For the purposes of this Section, the tenant, occupant, or lessee of any premises shall be deemed the agent of the owner\nof such premises.\n(5) Any hearing must be requested in writing to the City Manager within ten (10) days after the date of mailing or service\nof the warning notice. If a written request is made for a hearing, a vehicle and/or recreational vehicle may not be\nimpounded by the City until a hearing has been held and a decision rendered.\n(6) Upon the failure, neglect or refusal or any owner or agent of the owner so notified, to properly dispose of such vehicle\nand/or recreational vehicle or parts thereof within the time limits herein set forth, unless a hearing has been requested,\nthe Police Department is authorized and empowered to remove the same at the expense of such owner or agent of the\nowner, which expenses shall include the cost of removal plus administrative costs of the City, not to exceed five percent\n(5%) of the cost of removal.\n(7) In case the owner or agent of such property shall fail to pay such bill within thirty (30) days after the same has been\nrendered, the Police Department shall report the same to the City Manager or his/her designee who shall assess the costs\nagainst the property in question. Such assessment shall constitute a perpetual, first and prior lien on the property\ninvolved. The City Manager or his/her designee shall certify to the County Treasurer the assessments which are not paid\nwithin twenty (20) days of the date of assessment. Ten percent (10%) of the amount shall be added to the assessment to\npay the cost of collection.\n(8) If a hearing is requested pursuant to this Section, the City Manager or his/her designee shall conduct a hearing as soon\nas practicable, at which time testimony and evidence may be presented relative to the propriety of impounding such\nvehicle and/or recreational vehicle, and the City Manager or his/her designee shall issue a decision following the hearing\nas to whether the owner or other person in charge of or in control of any private property, or the owner of any vehicle\nand/or recreational vehicle has permitted or allowed such wrecked, junked or partially dismantled vehicle and/or\nrecreational vehicle or parts thereof to remain on private property longer that thirty (30) days pursuant to this Section,\nand whether such vehicle and/or recreational vehicle or parts thereof, is subject to impoundment. The fact that such\nproperty has changed owner, lessee or occupant, or that such vehicle and/or recreational vehicle has been moved to\nanother location within the City within public view, other than a licensed junkyard or garage, shall not be a bar to\nimpoundment. If the City Manager and his/her designee determines that such vehicle and/or recreational vehicle is\nsubject to impoundment, the agent of the owner of the property, or the vehicle and/or recreational vehicle owner shall\nhave twenty-four (24) hours after receipt of the written decision, to remove the vehicle and/or recreational vehicle from\npublic view or adequately repair the vehicle and/or recreational vehicle. Should he/she fail to remove or repair such\nvehicle and/or recreational vehicle, the Police Department is empowered to remove such vehicle and/or recreational\nvehicle at the expense of the owner, plus administrative expenses of the City.\n(9) A Municipal Court Summons and Complaint for violation of this Section may be issued after either completion of the\nadministrative hearing and rendering of the hearing officer's decision, if a hearing has been requested, and the hearing\nofficer has determined that the owner of other person in charge or in control of any private property, or the owner of any\nvehicle and/or recreational vehicle has permitted or allowed such wrecked, junked or partially dismantled vehicle and/or\nrecreational vehicle or parts thereof to remain on such private property longer than thirty (30) days, or expiration of the\nperiod during which a hearing may be requested, if no hearing has been requested. Such summons and Complaint may be\nissued to either the owner or agent of the owner of the premises on which the vehicle and/or recreational vehicle or parts\nthereof, is located, or to the vehicle and/or recreational vehicle owner, or all of them.\nSection 20-18.      Disposal of vehicles removed and impounded pursuant to this Article.    \n(1) If removal and impoundment of a vehicle and/or recreational vehicle is not effected by the Police Department, the\npolice officer shall cause removal and impoundment to be effected only by a private towing company which has been\nlicensed by the State Public Utilities Commission and carries adequate liability insurance to cover the cost of any damage\ninflicted on the vehicle and/or recreational vehicle during towing or storage. No vehicle and/or recreational vehicle may be\ntowed which has not first had its contents properly inventoried by a police officer or other official of the City.\n(2) Whenever a vehicle and/or recreational vehicle is impounded and ordered held pursuant to this Article, the Police\nDepartment shall notify the owner of record, if\nascertained, of the impoundment of such vehicle and/or recreational vehicle, and of the owner's and/or lienholder's\nopportunity to request a hearing to determine the validity of the impoundment.\n(3) Such notice shall be sent by United States mail to the owner of record, if ascertained, and any lienholder, if ascertained,\nwithin ten (10) working days of the receipt of the report from the Department of Motor Vehicles, and shall include the\nfollowing information:\n(a) The address and telephone number of the motor vehicle and/or recreational vehicle owner, if ascertained;\n(b) The location of storage of the motor vehicle and/or recreational vehicle;\n(c) The location from which the motor vehicle and/or recreational vehicle was towed;\n(d) The reason for which the vehicle and/or recreational vehicle was impounded;\n(e) A description of the motor vehicle and/or recreational vehicle, which shall include, if available, the make, model,\nlicense plate number, mileage and vehicle identification number.\n(f) That in order to obtain a hearing concerning the validity of the impoundment, the owner and/or lienholder must\nrequest such hearing in writing to the City Manager within ten (10) days after the date appearing on the notice, when\napplicable.\n(g) That unless the vehicle and/or recreational vehicle is claimed within thirty (30) calendar days from the date the\nnotice was sent as determined from the postmark on the notice, the vehicle and/or recreational vehicle shall be\nsubject to sale.\n(4) Any such hearing shall be conducted within a reasonable time after receipt of the owner's or lienholder's request, not to\nexceed ten (10) days after receipt of such request, unless the hearing is postponed to a later date at the owner's or\nlienholder's request. The granting of such request for postponement shall be at the discretion of the hearing officer. The\nfailure of the owner or lienholder to request a hearing or to attend a scheduled hearing shall satisfy the hearing\nrequirements of this Section.\n(5) The sole issue at the hearing shall be the legality of the impoundment of the motor vehicle and/or recreational vehicle.\nThe burden of proof shall be on the Trinidad Police Department to establish probable cause that one or more of the\ngrounds set forth in this Article exist for the impoundment.\n(6) If the hearing officer determines that the impoundment was invalid, the City of Trinidad shall be responsible for the\ncosts incurred in the towing and storage of the motor vehicle and/or recreational vehicle. If the hearing officer determines\nthat the impoundment was valid, and the vehicle and/or recreational vehicle is not reclaimed by the owner or lienholder\npursuant to State statute within thirty (30) days of the hearing officer’s decision, then unless such vehicle and/or\nrecreational vehicle is being held for evidence in a criminal case the owner could not legally reclaim such vehicle and/or\nrecreational vehicle during the thirty (30) day period, the vehicle and/or recreational vehicle shall be presumed to be\nabandoned and the provisions for sale and disposal of same set forth in C.R.S. 42-4-1806 shall apply.\n(7) Any motor vehicle and/or recreational vehicle owner who has been previously afforded an opportunity to request a pre-\nimpoundment hearing shall not be entitled to a post-impoundment hearing.\nARTICLE 4.  ADDITIONAL TRAFFIC REGULATIONS    \nSection 20-19.      Parking in freight loading zone.    \n   (1)  No person shall park a vehicle for any purpose or length of time other than for the expeditious unloading and delivery\nof pickup and loading of materials in any place officially marked as a freight loading zone during hours when the\nprovisions applicable to such zones are in effect. (Ord. 1532, eff., 5-18-96)   \n   (2) In no case shall the parking for loading and unloading of materials exceed thirty (30) minutes. (Ord. 1532, eff., 5-18-\n96)   \nSection 20-20.      Limitations on parking.    \n   No person shall park a vehicle at a location for a period of time greater than that permitted by   \n   official signs or during those hours in which parking is prohibited by official signs. (Ord. 1532, 20-20, 5-18-96)   \nSection 20-21.      Repealed.    (Ord. 1854, 6-27-08)   \nSection 20-22.      Registered owner liable for parking violations.    \n   The registered owner of any motor vehicle is liable for payment of a parking violation fine.  It is no defense to the\nprosecution of a parking violation, that at the time of the parking violation, the vehicle was in the care, custody or control\nof another person. (Ord. 1532, 20-22, 5-18-96)   \nSection 20-23.      Persons prohibited from restricting parking on public streets.     \n   (1)  No person shall place, maintain, or display upon or in view of any street or highway any unauthorized sign, signal,\nmarking or device which attempts to regulate, limit, restrict or prohibit the parking of any motor vehicle on or within any\npublic street or highway, nor shall any person, without lawful authority, in any other way attempt to regulate, limit,\nrestrict, or prohibit the parking of any motor vehicle on or within any public street or highway.(Ord. 1562, 5-31-97)   \n   (2)  Every such prohibited sign, signal or marking is declared to be a public nuisance, and the City is empowered to\nremove the same or cause it to be removed without notice. (Ord. 1562, 5-31-97)   \n   (3)  Any person who violates any provision of this Section shall be guilty of a Misdemeanor, and shall be subject to the\npenalties set forth in Section 1-8 of this Code. (Ord. 1562, 5-31-97)   \nSection 20-24       Parking not to obstruct traffic.    \n   No person shall park any vehicle upon a public street, alley, or highway in a manner or under such conditions as to leave\navailable less than twelve (12) feet of the width of the roadway for free movement of vehicular traffic. (Ord. 1725, eff., 6-13-\n03)   \nARTICLE 5. PARKING RESTRICTIONS FOR RECREATIONAL VEHICLES AND UTILITY TRAILERS    \nSection 20-25       Definitions.    \n   (1) “Commercial Vehicle” shall mean any vehicle having more than two axles, or any single commercial vehicle or\ncombination of said vehicles which exceed twenty feet (20’) in length, any single commercial vehicle or combination of\nsaid vehicles eighty-four inches (84”) or more in width, or any single commercial vehicle or combination of said vehicles\nhaving a manufacturer’s gross vehicle weight rating of ten thousand pounds (10,000#) or more.  A Commercial Vehicle\nincludes, but is not limited to, commercial delivery trucks, commercial vehicle hauling trailers, flatbed trucks, dump\ntrucks, stake-side trucks, semitrucks, semi tractors, semitrailers, tow trucks, contractor equipment and trucks and trailers,\ntrash or refuse trucks, transit mix concrete trucks, tank trucks, tank trailers, privately-owned school buses, and other such\nvehicles. (Ord. 3046, amended, eff., 8/26/22)\n   (2) “Recreational Vehicle” shall mean any vehicular type portable structure without permanent foundation, which can be\ntowed, hauled, or driven, and designed to serve as temporary living accommodations for recreational, camping, or travel\nuse, and including, but not limited to travel trailers, camping trailers, converted buses, and self-propelled motor homes.\n Excluded from this definition are passenger vehicles designed for everyday use, and stock vans customized as conversion\nvans. (Ord. 1725, eff., 6-13-03)   \n   (3) “Utility Trailer” shall mean a vehicle without motorized power, designed to be towed by a passenger automobile or\ntruck, but not designed for human occupancy, and which may included but not limited to a utility trailer, boat trailer,\nhorse trailer, snowmobile trailer, animal trailer, produce trailer, goods or commodity trailer. (Ord. 1725, eff., 6-13-03)   \nSection 20-26       Restricted areas and times.    \n   It shall be unlawful for any person to park or stand or to allow any recreational vehicle or utility trailer to park or stand\nupon any public street, highway, alley, or public right-of-way between any street and alley located within or adjacent to a\nlow density residential zone district, a medium density residential zone district, the historic preservation zone district, or a\nneighbor-hood service zone district, for a period of more than forty-eight (48) hours.\n   It shall be unlawful for any person to park or stand or to allow any commercial vehicle on any public or private property\nin any residential zone district except during the loading and unloading of such vehicle or while currently being used for\non-site construction work.  In addition, it shall be unlawful to store, park, or maintain any farm or construction equipment\nin any residential zone district.   (Ord. 3046, Sec. 20-26 amended, eff., 8/26/22)\nSection 20-27       School zones.    \n   It shall be unlawful to park a recreational vehicle, commercial vehicle, or utility trailer on a public street in a school zone\nwhen school is in session.  This restriction shall not apply to the parking of such vehicles for such time as it actually\nnecessary to loan or unload passengers. (Ord. 1725, eff., 6-13-03)   \nSection 20-28       Penalty for violation.    \n   Every person convicted of a violation of this Article shall be punished by a fine of not more than Three Hundred Dollars\n($300.00). (Ord. 1725, eff., 6-13-03)   \nARTICLE 6.  COMMERCIAL TRUCK TRAFFIC     \nSection 20-29.  Definitions.   \n  The following definitions shall apply in the interpretation and enforcement of this Article:  \n  (1)  Commercial Truck  means any motor vehicle having more than two axels, or any single commercial vehicle or\ncombination of said vehicles which exceed 20 feet in length, any single commercial vehicle or combination of said vehicles\n84 inches or more in width, or any single commercial vehicle or combination of said vehicles having a manufacturer’s\ngross vehicle weight rating or gross combination rating of 10,000 pounds or more designed or used primarily for the\ntransportation of property, including vehicles used for delivery purposes.  This definition excludes privately-owned\nrecreational vehicles, as defined in Section 20-25(2), and publicly owned mass transportation motor vehicles.  \n  (2)  Immediate area of operation  means a segment of a restricted route between successive  \n  intersecting streets, including any restricted route which provides the only practical access to that\n  segment of the restricted route.  \n   \n  (3)  Through truck travel  means operation of a truck without an origin or destination in the immediate area of operation.\n Origin or destination shall not include the residence of the owner, lessee or   operator of the truck.  \n  (4)  Truck route    means any street, highway, public way or portion thereof designated specifically for  the operation of\ncommercial trucks.  \nSection 20-30.  Designation of routes, maps.   \n       (1)   In accord with a City Council approved truck route plan, City Council shall have the authority to designate all or\nportions of those streets, highways, public ways and roadways upon which trucks       shall operate. The City Council shall\nhave the additional authority to restrict the operation of trucks upon streets, highways, public ways or portions thereof.\nSuch designation and restrictions shall be       made upon the recommendation of the Public Works Director and shall be\nbased on traffic engineering investigations and studies, public safety, environmental considerations, economic factors\naffecting trucking and the trucking industry, desires of the inhabitants and neighborhood characteristics of affected areas.  \n      \n   (2) Public Works shall maintain in the Public Works Office maps designating truck routes. Copies of the maps shall be\nmade available to trucking interests and the public through the Public Works       Office and/or the Police Department. Any\nchange to truck routes shall be published by the Public Works.               \n   (3) Public Works shall post with appropriate signs those routes that are restricted. Public Works may also post\ndesignated truck routes with appropriate signs. Truck route maps shall be made available to  all persons upon request. The\nposting of signs shall not be required for enforcement.  \n \nSection 20-31.   Operation of commercial trucks.   \n   (1)  Through truck travel shall be unlawful upon prohibited routes. It shall be unlawful for any person to operate or cause\nto be operated a commercial truck upon a prohibited route without an origin or destination in the immediate area of\noperation.   \n   (2)   Upon the designation of truck routes, it shall be unlawful for any person to operate or cause to be operated a\ncommercial truck upon any other street, highway or other public way. Commercial trucks may deviate from truck routes\nwhile traveling to or from a truck terminal, garage, place of repair, place of performing a service or place of loading or\nunloading, and may proceed from a destination not located upon a truck route to another destination without returning to\na truck route if to so return would unreasonably increase the distance to be traveled between destinations.   \n   (3)   Any person operating a commercial truck upon all or any portion of a street, highway, public way or roadway that is\nnot a truck route, or upon a prohibited route, shall have in the person's possession a log book, delivery slip or other\nevidence of the point of origin and destination to justify the presence of the vehicle upon the route. Failure to produce\nevidence upon request of a police officer shall be unlawful.   \n   (4)   The following   City streets within the limits of the City of Trinidad are hereby designated as truck routes:   \n    SH 12    \n    Commercial Street (Colorado Avenue to Elm Street)    \n    Linden Avenue (Goddard Avenue to Main Street)    \n    160 Bypass    \n    Goddard Avenue (I-25 to Nevada Avenue)    \n    Elm Street (Commercial Street to Maple Street)    \n    Plum Street (Elm Street to Commercial Street) \nSection 20-32.  Use of engine compression brake prohibited.    \n   Use of engine compression brakes within the corporate city limits of Trinidad shall be prohibited.           \nSection 20-33.  Penalty for violation.    \n   Every person convicted of a violation of this Article shall be punished by a fine of not more than Three Hundred Dollars\n($300.00).\n"}