{"Chapter 8 - [Title from PDF Content]": "Chapter 8 - Fire Prevention\nARTICLE 1. INTERNATIONAL FIRE CODE.\nSections:\n8-1                   International Fire Code.\nARTICLE 2.  GENERAL PROVISIONS.\n8-4                   Fire Department – Creation and membership.\n8-5                   Firefighters – Uniforms.\n8-6                   Inspection of buildings and other premises; order to abate.\n8-7                   Destruction of buildings to check fire.\n8-8                   Spectators at fire to obey orders.\nARTICLE 3. FIREWORKS.\n8-9                   Fireworks – Casting, throwing or firing.\n8-10                 Fireworks – Exhibition and possession.\n8-11                 Fireworks – Defined.\n8-11.1              Seizure of fireworks.\n8-12                 Exemptions from prohibitions.\n8-13                 Penalty for violation.\nCHAPTER 8.  FIRE PREVENTION .\nARTICLE 1. INTERNATIONAL FIRE CODE.\n(Ord. 2061, Article 1, repealed and reenacted, eff. 7-13-18)\nSection 8-1. International Fire Code.\n(1) The International Fire Code, 2018 Edition, including Appendix Chapters B, C and D, as published by the International\nCode Council, 500 New Jersey Avenue, NW, 6th Floor, Washington, DC 20001 (headquarters), is hereby adopted by\nreference as the Fire Code of the City of Trinidad, Colorado, as if fully set forth in this ordinance, together with the\nadditions, insertions, deletions, and changes prescribed in this Section. At least one (1) copy of said International Fire\nCode, 2018 Edition, shall remain on file in the Office of the City Clerk and open to public inspection.\n(2) The following sections of the International Fire Code, 2018 Edition (“IFC”), are hereby revised:\n(a) Amend IFC § 101.1, Title, as follows: insert: “the City of Trinidad, Colorado” where indicated.\n(b) Amend IFC § 105.2, Application, to read:  Application for a permit for new construction or remodeling of existing\nstructures is required by this code and shall be made to the fire code official or the Chief Building Official in such\nform and detail as prescribed by the fire code official and/or the Chief Building Official.  Applications for permits\nshall be accompanied by such plans as prescribed by the fire code official and the Chief Building Official as set forth\nin Chapter 5, Section 5-7 regarding the International Building Codes as adopted by the City of Trinidad, Colorado.\n(c) Amend IFC §110.4, Violation penalties, to read: Persons who shall violate a provision of this code or shall fail to\ncomply with any of the requirements thereof, or who shall erect, install, alter, repair, or do work in violation of the\napproved construction documents or directive of the fire code official, or of a permit or certificate used under\nprovisions of this code, shall be subject to penalties as prescribed in Chapter 1, Sections 1-8 and 1-9 of the Code of the\nCity of Trinidad, Colorado\n(d) Amend IFC §112.4, Failure to comply, to read: Any person who shall continue any work after having been served\nwith a stop work order, except such work as that person is directed to perform to remove a violation or unsafe\ncondition, shall be liable for a fine of not less than Three Hundred Dollars ($300.00) nor more than Two Thousand\nSix Hundred Fifty ($2,650.00).\n\n(e) Amend IFC §5704.2.9.6.1, Locations where above-ground tanks are prohibited, to read: The storage of Class I and\nII liquids in above-ground tanks outside of buildings is prohibited within all zoning classifications, except areas\nencompassed by the Industrial Zone district and only by special use permit.\n(f) Amend IFC §5706.2.4.4, Locations where above-grounds tanks are prohibited, to read: The storage of Class I and\nII liquids in above-ground tanks is prohibited within all zoning classifications, except areas encompassed by the\nIndustrial Zone district and only by special use permit.\n(g) Amend IFC §5806.2, Limitations, to read: The storage of flammable cryogenic fluids in stationary containers\noutside of buildings is prohibited within all zoning classifications, except areas encompassed by the Industrial Zone\ndistrict and only by special use permit.\n(h) Amend IFC §6104.2, Maximum capacity within established limits, to read:\nWithin the limits established by law restricting the storage of liquefied petroleum gas for the protection of heavily\npopulated areas, the aggregate capacity of any one installation shall not exceed a water capacity of 2,000 gallons\n(7570 L). Such storage is prohibited within all zoning classifications, except areas encompassed by the Industrial\nZone district and only by special use permit.\nARTICLE 2. GENERAL PROVISIONS.\nSection 8-4.  Fire Department – Creation and membership.\n(1)   There is created a Fire Department which shall consist of a Chief and as many firefighters necessary to properly\nhandle and manipulate the apparatus of the Department, to provide adequate fire protection for the citizens of the City of\nTrinidad.  Such protection shall be extended to the Trinidad Industrial Park and may be otherwise extended beyond the\ncorporate limits of the City by contractual relationship with fire district corporations or other legal entities.\n(2)   The City Manager shall by rules and regulations define the duties, functions and powers of the Fire Department.\nSection 8-5.  Firefighters – Uniforms.\nAll members of the Fire Department are required to dress in such uniform as is or may be prescribed by Department Rules\nand Regulations.  Uniforms shall be kept in a neat and clean condition and shall be worn at all times during hours of duty.\nSection 8-6.  Inspection of buildings and other premises; order to abate.\n(1)   It shall be the duty of the Fire Department to inspect as often as may be necessary, all buildings, premises and public\nthoroughfares, except the interiors of private dwellings, for the purpose of ascertaining and causing to be corrected any\nconditions liable to cause fire, or any violations of the provisions or intent of any ordinance of the City pertaining to fire\nhazards.\n(2)   Whenever any Fire Department personnel shall find in any building or upon any premises or other place, combustible\nor explosive matter or dangerous accumulation of rubbish or unnecessary accumulation of water paper, boxes, shavings, or\nany other highly inflammable materials, and which is so situated as to endanger life or property, or shall find obstructions\nto or on fire escapes, stairs, passageways, doors or windows, liable to interfere with the operations of the Fire Department,\nor egress of occupants, in case of fire, he/she shall order the same to be removed or remedied.  Such order shall be issued\nin conformance with the procedures set forth in Section 16-64 of this Code.\nSection 8-7.  Destruction of buildings to check fire.\nIn the process of combating a structure fire, the Chief of the Fire Department, or in his/her absence, his/her\nrepresentative, may order any buildings that are in close proximity thereto to be removed or otherwise disposed of, for the\npurpose of checking such structure fire.\nSection 8-8.  Spectators at fire to obey orders.\nEvery person in the immediate vicinity of a fire, shall be subject to any obedient to any lawful order of the Chief or any\nfirefighter in extinguishing the fire and removing the protecting property, and any person who shall neglect or refuse such\norders shall be guilty of a misdemeanor.\nARTICLE 3. FIREWORKS.\n(Ord. 1792, Article 3, repealed and reenacted, eff. 7/1/05)\nSection 8-9.   Fireworks - Casting, throwing or firing.\nIt shall be unlawful for any person to cast, throw or fire any fireworks of any kind within the corporate limits of the City.\n (Ord. 1792, eff. 7/1/05; Ord. 1267, Sec. 1, 5/21/85)\nSection 8-10.  Fireworks - Exhibition and possession.\nIt shall be unlawful for any person to exhibit or have in his/her possession with intent to use, give away or sell or offer for\nsale, any fireworks of any kind. (Ord. 1792, eff. 7/1/05; Ord. 1267, Sec. 1, 5/21/85)\nSection 8-11.   Fireworks - Defined. (Ord. 1898, Sec. 8-11 repealed and reenacted, eff. 5/28/10)\n(1) “Fireworks” as used in Sections 8-9, 8-10, and 8-11.1 shall mean any article, device, or substance of a combustible or\nexplosive composition, or any substance or device prepared for the purpose of producing a visible or audible effect by\ncombustion, explosion, deflagration, or detonation.  Fireworks include, but are not limited to, blank cartridges, toy pistols,\ntoy canes, or toy guns in which explosives are used where the explosive content of the device or cap exceeds sixteen\nmilligrams of pyrotechnic composition per item; firecrackers; torpedoes; sky rockets; Roman candles; cone and cylindrical\nfountains; spinning wheels; ground or aerial spinners; illuminating torches and colored fire in any form that utilizes a\npyrotechnic composition; explosive auto alarms; chasers; toy propellant devices and toy smoke devices; cigarette loads;\ntrick matches; trick noisemakers; any device containing an explosive or flammable compound; any tablet or device\ncontaining an explosive or flammable compound; any tablet or device containing an explosive substance, and any other\ndevice of like construction.\n(2) “Fireworks” shall not include:\n(a) Toy caps which do not contain more than sixteen milligrams of pyrotechnic composition per item , or toy pistols,\ntoy canes, toy guns, or other devices for use with such caps.\n(b) Party poppers containing not more than sixteen milligrams of pyrotechnic composition per item that is friction\nsensitive; and snappers containing not more than one milligram of explosive composition per item.\n(c) Highway flares, railway fuses, ship distress signals, smoke candles, or any other emergency signal devices only\nwhen used for emergency purposes.\n(d) Dipped sticks and sparklers, the total pyrotechnic composition of which does not exceed one hundred grams, of\nwhich the composition of any chlorate or perchlorate shall not exceed five grams.  However, it shall be unlawful for\nany person under sixteen years of age to possess or use dipped sticks or sparklers unless such person is under adult\nsupervision.  It shall further be unlawful for any person under sixteen years of age to purchase dipped sticks or\nsparklers, or for any person to knowingly sell dipped sticks or sparklers to any person under sixteen years of age.\n(e) Snake and glow worm pressed pellets of not more than two grams of pyrotechnic composition and packaged in\nretail packages of not more than twenty-five units.  However, it shall be unlawful for any person under sixteen years\nof age to possess or use such snake or glow worm pressed pellets unless such person is under adult supervision.  It\nshall further be unlawful for any person under sixteen years of age to purchase snake or glow worm pressed pellets,\nor for any person to knowingly sell snake or glow worm pressed pellets to any person under sixteen years of age.\nSection 8-11.1 Seizure of fireworks.\nPersonnel of the City’s Police and Fire Departments are authorized to seize, destroy or otherwise dispose of all fireworks\nused or possessed in violation of Sections 8-9 and 8-10 of this Code.   (Ord. 1792, eff. 7/1/05; Ord. 1963, eff. 6/28/02, Ord.\n1726, 6/13/03)\nSection 8-12.  Exemption from prohibitions.\nThe provisions of Sections 8-9, 8-10, and 8-11.1 shall not apply to any public or private demonstration or display of\nfireworks of any kind so long as a permit shall first be obtained from the Fire Chief.  The Fire Chief shall determine that\nsuch demonstration or display will be conducted in a manner that is not deemed to be hazardous to life or property.  In\norder to ensure compliance with said permit, the demonstration shall be conducted under Fire Department supervision.  \n(Ord. 1792, eff. 7/1/05; Ord. 1267, Sec. 4, 5/21/85)\nSection 8-13.   Penalty for violation.\nAny person who violates Sections 8-9 or 8-10 shall, upon conviction, be sentenced as provided in Section 1-8 and subject\nto the terms of Section 8-12.  (Ord. 1792, eff. 7/1/05; Ord. 1267, Sec. 5, 5/21/85)\n", "Chapter 9 - [Title from PDF Content]": "Chapter 9 - Licenses\nARTICLE 1.  IN GENERAL\nSections:\n9-1                   Short title.\n9-2                   Purpose and scope.\n9-3                   Business defined.\n9-4                   License required.\n9-5                   Exempt activities.\n9-6                   Applications.\n9-7                   Issuance.\n9-8                   Term of license.\n9-9                   Renewals.\n9-10                 Transfers.\n9-11                 Suspension or revocation.\n9-12                 Non-issuance of license.\n9-13                 Joint license.\n9-14                 License required by each place of business.\n9-15                 Posting and exhibition.\n9-16                 Penalty for violation.\n9-17                 Each day's violation deemed separate offense.\n9-18                 Invalidity.\nARTICLE 2.   BUSINESSES SUBJECT TO ADDITIONAL LICENSING REQUIREMENTS.\nDIVISION 1.  AMUSEMENT PARKS.\n9-19                 Amusement park license - Fee, term, other pursuits included.\n9-20                 Carnivals at amusement park - License required; fee.\n9-21                 Circus - License required; fee; effect on other sections.\nDIVISION 2.  AUCTION SALES.\n9-22                 Auction sales - License required; exemption.\n9-23                 License fee.\n9-24                 Sales at auction of new jewelry prohibited.\n9-25                 Penalty for violation.\nDIVISION 3.  CARNIVALS, CIRCUSES, AND PARADES.\n9-26                 Carnivals outside of amusement parks prohibited.\n9-27                 Circuses, shows, parades, exhibitions - License fees; exceptions.\n9-28                 Deposit required for possible damage to City property.\n9-29                 Licenses - Contents.\nDIVISION 4.  FARM PRODUCE AT WHOLESALE.\n9-30                 Definitions.\n9-31                 Sale of farm produce; license required; fee, exception of common carriers and certain farmers.\n9-32                 Registration of farmers and producers; certificate.\n9-33                 License transfer; use of license of another.\n9-34                 Bond requirements.\n9-35                 Exclusions from provisions.\nDIVISION 5.  JUNK DEALERS.\n9-36                 Junk shop - License required.\n9-37                 License Fee - Junk shop; junk wagon.\n9-38                 Bond requirements.\n9-39                 Junk shop - License issuance.\n\n9-40                 Separate license for each vehicle required.\n9-41                 Change of business location; notice to City Clerk.\n9-42                 Vehicle license plate; driver's badge.\n9-43                 Register of articles dealt in.\n9-44                 Waiting period before sale.\n9-45                 Purchasing from minor prohibited.\n9-46                 Hours of purchase.\n9-47                 Receiving articles in pawn; advancing money.\n9-48                 Licensing as pawnbroker or secondhand dealer prohibited.\n9-49                 Police supervision of junk dealers.\n9-50                 Exhibiting articles to police.\nDIVISION 6.  PAWNBROKERS.\n9-51                 Pawnbroker defined.\n9-52                 Pawnbroker - License required; fee.\nDIVISION 7.  PEDDLERS AND SOLICITORS.\n9-53                 Merchandise peddlers and solicitors - License requirements; fees.\n9-54                 Exclusion from provisions.\nDIVISION 8.  SECONDHAND GOODS.\n9-55                 Definitions.\n9-56                 Dealer in secondhand goods - License required; fee.\n9-57                 Record to be kept; inspection.\n9-58                 Receiving goods from minors.\nDIVISION 9.  CONTRACTORS.\n9-59                 Contractor defined.\n9-60                 Contractor's license required.\n9-61                 Liability and property damage insurance and worker's compensation insurance required.\n9-61.1              Contractor’s examination.\nDIVISION 10.  STREET STANDS.\n9-62                 Street stands - License required.\n9-63                 License or permit requirements.\nDIVISION 11.  EMERGENCY, POLICE AND FIRE ALARM SYSTEMS.\n9-64                 License to engage in business of selling; fee.\n9-65                 Installation and maintenance costs.\n9-66                 False alarms; charges for; suspension or terminations of permits.\nDIVISION 12.  SEXUALLY ORIENTED BUSINESSES.\n9-67                 Definitions.\n9-68                 Sexually oriented business license required.\n9-69                 Fees.\n9-70                 Application for sexually oriented business license.\n9-71                 Duty to supplement application.\n9-72                 Investigation and application.\n9-73                 Issuance of sexually oriented business license.\n9-74                 Expiration of sexually oriented business license.\n9-75                 Suspension of sexually oriented business license.\n9-76                 Revocation of sexually oriented business license.\n9-77                 Suspension or revocation hearing.\n9-78                 Transfer of sexually oriented business license.\n9-79                 Manager’s license required; change of manager; inactive status.\n9-80                 Application for manager’s license.\n9-81                 Expiration of manager’s license.\n9-82                 Suspension of manager’s license.\n9-83                 Revocation of manager’s license.\n9-84                 Suspension or revocation hearing.\n9-85                 Notice.\n9-86                 Judicial review.\n9-87                 Inspection.\nCHAPTER 9. LICENSES .\nARTICLE 1.   IN GENERAL.\nSection 9-1.    Short title.\nThis Ordinance shall be known as and may be cited as the \"General Business Licensing Ordinance of the City of Trinidad.\"\nSection 9-2.    Purpose and scope.\nThe purpose of this Chapter is to provide a uniform procedure for the issuance, suspension and revocation of business\nlicenses issued by the City.  The provisions of this Chapter shall apply to all businesses except those exclusively involved in\nthe sale and dispensing of alcoholic beverages, and any other businesses whose licensing provisions are contained in\nanother Chapter in this Code.\nSection 9-3.    Business defined.\nBusiness includes all kinds of vocations, occupations, professions, enterprises, establishments, and all other kinds of\nactivities and matters, together with all devices, machines, vehicles and appurtenances used therein, any of which are\nconducted for private profit or benefit, either directly or indirectly, on any premises in this City or anywhere else within its\njurisdiction.\nSection 9-4.    License required.\nIt shall be unlawful for any person, firm or corporation to carry on or engage in any business within the corporate limits of\nthe City of Trinidad, subject to any law of the State of Colorado now in force, or hereafter to be enacted, without first\nhaving obtained a license therefor from the City Clerk.\n(Ord. 1954, eff. 3/14/14)\nSection 9-5.    Exempt activities.\n(1)  Nothing in this Chapter shall be construed to prohibit, or to require a license for, solicitations or sales by members of\nbona fide religious, charitable, school or civic organizations eligible for exemption under Section 501(c)(3) of the Internal\nRevenue Code.\n(2)  No license shall be required for a casual sale, that being defined as an individual, single or incidental transaction which\nin itself does not constitute the carrying on of business.\n(3)  Nor shall a license be required of any person for any mere delivery in the City where no intent by such person is shown\nto exist to evade the provisions of this Chapter.\n(4) No license shall be required of any person for the holding a garage sale exceeding not more than four days in length, at\na given location, in a calendar year.  No garage sale may be conducted prior to 8:00 a.m. or after 8:00 p.m. of any day.  \nTemporary signs are prohibited within the corporate limits of the City of Trinidad, including garage sale signs.  Anyone\nplacing signs on public property or in the public right-of-way will be in violation of the City sign code, Section 14-89, et.\nseq., and subject to a fine of up to $300.00 or imprisonment up to 90 days, or both. (Ord. 1977, Sec. 9-5(4), repealed and\nreenacted, eff. 6-26-15)\n(5)  No license shall be required of a person operating a street stand as a part of a City sanctioned event lasting no more\nthan five (5) days.  However, such person shall be required to obtain a permit from the City Clerk pursuant to Section 9-\n63(2) of the Code of Ordinances.  (Ord. 1353, Sec. 1, 5/23/89.)\nSection 9-6.    Applications.\n(1)  The application for every license required by and issued under authority of the City shall contain:\n(a)  The name of the person, firm or corporation desiring such license;\n(b)  The residence address and home telephone number of each applicant, or of each of the individual members of\nsuch firm, or of each     of the directing officers of such corporation, and the address and telephone number of its\nprinciple place of business;\n(c)  The kind of business desired, stating the business, trade or profession;\n(d)  Street address where business is to be carried on as well as its telephone number;\n(e)  The time period for which such license is sought; and\n(f)   Any other relevant information required by the terms of this Chapter relating to the particular license sought or\ndeemed to be necessary by the City Clerk for the particular license sought.\n(2)  All applications shall be accompanied by payment of an application fee of Ten Dollars ($10.00).\nSection 9-7.    Issuance. (Ord. 1951, Sec. 9-7 repealed and reenacted eff. 1/17/14)\nAll licenses shall be issued by the City Clerk upon receipt of the following, unless otherwise specified in this Code:\n(1) A proper application containing all applicable information as required on the form provided by the City of Trinidad.\n(2) Payment of the annual business license fee of $50.00 to the City Clerk.\n(a)       The annual business license fee shall be pro-rated as follows:\nIf a license is applied for:\n(i)        January 1 to March 31                                    $50.00\n(ii)       April 1 to June 30                                           $37.50\n(iii)      July 1 to September 30                                   $25.00\n(iv)      October 1 to December 31                             $12.50\n(3) The execution and delivery of any bond or insurance that may be required.\n(4) An inspection report by the building inspection and fire department, certifying that the business premises are fit for\noccupancy.\n(5) The fulfillment of all other specific requirements relating to the issuance of the particular license.\nSection 9-8.    Term of license. (Ord. 1951, Sec. 9-8 repealed and reenacted eff. 1/17/14)\nAll licenses, except those issued for seasonal business or activities, shall be valid only from the date of issuance through the\nlast day of February of each year.\nSection 9-9.    Renewals.\nAny licensee may make application for a new license for the succeeding one year period and pay the required fee therefor\non or before the expiration date of any license or licenses issued to him/her for the current one (1) year period.  Whenever\nany application and license fee therefor is not received on or before the expiration date of any license issued for the current\none year period, and the licensee continues to engage in the business or activity for which the license was issued, a penalty\nof ten percent (10%) of the amount of the license fee is imposed and collected and an additional penalty of five percent\n(5%) of the original fee is imposed as of the last day of each calendar month after the expiration date.  In addition to the\nabove penalty provision, it is unlawful for a licensee to engage in any business or activity after his/her license therefor has\nexpired, and subjects the violations to the penalty provisions as set forth in this Chapter.\nSection 9-10.  Transfers.\nNo license may be transferred from one person to another, or from one place to another, except when permitted by State\nlaw or the provisions of this Code relating to the particular license, and then only by the City Clerk after written application\ntherefor and the payment of a fee of Five Dollars ($5.00) for the transfer of such license.\nSection 9-11.  Suspension or revocation.\n(1)  The City Clerk, may upon seven (7) days written notice to a licensee stating the contemplated action and in general the\ngrounds therefor, suspend a license for a period not to exceed fifteen days.  The licensee shall have seven days from the\ndate of the notice to file a written protest with the Clerk.  If a protest is filed, the matter shall be set for hearing before the\nCity Council, and the suspension shall be stayed pending the hearing.  Following the hearing, the City Council shall either\noverrule the suspension, uphold the suspension, impose a suspension for a greater or lesser length of time, or revoke the\nlicense.\n(2)  If a protest is not filed, the Clerk shall report the violation and suspension to the City Council, which at its option may\nset the matter for hearing to consider an extension of the suspension period, or a revocation of the license.  Nothing in this\nSection shall be construed to prevent the City Council, on it own motion, from scheduling a suspension or revocation\nhearing.\n(3)  A license may be suspended by the City Clerk, or suspended or revoked by the City Council, upon finding that:\n(a)  The licensee has failed to maintain or keep in place any bond on insurance during the course of licensing period,\nwhere such bond or insurance is required pursuant to the terms of the issuance of the license and the provisions of\nthis Chapter;\n(b)  The licensee has violated any of the terms of the provisions pertaining to his/her license, or any regulation or\norder lawfully made relating thereto; or\n(c)  Any fact or condition which now exists or did exist at the time of the application for such license, which had it\nbeen known at the time, would have warranted the refusal of the issuance of such license.\nSection 9-12.  Non-issuance of license.\nUpon the refusal of any license application, the license fee paid therefor in advance, shall be returned to the applicant; the\napplication fee is nonrefundable.\nSection 9-13.  Joint license.\nA person engaged in two or more businesses at the same location shall not be required to obtain separate licenses for each\nof such businesses but, when eligible, shall be issued one license which shall specify on its face all such businesses.\n However, should one or more of such businesses require a license for which additional and/or more stringent\nrequirements are set forth than those set forth in this Article 1, such licensee shall be required to meet such additional\nand/or more stringent requirements, in order to obtain a license to operate such business or businesses.\nSection 9-14.  License required by each place of business.\nA separate license must be obtained for each branch, establishment or separate place of business without payment of any\nadditional fee.\nSection 9-15.  Posting and exhibition.\nEvery license for a business to be conducted at a particular street address shall be posted therein in a location that is\nvisibly noticeable to public view during the period such license is valid.  It shall be the duty of each and every person to\nwhom a license has been issued by the City, to exhibit the same upon the request of any law enforcement officer, inspector,\nor other office of the City.  (Ord. 1343, 12/6/88.)\nSection 9-16.  Penalty for violation.\nAny person who violates any of the provisions of this Chapter shall, upon conviction, be punished by a fine of not more\nthan Three Hundred Dollars ($300.00), or be sentenced to jail for not more than ninety (90) days, or both such fine and\nimprisonment.\nSection 9-17.  Each day's violation deemed separate offense.\nThe carrying on of any business, profession, vocation, or occupation as provided in this Chapter, without first having\nprocured a license from the City to do so, shall be deemed a separate violation of this Chapter for each and every day that\nsuch business, profession, vocation, or occupation is  carried on without a license.\nSection 9-18.  Invalidity.\nIf any Section of this Ordinance or the application of any section thereof to any particular class of business or persons or\ncircumstances, such invalidity shall not affect the remaining portions of this Ordinance, and said Ordinance and the\nvarious portions thereof are declared to be severable.\nARTICLE 2.  BUSINESSES SUBJECT TO ADDITIONAL LICENSING REQUIREMENTS.\nDIVISION 1.  AMUSEMENT PARKS.\nSection 9-19.  Amusement park license - Fee, term, other pursuits included.\nA license may be granted to the manager of any amusement park upon payment in advance of One Hundred Dollars\n($100.00).  The license shall be granted by the Council and issued by the City Clerk, to cover a period of one (1) year from\nthe time such license is granted.  Such licensee shall not be required to take out a separate license, as provided by existing\nordinances, for the privilege of carrying on the soft drink or restaurant businesses, or conducting public dances, or for\nshowing or permitting to be shown within such park, carnivals, circuses, road shows or any other tented amusement show\nor amusements such as ferris wheels and merry-go-rounds.  (Ord. 1958, Sec. 14-14.)\nState law reference: As to authority of City to license places of amusement, see C.R.S. 1973, Sec 31-15-501.\nSection 9-20.  Carnivals at amusement park - License required; fee.\n(1)  It shall be unlawful for any person without an amusement park license to operate a carnival within the confines of an\namusement park duly licensed under this Chapter, unless he/she shall first obtain a license, which may be granted by the\nCouncil and issued by the City Clerk upon payment in advance by the applicant of the following fees:\n(a)  For the first night of such operations---------- $20.00\n(b)  For the second night of such operations------ $17.50\n(c)  For the third night of such operations--------- $15.00\n(d)  For each night thereafter------------------------$12.50\n(2)  Nothing herein contained shall be construed to repeal Section 9-27 hereof, which Section shall remain in effect except\nas herein modified.  (Ord. 1958, Sec. 14-15.)\nSection 9-21.  Circus - License required; fee; effect on other sections.\n(1)  It shall be unlawful for any person without an amusement park license to operate a circus (except as to parades) within\nthe confines of an amusement park duly licensed under this Chapter, unless he/she shall first obtain a license, which may\nbe granted by the Council and issued by the City\nClerk upon payment in advance by the applicant of the sum of Fifty Dollars ($50.00) for each day of operation.\n(2)  The provisions of this Section shall exist concurrently with the provisions of Sections 9-26 and 9-28 and such later\nsections shall remain in effect as to circuses or other amusement shows not operating within an amusement park.\n(3)  Nothing in this Section shall be construed as rendering the provisions of Section 9-34 requiring a bond for all circus\nparades inapplicable to circuses showing in an amusement park under this Section.  (Ord. 1958, Sec.  14-16.)\nDIVISION 2.  AUCTION SALES.\nSection 9-22.  Auction sales - License required; exemption.\nIt shall be unlawful for any person without first having obtained a license, to sell, dispose of, or offer for sale at auction or\nto cause or to permit to be sold, disposed of, or offered for sale at auction any goods, wares or merchandise whether the\nsame be the property of such person or whether he/she shall sell the same as agent or employee of others; provided,\nhowever, this Section shall not apply to the following:\n(1)  Sales at auction by sheriffs, constables, tax collectors, coroners, marshals, executors, administrators, trustees,\nguardians, assignees of insolvent debtors or bankrupts, or any person required by law to sell real or personal property at\nauction;\n(2)  Sales at auction of the stock on hand of any person who shall for the period of one (1) year, next preceding such sale,\nhave been continuously in business in the City, as a retail or wholesale merchant, handling the particular articles being\nsold at such auction, and that such sale at auction of the stock on hand of such merchant shall be held on successive days,\nSundays and legal holidays excepted, and shall not continue for more than thirty (30) days in all, within the period of any\none (1) year and shall consist solely of bona fide stock which has been on hand for at least ninety (90) days before said sale\nand in no instance shall the sale be allowed of merchandise specially imported for such sale;\n(3)  Sales of livestock at auction by regularly licensed livestock sales rings;\n(4)  Sales at auction of used household goods and effects and second hand goods and chattels belonging to bona fide\nresidents of the City, or of the trade territory thereof;\n(5)  Sales at auction of the trade fixtures and equipment of any retail or wholesale establishment in the City.  (Ord. 860,\nSec. 1, 9/3/63.)\nState Law reference: As to State licensing provisions for auction sales, see C.R.S. 1973, Sec. 12-51-101; as to authority of\nCity to regulate, see C.R.S. 1973, Sec. 31-15-501.\nSection 9-23.  License fee.\nNo license for auction sales shall be granted until the applicant shall have paid the sum of Two Hundred Dollars ($200.00)\nfor the year, in advance.  (Ord. 860, Sec. 3, 9/3/63.)\nSection 9-24.  Sales at auction of new jewelry prohibited.\nIt shall be unlawful for any person to sell at auction, even though he/she possesses a license as required herein any new\nwatches, or articles known as jewelry, and any diamonds which have not been sold at retail on a previous occasion.  (Ord.\n860, Sec. 5, 9/3/63.)\nSection 9-25.  Penalty for violation.\nAny person who shall violate this Division shall, upon conviction, be fined not less than Five Dollars ($5.00) or more than\nThree Hundred Dollars ($300.00) for each offense. (Ord. 860, Sec. 4, 9-3-63.)\nDIVISION 3.  CARNIVALS, CIRCUSES, AND PARADES.\nSection 9-26.  Carnivals outside of amusement parks prohibited.\nIt shall be unlawful for any person to conduct any carnival, street show, advertising show or other like show or exhibition,\n(circuses, dog and pony or animal shows excepted), within the City except as provided in Section 9-19.  (Ord. 1958, Sec.\n 14-31.)\nSection 9-27.  Circuses, shows, parades, exhibitions - License fees; exceptions.\nA license fee shall be paid to the City by any person, whether or not operating under the auspices of any organization,\nfraternal or otherwise, for the exhibiting or conducting of any circus, menagerie, acrobatic or gymnastic show, dog and\npony show, vaudeville show under canvas, any natural or artificial curiosities, sleight of hand performances, or any other\ntented show or exhibition for gain, and for the conducting of a parade in connection therewith in the amounts as follows:\n(1)     For each parade, in advance One Hundred Dollars ($100.00); there shall be no license fee charged for the first (1st)\nexhibition of such show, but there shall be paid in advance for each additional exhibition Fifty Dollars ($50.00); provided,\nhowever, that if such shows do not conduct a parade, One Hundred Dollars ($100.00) for the first (1st) performance, and\nFifty Dollars ($50.00) for each additional performance thereafter.  In case any exhibition should be continuous in its\nnature, for the purpose of fixing the amount of the license fee, each three (3) hours of operation shall be regarded as a\nseparate exhibition.\n(2)     Nothing contained in this Section shall be construed to apply to any carnival, street show, advertising show or other\nlike show or exhibition, prohibited by Section 9-26.\n(3)     A license shall not be required for the exhibiting of motion pictures or the holding of lectures or entertainments\nunder the auspices of any religious organization, or for the holding of Chautauquas or other educational programs or home\ntalent productions.\nCross reference: As to license fees when such amusements are conducted within amusement parks, see Sec. 9-21. State\nLaw reference: As to State license for circuses, see C.R.S. 1973, Sec 12-51-107.\nSection 9-28.  Deposit required for possible damage to city property.\nAny person conducting a parade, as provided in Section 9-27, shall, before the start of such parade, deposit with the City\nClerk the sum of Five Hundred Dollars ($500.00) as a fund from which the City may be reimbursed for any damage which\nmay be done by such parade to the streets, pavement, curbs, bridges, culverts, light poles, or any other City property.\n Immediately after the conclusion of such parade, the City Engineer and the Superintendent of the Street and Bridge\nDivision of the Department of Public Works, shall examine the line of march covered by such parade and shall note any\ndamage done by such parade to City property.  In case damage is found to have been done, then such committee shall\nforthwith determine the sum necessary to replace the damaged property, and such sum shall be deducted from the deposit.\nThe balance of the deposit shall be returned to the depositor.  (Ord. 1958, Sec. 14-33.)\nSection 9-29.  Licenses - Contents.\nAll licenses issued under Section 9-27, shall specify the object, the number of exhibitions, or length of time for which such\nlicenses are respectively granted.  (Ord. 1958, Sec. 14-35.)\nDIVISION 4.  FARM PRODUCE AT WHOLESALE.\nSection 9-30.  Definitions.\nAs used herein:\n(1) Common Carrier shall mean a common carrier by steam railroad or any common carrier which has a certificate of\npublic convenience and necessity from the Colorado State Public Utilities Commission to operate as a common carrier.\n(2) Regular employee of any farmer or producer shall mean a person then employed by such farmer or producer and\nwhose principal occupation is field work upon the farm or ranch of such farmer or producer.  (Ord. 1958, Sec.  14-140.)\n(3) Wholesale , shall mean the sale or delivery to a hotel, restaurant, retailer, commission house, or to any other person for\nresale, either directly or indirectly, including resale as a part of or an ingredient of a manufactured article.  (Ord. 1958, Sec.\n14-140.)\nSection 9-31.  Sale of farm produce; license required; fee, exception of common carriers          and certain\nfarmers.\nExcept as otherwise provided, no person shall engage in the selling or delivering of any fruits, vegetables or farm products,\nfrom any building, store, room, freight car, wagon, truck or other vehicle, vacant lot, stand or any other structure or space,\nat wholesale without first having obtained a license therefor from the City Council and having paid to the City for such\nlicense the sum of One Hundred Dollars ($100.00) in advance, for each calendar year or fraction thereof; provided,\nhowever, that this Section shall not apply to common carriers making deliveries as such common carriers, nor to any\nfarmer or producer, registered as provided in Section 9-32 including a regular employee of such farmer or producer, when\nselling or delivering only such fruits, vegetables or farm products actually grown or produced by such farmer or producer\nin the State.  (Ord. 1958, Sec. 14-141.)\nSection 9-32.  Registration of farmers and producers; certificate.\nAny farmer or producer desiring to sell or deliver any fruits, vegetables or farm products, actually grown or produced by\nhim/her in the State, shall obtain a certificate of registration therefor from the City Clerk.  The sale or delivery by such\ncertificate holder of any fruits, vegetables or farm products not actually produced or grown by him/her, without obtaining\na license as provided in Section 9-31 hereof, shall constitute a violation of this Code.  (Ord. 1958, Sec. 14-142.)\nSection 9-33.  License transfer; use of license of another.\nLicenses issued under Section 9-31 shall run from January 1 of each calendar year, shall be for the full calendar year, shall\nnot be transferable, and the fees therefor shall not be prorated for any portion of a calendar year.  No refunds shall be\nmade in case of revocation or surrender.  The conducting of any business by any person under any license or certificate of\nregistration issued to another under the provision of this Division shall constitute a violation thereof.  (Ord. 1958, Sec. 14-\n143.)\nSection 9-34.  Bond requirements.\nBefore any license shall be issued under Section 9-31 the applicant shall file with the City Clerk a good and sufficient bond\nin the penal sum of One Thousand Dollars ($1,000.00) in favor of the City, such bond to be approved by the City Council\nand conditioned that the licensee shall fully comply with all ordinances relating to the conduct of the business thereby\nauthorized and shall pay all judgments rendered against such licensee for any violation of any such ordinance or for any\ndamage arising out of any misrepresentation or deceit practiced by such licensee in the conduct of business.  The bond\nherein provided for may be sued upon in the name of the City by and for the use of any person injured by the breach of any\ncondition thereof.  (Ord. 1958, Sec. 14-144.)\nSection 9-35.  Exclusions from provisions.\nNothing in this Division shall be construed to supersede or repeal any ordinances now or hereafter in effect relating to\npeddlers or hucksters selling direct to consumers, or to restaurants and hotels, or to the inspection of foods, wares and\nmerchandise sold or offered for sale.  (Ord. 1958, Sec. 14-145.)\nDIVISION 5.  JUNK DEALERS.\nSection 9-36.  Junk shop - License required.\nIt shall be unlawful for any person without first having obtained a license from the City Council to engage in the business\nof keeping a junk shop or yard, to purchase, sell, barter, exchange or otherwise deal in, or storage of, rags, or old rope,\npaper or bagging, old iron, brass, copper, tin, slush, or lead, empty bottles or other junk; or carry on any such business at\nany place other than that\ndesignated in his/her license; or draw or drive, or cause to be drawn or driven through the streets any hand cart, wheel\nbarrow, or other cart or vehicle, for the purpose of collecting or disposing of such articles; or use a car or cart, or other\nvehicle for the aforesaid purpose.  (Ord. 1958, Sec. 14-124.)\nSection 9-37.  License fee - Junk shop; junk wagon.\nThe license fee for keepers of junk shops or junk yards shall be One Hundred Dollars ($100.00) per annum, payable in\nadvance; and for each junk wagon, truck, or other conveyance used in connection with a junk shop or yard, Ten Dollars\n($10.00) per annum, payable in advance; and the license fee for the operator of each junk wagon, truck or other\nconveyance when used in connection with a junk shop or yard regularly established and licensed in the City, shall be One\nHundred Dollars ($100.00) per wagon, truck, or other conveyance, and no such license shall be issued for a period less\nthan one (1) year.  (Ord. 1958, Sec.  14-121.)\nSection 9-38.  Bond requirements.\nBefore any person shall be licensed under the provisions of this Division as a keeper of a junk shop or yard, he/she shall\nexecute a bond to the City with good and sufficient securities, to be approved by the City Council, in the sum of Five\nHundred Dollars ($500.00) conditioned for the due observance of all ordinances of the City respecting keepers of junk\nshops or yards, and before any person shall receive a license for a junk wagon or truck he/she shall execute a like bond in\nthe sum of One Hundred Dollars ($100.00).  (Ord. 1958, Sec. 14-122.)\nSection 9-39.  Junk shop - License issuance.\nThe City Council may grant licenses to persons who shall produce satisfactory evidence of good character to keep what are\ncommonly called junk shops, junk yards or junk wagons or trucks for the purchase and sale of old rope, old iron, brass,\ncopper, tin or lead, rags, slush, empty bottles, paper, bagging and other junk.  (Ord. 1958, Sec.  14-120.)\nSection 9-40.        Separate license for each vehicle required.\nA separate license shall be obtained by every keeper of a junk shop or yard for each truck, wagon or other vehicle used in\nhis/her business.  (Ord. 1958, Sec. 14-123.)\nSection 9-41.    Change of business location; notice to City Clerk.\nIn case any person licensed as provided in this Division shall move his/her place of business from that designated in the\nlicense, he/she shall immediately give notice to the City Clerk and have the change noted upon the license.  (Ord. 1958,\nSec. 14-134.)\nSection 9-42.    Vehicle license plate; driver's badge.\nEvery person licensed under the provisions of this Division shall, before using any cart, wagon or other vehicle, or cause\nthe same to be used for the collection or disposal of any of the articles of junk mentioned in this Division, obtain from the\nCity Clerk for each wagon, cart or other vehicle, two (2) painted metal plates eight inches (8\") long and four inches (4\")\nwide, on which shall be stamped or painted a number corresponding to the license number and also the words \"Trinidad\nJunk\", which plates shall be securely fastened on the outer sides of such cart, wagon or other vehicle used in his/her\nbusiness.  Such persons shall also at the same time obtain from the Clerk a metal badge one and three fourths inches (1\n3/4\") long and one and one eighth inches (1 1/8\") wide for the driver of each licensed wagon, having a number thereon\ncorresponding to the number on the aforesaid plate.  Such badge shall be provided with a pin or other fastening, and shall\nbe worn in a conspicuous place on the outside of the coat.  (Ord. 1958, Sec. 14-125.)\nSection 9-43.    Register of articles dealt in.\nEvery person licensed as the keeper of a junk shop or yard, or junk wagon or truck shall keep at his/her place of business a\nrecord book, in which he/she shall enter a minute description of all the personal property purchased by him/her, the date\nof the purchase, the name and residence, or place of business of the person from whom such purchase was made, and\nparticular mention of any prominent or descriptive marks that may be on such property, and all the entries made therein\nshall be made in ink.  Every licensee shall, during the ordinary hours of business and when requested by any police officer\nor inspector of the City, submit and exhibit such book for inspection, and shall also exhibit such goods or personal\nproperty to any of the aforesaid officers.  Any person failing or refusing to comply with any requirement of this Section\nshall be guilty of a misdemeanor.  (Ord. 1958, Sec. 14-126.)\nSection 9-44.    Waiting period before sale.\nIt shall be unlawful for any dealer in junk or keeper of a junk shop, wagon or truck to expose for sale, or sell or dispose of\nany article within ten (10) days after it shall have been purchased, or until the article shall have been in or upon the\npremises wherein it is offered, exposed or sold, at least ten (10) days.  (Ord. 1958, Sec.  14-127.)\nSection 9-45.    Purchasing from minor prohibited.\n(1)  It shall be unlawful for any dealer in junk or keeper of a junk shop, wagon or truck to purchase any goods, articles or\nthings whatsoever, except old rags, and waste paper, from any minor under the age of eighteen (18) years.\n(2)  Any person who violates the provisions of this Section shall be guilty of a misdemeanor.  (Ord. 1958, Sec.  12-128.)\nSection 9-46.    Hours of purchase.\nIt shall be unlawful for any dealer in junk or keeper of a junk shop, wagon or truck to purchase for sale and goods, article\nor thing whatsoever from any person between the hours of 6:00 P.M. and 6:00 A.M.  (Ord. 1958, Sec. 14-129.)\nSection 9-47.    Receiving articles in pawn; advancing money.\nIt shall be unlawful for any dealer in junk or keeper of a junk shop, junk yard, junk wagon or truck to receive any article or\nthing by way of pledge or pawn or loan or advance any sum of money on the security of any article or thing. (Ord. 1958,\nSec. 14-131.)\nSection 9-48.    Licensing as pawnbroker or secondhand dealer prohibited.\nNo keeper of a junk shop, yard, wagon or truck shall receive or hold a license to carry on the business of a pawnbroker, or\nof a dealer in secondhand articles.  (Ord. 1958, Sec. 14-132.)\nCross reference: As to provisions pertaining to licenses for pawnbrokers, see Sec. 9-52; as to licenses for secondhand\ndealers, see Sec. 9-56.\nSection 9-49.    Police supervision of junk dealers.\nThe Chief of Police, or any officer designated by him/her, shall have general supervision over all dealers in junk and\nkeepers of junk shops, and the power to inspect their respective places of business, and vehicles, and all articles or things\nkept therein, whenever he/she shall deem it necessary so to do.  (Ord. 1958, Sec. 14-133.)\nSection 9-50.    Exhibiting articles to police.\nEvery dealer in junk or keeper of a junk shop, wagon or truck, who shall receive, or be in possession of any goods, articles\nor things which may have been lost or stolen, or alleged, to have been lost or stolen, shall forthwith, on demand, exhibit\nthe same to any member of the Police Department.  (Ord. 1958, Sec. 14-130.)\nDIVISION 6.  PAWNBROKERS.\nSection 9-51.    Pawnbroker defined.\nPawnbroker shall mean a person who advances or loans money or other valuable things on the deposit of personal\nsecurity, or who deals in the purchasing of personal property on condition of selling it back at a stipulated price.  (Ord.\n1958, Sec. 14-55.)\nSection 9-52.    Pawnbroker - License required; fee.\n(1)  It shall be unlawful for any person to carry on the business of a pawnbroker without first having obtained a license\ntherefor.\n(2)  Licenses may be issued for the purpose of carrying on the business of pawnbroker to any applicant therefor upon the\npayment of Twenty-Five Dollars ($25.00) for each six (6) months, or Fifty Dollars ($50.00) for one (1) year.  (Ord. 1958,\nSec. 14-55 and 14-56.)\nCross reference: As to provisions relating to licensing of junk dealers as pawnbrokers, see Sec. 9-48\nState law reference : As to authority of City to license and regulate pawnbrokers, see C.R.S. 1973, Sec. 13-15-501.\nDIVISION 7.  PEDDLERS AND SOLICITORS.\nSection 9-53.    Merchandise peddlers and solicitors - License requirements; fees.\n(1)  Licensing Requirements.  Hawkers, hucksters, peddlers, vendors, solicitors or transient salesmen who go about from\nplace to place selling and delivering merchandise of any character, except produce and vegetables at retail, and any person\nwho shall come into the City, except traveling salesmen or drummers taking orders for merchandise to be delivered to\nretail dealers only, in going about from house to house or place to place, offering the performance of temporary services or\nsoliciting the sales of goods, wares or merchandise of any character at retail, whether the same be in its raw or\nmanufactured state, and whether deliveries are made by them or not, for the purpose of profit to themselves through the\nuse of the streets, sidewalks and other municipal agencies of the City, or peddlers, itinerant vendors and persons other\nthan itinerant vendors who shall temporarily bring into the City stocks of goods, wares or merchandise and offer the same\nfor sale at public auction or private sale, shall, before commencing business in the City, secure an annual license from the\nCity Clerk, and shall pay the application fee and license fee as set forth in this Section.\n(2)  Application fee and license fee.  The application fee for a new license issued pursuant to this Section shall be Ten\nDollars ($10.00).  The annual license fee shall be Twenty-Five Dollars ($25.00).\n(3)  Bonding Requirement.  Before any license, as provided by this Section is issued to an applicant, such applicant shall\nfile with the City Clerk a bond running to the City in the sum of One Thousand Dollars ($1,000.00), executed by the\napplicant as principal and at least one surety upon which service of process may be made in the state of Colorado; such\nbond to be conditioned that the applicant shall comply fully with all the provisions of the ordinances of the City, of the\nstatutes of the state regulating and concerning the applicant's business, and will pay all judgments rendered against said\napplicant for any violation of said ordinances or statutes, or any of them together with all judgments and costs that may be\nrecovered against him/her by any person or persons for damage growing out of any misrepresentation or deception\npracticed on any person transacting such business with such applicant, whether the misrepresentations or deceptions were\nmade or practiced by the owners or by their servants, agents or employees, either at the time of making the sale or through\nany advertisement of any character whatsoever, printed or circulated with reference to the goods, wares and merchandise\nsold or any part thereof.  Action on the bond may be brought in the name of the City or the use of the aggrieved person.\n Such bond must be responsibility of the surety thereon.  (Ord. 1386, 08/21/90.)\nSection 9-54.    Exclusion from provisions.\nNothing contained in Section 9-53 shall apply to any resident of this State selling fruits, farm or garden produce of their\nown raising, or fresh meat butchered from animals of their own raising.  (Ord. 1958, Sec. 14-136.)\nState Law reference: As to authority to regulate peddlers and solicitors, see C.R.S. 1973, Sec. 31-15-501.\nDIVISION 8.  SECONDHAND GOODS.\nSection 9-55.    Definitions.\nAs used herein:\n(1) Dealer in secondhand goods shall mean a person who shall keep a store or other place of business for the purchase or\nsale of secondhand clothing, household goods, books, pictures, tools, leather goods, firearms, or any other kind of\nsecondhand goods, wares and merchandise.\n(2) Secondhand goods shall mean and include any and all kinds of goods, wares and merchandise, which shall have been\npurchased by one not a dealer in such articles, for the use of himself/herself, or his/her family or employees.  (Ord. 1958,\nSec. 4-69.)\nSection 9-56.    Dealer in secondhand goods - License required; fee.\n(1)  It shall be unlawful for any person to carry on the business of a dealer in secondhand goods without first having\nobtained a license therefor.\n(2)  Licenses may be issued for the purpose of dealing in secondhand goods upon payment by the applicant of a license fee\nof Ten Dollars ($10.00) per year.\nCross reference: As to provision pertaining to licensing of a junk dealer as secondhand dealer, see Sec. 9-48.\nState Law reference: As to authority to regulate secondhand stores, see C.R.S. 1973, Sec. 31-15-501.\nSection 9-57.    Record to be kept; inspection.\nEvery dealer in secondhand goods shall keep a record of all purchases of goods made by him/her or his/her agent, in\nwhich record he/she shall enter the names of the seller, a description of the article or articles purchased, the day and hour\nof purchase, and the signature of the seller.  This record shall be open at all times to the inspection of any member of the\nCity police force.  Any dealer in secondhand goods who shall fail to keep a record as herein required, or who shall fail or\nrefuse to submit the same to the inspection of any member of the City police force, when requested so to do, shall be\ndeemed guilty of a misdemeanor.  (Ord. 1958, Sec. 14-71.)\nSection 9-58.    Receiving goods from minors.\nIt shall be unlawful for any dealer in secondhand goods to purchase or receive from any minor, without the written\nconsent of his/her guardian or parent, any article whatsoever. When any goods are purchased from any minor, the written\nconsent of the parent or guardian shall be attached to the record of the purchase.  (Ord. 1958, Sec. 14-72.)\nDIVISION 9.  CONTRACTORS.\nSection 9-59.    REPEALED. (Ord. 1949, eff. 12/17/13)\nSection 9-60.    REPEALED. (Ord. 1949, eff. 12/17/13)\nSection 9-61.    REPEALED. (Ord. 1949, eff. 12/17/13)\nSection 9-61.1 REPEALED. (Ord. 1949, eff. 12/17/13)\nDIVISION 10.  STREET STANDS.\nSection 9-62.  Street stands - License required.\nIt shall be unlawful for any person to have or keep any stand, booth, box, wagon, shed, cart or other thing or contrivance in\nor upon any street or alley or other public or private place for the purpose of selling or offering for sale therefrom popcorn,\ncandy, lunches, meals or any other article or thing or any goods, wares or merchandise without first having obtained a\nlicense therefor, except as set forth in Section 9-63.  (Ord. 1353, Sec. 2, 5/23/89.)\nSection 9-63.  License or permit requirements.\n(1)  Licenses may be issued for the purposes contemplated in Section 9-62 upon compliance with the provisions of Section\n9-6, and upon receipt of a proper application containing all applicable information as required on the form provided by the\nCity of Trinidad and the payment of a license fee in lieu of the annual business license fee set forth in Section 9-7(2).  The\nlicense shall be valid for a six (6) month period beginning the date of issuance.  The license fee shall be Twenty-Four\nDollars ($24.00) for each six (6) month period.  A new license application, application fee and license fee shall be required\nfor each six-month period for which a license is issued.  No business shall be transacted under such license between the\nhours of 10:00 P.M. and 6:00 A.M.  All places where such business shall be conducted shall be designated by the City Clerk\nor a subordinate acting under the City Clerk's direction. (Ord. 1353, Sec. 3, 5/23/89.)\n(2)  Any person operating a street stand as part of a City sanctioned special event lasting no more than five (5) days shall\nnot be required to obtain a business license or the license described in Subsection (1) of this Section.  However, such\nperson shall be required to obtain a permit from the City Clerk.  Application shall be made on a form provided to the City.\n No application fee shall be charged.  The applicant shall be charged a $5.00 permit fee for issuance of the permit.  The\npermit shall be valid for the duration of the special event.  No business shall be transacted under such permit between the\nhours of 10:00 p.m. and 6:00 a.m.   The permit fee requirement set forth in this Section shall not take effect until July 1,\n1989.  All other provisions of this Ordinance shall take effect on the effective date of this Ordinance.  (Ord. 1353, Sec. 2,\n5/23/89.)\n(3)  Any organization or entity seeking City sanction of a special event shall make such a request in writing to the City\nManager.  The City Manager shall take into consideration, in deciding whether an event shall be sanctioned by the City, the\ndegree and type of control exercised over the event and arrangements made for clean-up after the conclusion of the events,\nin addition to any other factors he/she may deem relevant.  (Ord. 1353, Sec. 2, 5/23/89.)\nDIVISION 11.  EMERGENCY, POLICE AND FIRE ALARM SYSTEMS.\nSection 9-64.  License to engage in business of selling; fee.\n(1)  It shall be unlawful for any person to engage in the business of operating, maintaining, installing or selling any dial\nalarm devices or systems, or emergency alarm devices of any kind which result in the transmission of a telephone,\nelectrical or electronic signal or impression to the Police Department, Fire Department or any other person who, acting in\nresponse thereto, in turn transmits or releases a communication to the Police or Fire Department of an emergency without\nfirst having obtained a license from the City Clerk.  An annual license in the amount of One Hundred Dollars ($100.00)\nshall be paid by any person securing a license to engage in such business under the provisions hereof and a performance\nbond or liability insurance policy covering all operations in the scope of this Chapter in the principal sum of no less than\nTwo Thousand Five Hundred Dollars ($2,500.00).\n(2)  It shall be unlawful to install and thereafter operate and maintain any emergency alarm device or system of any kind\nwithout having first obtained a permit therefor for each device or system installed.  A permit fee of Twenty-Five Dollars\n($25.00) shall be paid prior to the installation of any such device or system in any place within the City, or under any\ncircumstances covered by the provisions of this article.\nSection 9-65.  Installation and maintenance costs.\nAny and all costs and recurring charges attributable to the installation and maintenance of systems permitted by this\nChapter which terminate directly in the Police Department or Fire Department of the City shall be borne entirely by the\nlicensee or permittee.\nSection 9-66.  False alarms; charges for; suspension or terminations of permits.\n(1)  A charge of Twenty-Five Dollars ($25.00) for each false fire, burglar, holdup or police emergency alarm to which the\nPolice or Fire Department respond in excess of three (3) in any ninety (90) day period shall be paid to the City. Repeated\nfalse alarms in excess of six (6) shall be charged Fifty Dollars ($50.00) for each call.  False alarms in excess of nine (9) in\nany ninety day period for whatever reason shall be grounds for suspension or termination by the Chief of Police of the\npermit  for such system as a faulty system.\n(2)  The Chief of Police shall at all times have the authority to suspend the permit for any such system until such time as\nsatisfactory repairs or replacement is made correcting such system.  Systems shall remain deactivated or removed until the\nsuspension is terminated or a new permit is issued.  (Ord. 1297, 4/1/86.)\nDIVISION 12.  SEXUALLY ORIENTED BUSINESSES.\nSection 9-67.  Definitions.\nCertain words and phrases used in this Article shall have the meanings ascribed in them in Section 9-3 and 14-172. (Ord.\n1738, eff., 10-21-03)\nSection 9-68.  Sexually oriented business license required.\n(1) No sexually oriented business license shall be issued for any sexually oriented business located within any zone district\nother than the I-Industrial District. (Ord. 1738, eff., 10-21-03)\n(2) No person shall operate a sexually oriented business without first having obtained a valid type A or type B sexually\noriented business license issued by the City of Trinidad. (Ord. 1738, eff., 10-21-03)\na. A type A sexually oriented business license shall be required for sexually oriented businesses where alcoholic\nbeverages or alcoholic liquors, as defined by the Colorado Liquor Code, and/or fermented malt beverages, as defined\nby the Colorado Beer Code, are allowed pursuant to a valid license issued under Chapter 3 of the Code of Ordinances\nof the City of Trinidad. (Ord. 1738, eff., 10-21-03)\nb. A type B sexually oriented business license shall be required for all sexually oriented businesses where alcoholic\nbeverages or alcoholic liquors, as defined by the Colorado Liquor Code, and/or fermented malt beverage, as defined\nby the Colorado Beer Code, are not allowed. (Ord. 1738, eff., 10-21-03)\n(3) It shall be unlawful to operate or cause to be operated a sexually oriented business when said person knows or\nreasonably should know that: (Ord. 1738, eff., 10-21-03)\n(a) the business does not have a sexually oriented business license; (Ord. 1738, eff., 10 -21-03)\n(b) the business has a sexually oriented business license that is under suspension; (Ord. 1738, eff., 10-21-03)\n(c) the business has a sexually oriented business license that has been revoked; (Ord. 1738, eff., 10-21-03)\n(d) the business has a sexually oriented business license that has expired; (Ord. 1738, eff., 10-21-03)\n(e) the business operates under a type B sexually oriented business license and allows alcoholic beverages or\nalcoholic liquors, as defined by the Colorado Liquor Code, and/or fermented malt beverages, as defined by the\nColorado Beer code, on the premises; (Ord. 1738, eff., 10-21-03)\n(f) the business is in violation of any applicable provision of Chapter 14 of this Code. (Ord. 1738, eff., 10-21-03)\nSection 9-69.  Fees.\n(1)  The annual fee for a sexually oriented business license is five hundred dollars ($500.00) (Ord. 1738, eff., 10-21-03)\n(2) The annual manager’s license fee is one hundred dollars ($100.00). (Ord. 1738, eff., 10-21-03)\n(3) An applicant for either a type A or type B sexually oriented business license shall pay a nonrefundable application fee of\nfive hundred twenty-five dollars ($525.00) at the time of filing an application. (Ord. 1738, eff., 10-21-03)\nSection 9-70.  Application for sexually oriented business license.\n(1)  The City Clerk is responsible for granting, denying, revoking, renewing, and suspending sexually oriented business\nlicenses for proposed or existing sexually oriented businesses. (Ord. 1738, eff., 10-21-03)\n(2) The Planning Director or his or her designee is responsible for ascertaining whether a proposed sexually oriented\nbusiness for which a sexually oriented business license application has been submitted complies with all location\nrequirements of Section 14-174. (Ord. 1738, eff., 10-21-03)\n(3)  The Police Chief or his or her designee is responsible for providing information on whether an applicant has been\nconvicted of a specified criminal act during the time periods set forth in Section 9-73(3)(i). (Ord. 1738, eff., 10-21-03)\n(4)  The Building Inspector or his or her designee is responsible for inspecting a proposed sexually oriented business in\norder to ascertain whether it is in compliance with applicable building codes and ordinances. (Ord. 1738, eff., 10-21-03)\n(5)  The Fire Chief or his or her designee is responsible for ascertaining the compliance of the sexually oriented business\nwith all applicable fire and electrical codes and occupancy requirements. (Ord. 1738, eff., 10-21-03)\n(6)  Any person desiring to operate a sexually oriented business shall file with the City Clerk an original and two (2) copies\nof a sworn sexually oriented business license application on the standard application form supplied by the City Clerk. (Ord.\n1738, eff., 10-21-03)\n(7)  The completed application shall contain the following information and shall be accompanied by the following\ndocuments: (Ord. 1738, eff., 10-21-03)\n(a) If the applicant is an individual, the individual shall state his or her legal name and any aliases, and submit\nsatisfactory proof that he or she is twenty-one (21) years of age or older in the case of a type A sexually oriented\nbusiness license or eighteen (18) years of age or older in the case of a type B sexually oriented business license. (Ord.\n1738, eff., 10-21-03)\n(b) If the applicant is a legal entity, the application shall state its complete name, the date and place of its\norganization, evidence that it is in good standing under the laws of the state in which it is organized, and if it is\norganized under the laws of a state other than Colorado, that it is registered to do business in Colorado, the full legal\nnames, date of birth and the capacity of all officers, directors, managers, and principal owners, and the name of the\nregistered agent and the address of the registered agent for service of process, if any. (Ord. 1738, eff., 10-21-03)\n(c) If the applicant intends to operate the sexually oriented business under a name other than that of the applicant,\nthe sexually oriented business’ fictitious name must be stated. (Ord. 1738, eff., 10-21-03)\n(d) Whether the applicant or any of the other individuals listed pursuant to subsections (6)(a) or (b) has been\nconvicted of a specified criminal act within the times set forth in Section 9-73(3)(i), and if so, the specified criminal\nact involved, the date of conviction and the place of conviction. (Ord. 1738, eff., 10-21-03)\n(e) Whether the applicant or any of the other individuals listed pursuant to subsections (6)(a) or (b) has had a\nprevious license under this or any other sexually oriented business ordinance from another city, town or county\ndenied, suspended, or revoked and, if so, the name of the city, town or county where the license was previously\ndenied, suspended or revoked, and the name and location of the sexually oriented business for which the license was\ndenied, suspended, or revoked, as well as the date of the denial, suspension or revocation. (Ord. 1738, eff., 10-21-03)\n(f) Whether the applicant or any other individuals listed pursuant to subsection (6)(a) or (b) has been a partner in a\npartnership or a principal owner of a corporation or other legal entity whose license has previously been denied,\nsuspended, or revoked and, if so, the name of the city, town or county where the license was previously denied,\nsuspended or revoked, and the name and location of the sexually oriented business for which the license was denied,\nsuspended, or revoked, as well as the date of denial, suspension, or revocation. (Ord. 1738, eff., 10-21-03)\n(g) Whether the applicant or any other individual listed pursuant to subsections (6)(a) and (b) holds any other\nlicenses under this Article or any other sexually oriented business ordinance from another city, town or county, and,\nif so, the name of such city, town or county, and names and locations of such other licensed businesses. (Ord. 1738,\neff., 10-21-03)\n(h) The location of the proposed sexually oriented business including a legal description of the property, street\naddress, and telephone number(s). (Ord. 1738, eff., 10-21-03)\n(i) Proof of the applicant’s right to possession of the premises wherein the sexually oriented business will be\nconducted. (Ord. 1738, eff., 10-21-03)\n(j) The applicant’s mailing address and residential address. (Ord. 1738, eff., 10-21-03)\n(k) A sketch or diagram showing the configuration of the premises including a statement of total floor space occupied\nby the business.  The sketch or diagram need not be professionally prepared, but it must be oriented to the north or\nto some designated street or object and shall be drawn to a designated scale or drawn with marked dimensions of the\ninterior of the premises to an accuracy of plus or minus six (6) inches.  The City Clerk may waive the foregoing\ndiagram for renewal applications if the applicant adopts a diagram that was previously submitted and certifies that\nthe configuration of the premises has not been altered since it was prepared.  If the sexually oriented business has or\nwill have a peep booth or booths subject to the provisions of Section 14-182, the sketch shall show the locations and\ndimensions of any manager’s stations and demonstrate that there is an unobstructed view from at least one of the\nmanager’s stations of every area of the premises to which any patron is permitted access, excluding restrooms.  The\nfloor plan shall designate those rooms or other areas of the premise where patrons are not permitted and shall also\ndesignate the use of each room or other area of the premises. (Ord. 1738, eff., 10-21-03)\n(l) A current certificate and straight-line drawing prepared within thirty (30) days prior to an initial application by a\nColorado registered land surveyor depicting: (i) the property lines and the structures of the property to be certified;\nand (ii) the location of the property lines of any church, school, dwelling, public park, or childcare facility within five\nhundred (500) feet of the property to be certified and (iii) the location of the property lines and structures on the\nproperty of any other sexually oriented business within one hundred (100) feet of the property to be certified.  For\npurposes of this section, a use shall be considered existing or established if it is in existence or pending at the time an\napplication is submitted. (Ord. 1738, eff., 10-21-03)\n(m) If a person who wishes to operate a sexually oriented business is an individual, he or she must sign the\napplication for a sexually oriented business license as applicant.  If a person who wishes to operate a sexually\noriented business is other than an individual, each principal owner of the applicant must sign the application for a\nsexually oriented business license as applicant. (Ord. 1738, eff., 10-21-03)\n(8) In the event that the City Clerk determines or learns at any time that the applicant has improperly completed the\napplication for a proposed sexually oriented business, he or she shall promptly notify the applicant of such fact and allow\nthe applicant ten (10) days properly to complete the application.  The time period for granting or denying a sexually\noriented business license shall be stayed during the period in which the applicant is allowed an opportunity to properly\ncomplete the application. (Ord. 1738, eff., 10-21-03)\n(9) The fact that a person possesses or is required to possess other types of state or town licenses does not exempt him or\nher from the requirement of obtaining a sexually oriented business license. (Ord. 1738, eff., 10-21-03)\nSection 9-71.  Duty of supplement application.\n(1)  Applicants for a sexually oriented business license under Section 9-70 shall have a continuing\nduty to promptly supplement any application information required by that section in the event that said information\nchanges in any way from what is stated on the application. (Ord. 1738, eff., 10-21-03)\n(2)  The failure to comply with said continuing duty to supplement an application within thirty (30)\ndays from the date of such change shall be grounds for suspension of a sexually oriented business license. (Ord. 1738, eff.,\n10-21-03)\nSection 9-72.  Investigation and application.\n(1)   Upon receipt of an application for a sexually oriented business license properly filed with the City Clerk and upon\npayment of the nonrefundable application fee and refundable annual license fee, the City Clerk shall immediately stamp\nthe application as received and send copies of the application to the director of planning, the building official, fire chief\nand the police chief.  The Planning Director, the Building Inspector and the Police and Fire Chief, or their respective\ndesignees, shall promptly conduct an investigation of the application information, and the proposed sexually oriented\nbusiness in accordance with his or her responsibilities under this section.  Investigations shall be completed within twenty\n(20) days of receipt of the application by the licensing officer.  At the conclusion of their investigations, the Planning\nDirector and the Building Inspector shall indicate on the copy of the application his or her approval or disapproval of the\napplication, date it, sign it, and in the event of the disapproval, state the reasons therefore.  The Fire Chief shall only be\nrequired to render an opinion regarding fire and electrical code violations and occupancy limits.  The Police Chief shall\nonly be required to provide the information specified in Section 9-70(3), and shall not be required to approve or\ndisapprove applications. (Ord. 1738, eff., 10-21-03)\n(2)   The Planning Director, the Building Inspector, and the Fire Chief may disapprove an application if he or she finds that\nthe proposed sexually oriented business will be or is in violation of any provision of any statute, code, ordinance,\nregulations, or other law in effect in the City.  After their investigations and review the Planning Director, the Building\nInspector and the Police Chief shall immediately return the copy of the application to the City Clerk.  The City Clerk shall\nnot issue a sexually oriented business license unless signed copies of the application for the same have been delivered to\nthe City Clerk by the Planning Director and the Building Inspector and unless the Police Chief has supplied said City Clerk\nwith the information specified in Section 9-70(3). (Ord. 1738, eff., 10-21-03)\nSection 9-73.  Issuance of sexually oriented business license.\n(1)   The City Clerk shall grant or deny a sexually oriented business license within thirty (30) days from the date of its\nproper filing.  Upon the expiration of the thirty (30) days, the applicant shall be licensed to begin operating the business\nfor which the sexually oriented business license is sought, unless and until the City Clerk notifies the applicant, by first\nclass mail to the address on the application, of a denial of the application and states the reason(s) for that denial. (Ord.\n1738, eff., 10-21-03)\n(2)   Grant of a sexually oriented business license. (Ord. 1738, eff., 10-21-03)\n(a) The City Clerk shall grant the sexually oriented business license unless one or more of the criteria set forth in\nsubsection (3) below is present. (Ord. 1738, eff., 10-21-03)\n(b) The sexually oriented business license, if granted, shall state on its face the name of the person or persons to\nwhom it is granted, the expiration date, and the address of the sexually oriented business.  The sexually oriented\nbusiness license shall be posted in a conspicuous place at or near the entrance to the sexually oriented business so\nthat it can be easily read at any time. (Ord. 1738, eff., 10-21-03)\n(3)  Denial of a sexually oriented business license. (Ord. 1738, eff., 10-21-03)\n(a) An applicant is under twenty-one (21) years of age in the case of an application for a type A sexually oriented\nbusiness license or under eighteen (18) years of age in the case of an application for a type B sexually oriented\nbusiness license. (Ord. 1738, eff., 10-21-03)\n(b) An applicant is overdue on his or her payment to the City of taxes, fees, fines, or penalties assessed against or\nimposed upon him or her in relation to a sexually oriented business. (Ord. 1738, eff., 10-21-03)\n(c) An applicant has failed to provide information required by this Article for the issuance of the sexually oriented\nbusiness license or has falsely answered a question or request for information on the application form and has\nrefused to provide corrected information. (Ord. 1738, eff., 10-21-03)\n(d) The premises to be used for the sexually oriented business have been disapproved by an inspecting agency\npursuant to the provisions of Section 9-72(2). (Ord. 1738, eff., 10-21-03)\n(e) The application or sexually oriented business license fees have not been paid. (Ord. 1738, eff., 10-21-03)\n(f) An applicant for the proposed business is in violation of or is not in compliance with any of the provisions of this\nArticle. (Ord. 1738, eff., 10-21-03)\n(g) The granting of a license would violate a statute, ordinance, or court order. (Ord. 1738, eff., 10-21-03)\n(h) The applicant has or had a sexually oriented business license under this Article, or under the regulatory\nprovisions of another jurisdiction, that was suspended or revoked within the previous twelve (12) months. In the case\nof a denial of an application due to the suspension or revocation of the applicant’s license in another jurisdiction, the\napplicant shall be entitled to a hearing before the City Manager.  After the hearing, the City Manager may grant the\napplication without regard to the suspension or revocation of the applicant’s license in another jurisdiction if he finds\nthat the grounds for suspension or revocation in that jurisdiction would not be grounds for suspension or revocation\nof a license pursuant to this Article. (Ord. 1738, eff., 10-21-03)\n(i) An applicant has been convicted of a specified criminal act or acts for which:\n(I) Less than two (2) years have elapsed since the date of conviction or the date of release from confinement,\nwhichever is the later date, if the conviction is of a misdemeanor offense; (Ord. 1738, eff., 10-21-03)\n(II) Less than five (5) years have elapsed since the date of conviction or the date or release from confinement,\nwhichever is the later date, if the conviction is of a felony offense; or (Ord. 1738, eff., 10-21-03)\n(III) Less than five (5) years have elapsed since the date of conviction or the date of release from confinement,\nwhichever is the later date, if the convictions are of two (2) or more misdemeanors. (Ord. 1738, eff., 10-21-03)\nThe fact that a conviction is being appealed shall have no effect on disqualification of the applicant.  An\napplicant who has been convicted of a specified criminal act or acts may qualify for a sexually oriented business\nlicense only when the time period required above has elapsed. (Ord. 1738, eff., 10-21-03)\n(IV) If the City Clerk denies the application, he or she shall notify the applicant, by first class mail to the\naddress on the application, of the denial and state the reason(s) for the denial.  A copy of such denial shall be\nforwarded to the City Attorney. (Ord. 1738, eff., 10-21-03)\nSection 9-74.  Expiration of sexually oriented business license.\n(1)   Each sexually oriented business license shall expire one year from the date of issuance and may be renewed only by\nmaking application as provided in Section 9-70 of this article, including but not limited to a review of whether the\napplicant has been convicted of a specified criminal act or acts (for renewals, filing of the original survey shall be\nsufficient).  Application for renewal of a sexually oriented business license shall be made at least thirty (30) days before the\nexpiration date of the sexually oriented business license. (Ord. 1738, eff., 10-21-03)\n(3) If, subsequent to denial of renewal the City Clerk finds that the basis for denial of the renewal of the sexually oriented\nbusiness license has been corrected, the applicant shall be granted a sexually oriented business license if no more than\nninety (90) days have elapsed since the date denial became final. (Ord. 1738, eff., 10-21-03)\nSection 9-75.  Suspension of sexually oriented business license.\n(1) The City Clerk may suspend a sexually oriented business license for a period not to exceed one\nhundred fifty (150) days, unless the period is extended by operation of subpart (2) of this section, if he or she determines\nthat a licensee or an employee of a licensee has: (Ord. 1738, eff., 10-21-03)\n(a) violated or is not in compliance with any section of this article or any provision of Chapter 14 of this Code; or\n(Ord. 1738, eff., 10-21-03)\n(b) refused to allow an inspection of the sexually oriented business premises as authorized by this article; or (Ord.\n1738, eff., 10-21-03)\n(c) knowingly allowed repeated disturbances of the public peace to occur within the licensed establishment or upon\nthe premises of the licensed establishment involving patrons, employees, or the licensee; or (Ord. 1738, eff., 10-21-\n03)\n(d) operated the sexually oriented business in violation of a building, fire, health, or zoning code, ordinance, or\nregulation, whether federal, state or local, said determination being based on investigation by the department,\ndivision, or agency charged with enforcing said rules or laws. In the event of such a statute, code, ordinance, or\nregulation violation, the licensing officer shall promptly notify the licensee of the violation and shall allow the\nlicensee a twenty (20) day period in which to correct the violation.  If the licensee fails to correct the violation before\nthe\nexpiration of the twenty (20) day period, the City Clerk shall forthwith suspend the sexually oriented business license\nand shall notify the licensee of the suspension; or (Ord. 1738, eff., 10-21-03)\n(e) operated the sexually oriented business in violation of the hours of operation provisions in Section 14-182; or\n(Ord. 1738, eff., 10-21-03)\n(f) transferred a sexually oriented business license contrary to Section 9-78.  In the event of such suspension, the City\nClerk shall forthwith notify the original licensee and the transferee of the suspension.  The suspension shall remain\nin effect until the applicable provisions of Section 9-78 have been satisfied. (Ord. 1738, eff., 10-21-03)\n(2)   The suspension shall remain in effect until and including the last day in the City Clerk’s order and until the violation\nof the statute, code, ordinance, or regulation in question has been corrected. (Ord. 1738, eff., 10-21-03)\nSection 9-76.  Revocation of sexually oriented business license.\n(1)   The City Clerk shall revoke a sexually oriented business license upon determining that: (Ord. 1738, eff., 10-21-03)\n(a) a cause of suspension of Section 9-75 of this article occurred and the sexually oriented business license has been\nsuspended within the preceding twelve (12) months; or (Ord. 1738, eff., 10-21-03)\n(b) a licensee gave false or misleading information in the material submitted during the application process that\ntended to enhance the applicant’s opportunity for obtaining a sexually oriented business or license; or (Ord. 1738,\neff., 10-21-03)\n(c) a licensee, manager or an employee has knowingly allowed possession, use, or sale of controlled substances ( as\ndefined in Part 3 of Article 22 of Title 12, C.R.S.) on the premises; or (Ord. 1738, eff., 10-21-03)\n(d) a licensee, manager, or an employee has knowingly allowed acts of prostitution or negotiations for acts of\nprostitution on the premises; or (Ord. 1738, eff., 10-21-03)\n(e) a licensee, manager or an employee knowingly operated the sexually oriented business during a period of time\nwhen the licensee’s sexually oriented business license was suspended; or (Ord. 1738, eff., 10-21-03)\n(f) a licensee has been convicted of a specified criminal act for which the time period set forth in Section 9-73(3)(i)\nhas not elapsed; or (Ord. 1738, eff., 10-21-03)\n(g) on two (2) or more occasions within a twelve (12) month period, a person or persons committed an offense,\noccurring in or on the licensed premises constituting a specified criminal act for which a conviction has been\nobtained, and the person or persons were employees of the sexually oriented business at the time the offenses were\ncommitted.  The fact that a conviction is being appealed shall have no effect on the revocation of the sexually\noriented business license; or (Ord. 1738, eff., 10-21-03)\n(h) a licensee is delinquent in payment to the city or state for any taxes or fees; or (Ord. 1738, eff., 10-21-03)\n(i) a licensee, manager or an employee has knowingly allowed any specified sexual activity to occur in or on the\nlicensed premises. (Ord. 1738, eff., 10-21-03)\n(2)   When the City Clerk revokes a sexually oriented business license, the revocation shall continue for one year (1) and the\nlicensee shall not be issued a sexually oriented business license for one year from the date revocation became effective.\n(Ord. 1738, eff., 10-21-03)\nSection 9-77.  Suspension or revocation hearing.\n(1)  A licensee shall be entitled to a hearing before the City Manager if the City seeks to suspend or\nrevoke his or her sexually oriented business license based on a violation of this Article or any provision of Chapter 14 of\nthis Code.  The business may continue to operate during the hearing process. (Ord. 1738, eff., 10-21-03)\n(2) When there is probable cause to believe that a cause for suspension or revocation exists, the City Attorney may file a\nwritten complaint with the City Clerk setting forth the circumstances of the alleged violation. (Ord. 1738, eff., 10-21-03)\n(3)   The City Clerk shall provide a copy of the complaint to the licensee, together with notice to appear before the City\nManager for the purpose of a hearing on a specified date to show cause why\nthe licensee’s sexually oriented business license should not be suspended or revoked. (Ord. 1738, eff., 10-21-03)\n(4)   At the hearing, the City Manager shall hear such statements and consider such evidence as the police department or\nother enforcement officers, the owner, occupant, lessee, or other party in interest, or any other witness shall offer that is\nrelevant to the violation alleged in the complaint.  The City Manager shall make findings of fact from the statements and\nevidence offered as to whether the violation occurred in or near the licensed establishment.  If the City Manager\ndetermines that a cause for suspension or revocation exists, he or she shall issue an order suspending or revoking the\nsexually oriented business license with thirty (30) days after the hearing is concluded based on the findings of fact.  A copy\nof the order shall be mailed to or served on the licensee at the address on the license.  In performing his duties pursuant to\nthis section 9-77, the City Manager may retain independent counsel to advise him regarding any matter. (Ord. 1738, eff.,\n10-21-03)\n(5)   The order of the City Manager made pursuant to subsection (4) above shall be a final decision and may be appealed to\nthe district court pursuant to Colorado Rule of Civil Procedure 106(a)(4).  Failure of a licensee timely to appeal said order\nconstitutes a waiver by him or her of any right he or she may otherwise have to contest the suspension or revocation of the\nsexually oriented business license. (Ord. 1738, eff., 10-21-03)\n(6)   The City Manager shall have the power to administer oaths, issue subpoenas, and when necessary grant continuances.\n Subpoenas may be issued to require the presence of persons and production of papers, books, and records necessary to\nthe determination of any hearing, which the City Manager conducts.  It is unlawful for any person to fail to comply with\nany subpoena issued by the City Manager.  A subpoena shall be served in the same manner as a subpoena issued by the\ndistrict court of the State of Colorado. (Ord. 1738, eff., 10-21-03)\n(7)   All hearings held before the City Manager regarding suspension or revocation of a sexually oriented business license\nissued under this ordinance shall be recorded steno-graphically or by electronic recording device.  Any person requesting a\ntranscript of such record shall post a deposit in the amount required by the City Manager, and shall pay all costs of\npreparing such record. (Ord. 1738, eff., 10-21-03)\n(8)   In the event of suspension, revocation, or cessation of business, no portion of the sexually oriented business license\nfee shall be refunded. (Ord. 1738, eff., 10-21-03)\nSection 9-78.  Transfer of sexually oriented business license.\n(1)   A licensee shall not operate a sexually oriented business under the authority of a sexually oriented business license at\nany place other than the address designated in the application for sexually oriented business license. (Ord. 1738, eff., 10-\n21-03)\n(2)   A licensee shall not transfer his or her sexually oriented business license to another person unless and until such other\nperson satisfies the following requirements: (Ord. 1738, eff., 10-21-03)\n(a) Obtains an amendment to the sexually oriented business license from the licensing officer that provides that he or\nshe is not the licensee, which amendment may be obtained only if he or she has completed and properly filed an\napplication with the licensing officer setting forth the information called for under Section 9-70 in the application;\nand\n(b) Pays a nonrefundable application fee and an annual sexually oriented business license fee.(Ord. 1738, eff., 10-21-\n03)\n(3) No sexually oriented business license may be transferred when the City Clerk has notified the licensee that suspension\nor revocation proceedings have been or will be brought against the licensee. (Ord. 1738, eff., 10-21-03)\n(4) Any attempt to transfer a sexually oriented business license either directly or indirectly in violation of this section is\nhereby declared void. (Ord. 1738, eff., 10-21-03)\nSection 9-79.  Manager’s license required; change of manager; inactive status.\n(1)   A manager shall be on the premises of a sexually oriented business at all times during operation.\nIt shall be unlawful for any person to work as a manager of a sexually oriented business without first obtaining a manager’s\nlicense for such premises.  A manager can only manage one sexually oriented business establishment. (Ord. 1738, eff., 10-\n21-03)\n(2)   In the event a manager ceases to be employed at the premises listed in his or her application, the manager shall\nimmediately report such change to the licensing officer but in no event shall such change be reported later than ten (10)\ndays after cessation of employment. (Ord. 1738, eff., 10-21-03)\n(3)   Provided a manager has complied with the requirements of subsection (2), his or her license shall remain in inactive\nstatus until it expires or is reactivated. A manager who is re-employed at the premises listed in the manager’s license may\nreactivate his or her license provide the City Clerk determines he or she still meets the requirements of Section 9-80. (Ord.\n1738, eff., 10-21-03)\nSection 9-80.  Application for manager’s license.\n(1)   A manager shall submit an application for a manager’s license for each sexually oriented business the manager\nproposes to manage on a form to be provided by the licensing officer.  The application shall contain the applicant’s full\nlegal name, address, date of birth, telephone number, address, the name and address of the sexually oriented business that\nmanager proposes to manage and the information required in Section 9-70(6)(d). (Ord. 1738, eff., 10-21-03)\n(2)   The police department shall conduct an investigation of the applicant to determine if the applicant has been convicted\nof a specified criminal act within the times set forth in Section 9-73(3)(i). (Ord. 1738, eff., 10-21-03)\n(3)   The City Clerk shall grant the application within ten (10) days of its filing unless: (Ord. 1738, eff., 10-21-03)\n(a) the applicant is under the age of twenty-one (21) in the case of a type A sexually oriented business license or under the\nage of eighteen (18) in the case of a type B sexually oriented business license; (Ord. 1738, eff., 10-21-03)\n(b) the applicant has failed to provide the information required by this section; (Ord. 1738, eff., 10-21-03)\n(c) the license fee has not been paid; (Ord. 1738, eff., 10-21-03)\n(d) the applicant has been convicted of a specified criminal act within the times set forth in Section 9-73(3)(i). (Ord. 1738,\neff., 10-21-03)\nSection 9-81.  Expiration of manager’s license.\n(1) Each manager’s license shall expire one year from the date of issuance and may be renewed only by making application\nas provided in section 9-78, including but not limited to a review of whether the applicant has been convicted of a specified\ncriminal act or acts.  Application for renewal of a manager’s license shall be made at least thirty (30) days before the\nexpiration date of the manager’s license. (Ord. 1738, eff., 10-21-03)\n(2) If, subsequent to denial of renewal the City Clerk finds that the basis for denial of the renewal of the manager’s license\nhas been corrected, the applicant shall be granted a manager’s license if no more than ninety (90) days have elapsed since\nthe date denial became final. (Ord. 1738, eff., 10-21-03)\nSection 9-82.  Suspension of manager’s license.\n(1) The City Clerk may suspend a manager’s license for a period not to exceed ninety (90) days, unless the period is\nextended by operation of subpart B of this section, if he or she determines that the manager has: (Ord. 1738, eff., 10-21-03)\n(a) violated or is not in compliance with any section of this article or any provision of Chapter 14 of this Code; or\n(b) refused to allow an inspection of the sexually oriented business premises as authorized by this Article; or (Ord.\n1738, eff., 10-21-03)\n(c) knowingly allowed repeated disturbances of the public peace to occur within the licensed establishment or upon\nthe premises of the licensed establishment involving patrons, employees, or the licensee; or (Ord. 1738, eff., 10-21-\n03)\n(d) operated the sexually oriented business in violation of the hours of operation provisions in Section 14-183. (Ord.\n1738, eff., 10-21-03)\n(2)  The suspension shall remain in effect until and including the last day in the City Clerk’s order and until the violation of\nthe statute, code, ordinance, or regulation in question has been corrected. (Ord. 1738, eff., 10-21-03)\nSection 9-83.  Revocation of manager’s license.\n(1) The City Clerk shall revoke a manager’s license upon determining that: (Ord. 1738, eff., 10-21- 03)\n(a)       a cause of suspension in Section 9-82 of this article occurred and the manager’s license has been suspended\nwithin the preceding twelve (12) months; or (Ord. 1738, eff., 10-21-03)\n(b)       the manager gave false or misleading information in the material submitted during the application process\nthat tended to enhance the applicant’s opportunity for obtaining a manger’s license; or (Ord. 1738, eff., 10-21-03)\n(c)       the manager knowingly allowed possession, use, or sale of controlled substances (as defined in Part 3 or\nArticle 22 of Title 12, C.R.S.) on the premises; or (Ord. 1738, eff., 10-21-03)\n(d)       the manager knowingly allowed acts of prostitution or negotiations for acts of prostitution on the premises; or\n(Ord. 1738, eff., 10-21-03)\n(e)       the manager knowingly operated the sexually oriented business during a period of time when the sexually\noriented business license was suspended; or (Ord. 1738, eff., 10-21-03)\n(f)        the manager has been convicted of a specified criminal act for which the time period set forth in Section 9-\n73(3)(i) has not elapsed; or (Ord. 1738, eff., 10-21-03)\n(g)       the manager has knowingly allowed any specified sexual activity to occur in or on the licensed premises. (Ord.\n1738, eff., 10-21-03)\n(2)    When the City Clerk revokes a manager’s license, the revocation shall continue for one year and the licensee shall not\nbe issued a manager’s license for one year from the date revocation became effective. (Ord. 1738. eff., 10-21-03)\nSection 9-84.  Suspension or revocation hearing.\n(1) A manager shall be entitled to a hearing before the City Manger if the City seeks to suspend or revoke the manager’s\nlicense based on a violation of this Article or any provision of Chapter 14 of this Code.  The manager may continue to\nmanage a sexually oriented business during the hearing process. (Ord. 1738, eff., 10-21-03)\n(2) When there is probable cause to believe that a cause for suspension or revocation exists, the City Attorney may file a\nwritten complaint with the City Clerk setting forth the circumstances of the alleged violation. (Ord. 1738, eff., 10-21-03)\n(3) The licensing officer shall provide a copy of the complaint to the licensee, together with notice to appear before the City\nManager for the purpose of a hearing on a specified date to show cause why the licensee’s license should not be suspended\nor revoked. (Ord. 1738, eff., 10-21-03)\n(4) At the hearing, the City manger shall hear such statements and consider such evidence as the police department or\nother enforcement officers, the owner, employee, occupant, lessee, or other party in interest, or any other witness shall\noffer that is relevant to the violation alleged in the complaint.  The City Manger shall make findings of fact from the\nstatements and evidence offered as to whether the violation occurred in or near the licensed establishment.  If the City\nManager determines that a cause for suspension or revocation exists, he or she shall issue an order suspending or revoking\nthe manager’s license within thirty (30) days after the hearing is concluded based on the findings of fact.  A copy of the\norder shall be mailed to or served on the license at the address on the license. (Ord. 1738, eff., 10-21-03)\n(5) The order of the City Manager made pursuant to subsection (4) above shall be a final decision and may be appealed to\nthe district court to Colorado Rule of Civil Procedure 106(a)(4).  Failure of a licensee timely to appeal said order\nconstitutes a waiver by him or her of any right he or she may otherwise have to contest the suspension or revocation of the\nmanager’s license. (Ord. 1738, eff., 10-21-03)\n(6) The City Manager shall have the power to administer oaths, issue subpoenas, and when necessary grant continuances.\n Subpoenas may be issued to require the presence of persons and production of papers, books, and records necessary to\nthe determination of any hearing, which the City Manager conducts.  It is unlawful for any person to fail to comply with\nany subpoena issued by the City Manager.  A subpoena shall be served in the same manner as a subpoena issued by the\ndistrict court of the State of Colorado. (Ord. 1738, eff., 10-21-03)\n(7) All hearing held before the City Manager regarding suspension or revocation of a manager’s license issued under this\nordinance shall be recorded steno-graphically or by electronic recording device.  Any person requesting a transcript of\nsuch record shall post a deposit in the amount required by the City Manager, and shall pay all costs of preparing such\nrecord. (Ord. 1738, eff., 10-21-03)\n(8) In the event of suspension, revocation, or cessation of business, no portion of the manager’s license fee shall be\nrefunded. (Ord. 1738, eff., 10-21-03)\nSection 9-85.  Notice.\nAny notice required by this Article shall be deemed sufficient if it is deposited in first class mail, postage pre-paid, to the\naddress on the application and shall be effective upon mailing. (Ord. 1738, eff., 10-21-03)\nSection 9-86.  Judicial review.\nAfter denial of an application, or denial of a renewal of an application, or suspension or revocation of a license, such act\nshall be a final decision.  Therefore, the applicant or licensee may seek judicial review of such administrative action\npursuant to Colorado Rules of Civil Procedure.  The court shall promptly review such administrative action. (Ord. 1738,\neff., 10-21-03)\nSection 9-87.  Inspection.\n(1)   An applicant or licensee or manager shall permit representative of the licensing officer, building official, the director\nof planning, the police department, the county health department and the fire department to inspect the premises of a\nsexually oriented business for the purpose of ensuring compliance with the law at any time it is occupied or open for\nbusiness. (Ord. 1738, eff., 10-21-03)\n(2)   It shall be unlawful for the person, applicant, licensee, or manager who operates a sexually oriented business or his or\nher agent to refuse to permit such lawful inspection of the premises at any time that it is occupied or open for business.\n(Ord. 1738, eff., 10-21-03)\n", "Chapter 10 - [Title from PDF Content]": "Chapter 10 - Municipal Court\nSections:\n10-1                 Municipal Court - Creation.\n10-2                 Municipal Court - Jurisdiction and powers.\n10-3                 Municipal Court - Rules of procedure.\n10-4                 Sessions of Court - Regular and special.\n10-5                 Municipal Judges - Appointment; oath; salary; powers.\n10-6                 Procedure for issuance of warrant.\n10-7                 Court Clerk - Appointment; duties; salary; reports.\n10-8                 Appropriations for Municipal Court.\nCHAPTER 10.  MUNICIPAL COURT.\nSection 10-1.   Municipal Court - Creation.\n(1) Definitions.\nAs used in this Section, unless the context otherwise requires:\na) A municipal court in and for the City of Trinidad is hereby created and established, pursuant to and governed by the\nprovisions of Title 13 of Article 10, C.R.S. 1973, as amended, and the City Charter.\nb) The municipal court in and for said City of Trinidad, Colorado, organized to hear and try all alleged violations of\nordinance provisions of the city, is hereby established as a qualified municipal court of record pursuant to the provisions of\nC.R.S. 13-10-101 et seq. The court shall operate in conformity with the Charter and ordinances of the City, shall keep a\nverbatim record of the proceedings and evidence of trials by either electronic devices or stenographic means, and the judge\nof the court shall have been admitted to and currently be licensed in the practice of law in the State of Colorado. (Sec. 10-1,\namended Ord. 2090, eff. 12/13/19)\nSection 10-2.   Municipal Court - Jurisdiction and powers.\nThe Municipal Court shall have original jurisdiction of all cases arising under this Code and other ordinances of the City\nwith full power to punish violators thereof by the imposition of such fines and penalties as are prescribed by ordinance or\nCourt rule.\nSection 10-3.   Municipal Court - Rules of procedure.\nThe Colorado Municipal Court Rules of Procedure promulgated by the Colorado Supreme Court, which took effect on\nJanuary 1, 1989, together with all amendments contained therein, be and the same are hereby adopted by reference and\nsaid Rules are hereby enacted as the Municipal Court Rules of Procedure of the City of Trinidad.\nSection 10-4.   Sessions of Court - Regular and special.\n(1)  There shall be regular sessions of the Court for the trial of cases.  The Municipal Judge may hold a special session of\nthe Court at any time.\n(2)  All sessions shall be open to the public.  Where the nature of the case is such that it would be in the best interest of\njustice to exclude persons not directly connected with the proceeding, the Municipal Judge may order that the courtroom\nbe cleared.\nSection 10-5.   Municipal Judges - Appointment; oath; salary; powers. (Ord. 3014, Sec 10-5, amended, eff.\n2-26-21)\n\n(1)  The Court shall be presided over by a Municipal Judge appointed for a term of two (2) years by resolution of the\nCouncil.  Additional Judges may be appointed as may be needed for a term of two (2) years to transact the business of the\nCourt.\n(2)  The compensation of the Judge shall be an annual salary in an amount set by the Council and shall be payable as other\nsalaries to Municipal employees.\n(3)  Before entering the duties of his/her office, a Municipal Judge shall make an oath or affirmation that he/she will\nsupport the Constitution of the United States, the Constitution\nof the State, and the laws of the City and will faithfully perform the duties of his/her office.\n(4)  The Municipal Judge is empowered in his/her discretion to assess costs of Forty Dollars ($40.00) against any\nDefendant who pleads Guilty or Nolo Contendere or who enters into a plea agreement or who after trial, is found guilty of\nan ordinance violation. (Sec. 10-5(4), amended Ord. 2089, eff. 12/13/19)\n(5)  In addition to other powers, a Municipal Judge shall have full power and authority to make and adopt rules and\nregulations for conducting the business of the Municipal Court, consistent with the Colorado Municipal Court Rules of\nProcedure promulgated by the Colorado Supreme Court.\n(6) The Municipal Judge is empowered to order a defendant who is found guilty of violating any provision of the City of\nTrinidad Municipal Code or any of the ordinances of the City, or who is granted a deferred prosecution or deferred\nsentence, to make restitution or reparation, or both, to the victim of the defendant’s conduct for the damage or injury\nsustained.  (Ord. 1936, eff. 5/29/13)\n(7) In sentencing or fining a violator, the municipal judge shall not exceed the sentence or fine limitations established\nherein. Any other provision of the law to the contrary notwithstanding, the municipal judge may suspend the sentence or\nfine of any violator and place him on probation for a period not to exceed one year.  \nMUNICIPAL COURT/VIOLATIONS BUREAU, TRINIDAD, COLORADO\nBelow is a list of the minimum fines as set by the Judge of this Court and are payable at the office of the Court Clerk.\nSchedule of Fines\nPoints for traffic violations are assessed by the Colorado Motor Vehicle Division in accordance with the Colorado Revised\nStatutes, this Court has no control over the assessment of these points.\nIn addition to fines assessed, court costs in the amount of $40.00 may be assessed against any defendant who pleads\nguilty or nolo condere or who enters into a plea agreement or who after trial is found guilty of an ordinance violation.\nSection 10-6.   Procedure for issuance of warrant.\nThe application for and issuance of any search warrant which may be issued by the Municipal Judge to search for and seize\nproperty, or for inspection of private premises by an authorized inspector, shall be in accordance with those procedures set\nforth in the Colorado Municipal Court Rules of Procedure.\nSection 10-7.   Court Clerk - Appointment; duties; salary; reports.\n(1)  The Presiding Judge may appoint a person to serve as Clerk of the Court whose duties shall be those assigned by the\nPresiding Judge.\n(2)  The compensation of the Court Clerk shall be an annual salary in an amount set by the Council and shall be payable as\nother salaries to Municipal employees.\n(3)  The Court Clerk shall file monthly reports with the City Clerk of all moneys collected by him/her.  All moneys received\nby and in the custody of the Court Clerk shall be paid daily to the Department of Finance.\nSection 10-8.   Appropriations for Municipal Court.\nThe City Council shall, on an annual basis, budget and appropriate such moneys as may be necessary for the proper\noperation of the Municipal Court.\n", "Chapter 11 - [Title from PDF Content]": "Chapter 11 - Municipal Solid Waste\nSections:\n11-1                       Title.\n11-2                       Definitions and rules of construction.\n11-3                       Who may collect, transport and dispose of municipal solid waste.\n11-4                       Licensing procedure - Fee.\n11-5                       Vehicles used in transporting municipal solid waste.\n11-6                       Insurance requirements.\n11-7                       Suspension or revocation of license.\n11-8                       Storage and placement of municipal solid waste.\n11-9                       Scattering of municipal solid waste.\n11-10                     Accumulation and use of manure.\n11-11                     Burning of municipal solid waste.\n11-12                     City Landfill fees.\n11-13                     Penalty for violation.\nCHAPTER 11.  MUNICIPAL SOLID WASTE\nSection 11-1.  Title.\nThis article shall be known as and may be cited as the \"Municipal Solid Waste Ordinance of the City of Trinidad,\nColorado.\"\nSection 11-2.  Definitions and rules of construction.\nFor the purposes of this Chapter, the following terms, phrases, words and their derivations shall have the meaning given\nherein.  When not inconsistent with the context, words used in the present tense include the future, words in the plural\nnumber include the singular number and vice versa. The word \" shall \" is mandatory and the word \" may \" is permissive.\n(1) Asbestos material shall mean any material that contains more than one percent (1%) asbestos by weight or volume.\n(2) Hazardous waste shall mean any material, alone or mixed with other materials, which has no commercial use or value,\nor which is discarded or is to be discarded by the possessor thereof, either of which because of its quantity, concentration,\nor physical, or chemical characteristics may cause or significantly contribute to an increase in mortality or an increase in\nserious irreversible or incapacitating reversible illness; or pose a substantial present or potential hazard to human health\nor to the environment when improperly treated, stored, transported, disposed of, or otherwise managed.  The term does\nnot include: discharges which are point sources subject to permits under Section 402 of the \"Federal Water Pollution\nControl Act,\" as amended; source, special nuclear, or byproduct material as defined by the Federal \"Atomic Energy Act of\n1954\", as amended; agricultural waste from the raising of crops or animals, including animal manures, which are returned\nto the soils as fertilizers or soil conditioners; domestic sewage; irrigation return flows; inert materials deposited for\nconstruction for fill or topsoil placement in connection with actual or contemplated construction at such location or for\nchanges in land contour for agricultural and mining purposes, or any waste or other materials exempted or otherwise not\nregulated as hazardous waste under the federal act.\n(3) Municipal solid waste shall mean solid waste from community, commercial and industrial sources that does not\ncontain hazardous wastes as defined in Section 25-15-101 (6) of the Colorado Hazardous Waste Act unless otherwise\nregulated by the Colorado Department of Public Health and Environment.\n(4) Recyclable materials shall mean a type of material that is subject to reuse or recycling.\n(5) Recyclable operation shall mean that part of a solid waste disposal facility, or a part of a general disposal facility at\nwhich recyclable materials may be separated from other materials for further processing.\n\n(6) Sanitary landfill shall mean the final disposal of solid waste on land by a method employing compaction of the waste\nand covering with earth or other suitable material, in compliance with the act and these department regulations.\n(7) Scrap tire shall mean a tire that is no longer used for its original purpose.\n(8) Scrap tire recycling shall mean the sale of scrap tires in the used-tire market, the sale of tire casings or carcasses for\nretreading purposes, or the extraction of useful materials or energy from the tires through thermal, chemical, or physical\nprocessing.\nSection 11-3.  Who may collect, transport and dispose of municipal solid waste.\n(1)  All municipal solid waste generated and/or accumulated within the City shall be collected, conveyed and disposed at a\nsanitary landfill by a licensed contractor or City licensed municipal solid waste collection operator.  No person shall hire\nhimself/herself out to collect, convey over any of the streets or alleys of the City or dispose of any municipal solid waste\nwithout having obtained the required license issued by the City.  The provisions of this Chapter, however, shall not\nprohibit the actual producer or generator at any municipal solid waste or the owner of the premises upon which municipal\nsolid waste has accumulated, from personally collecting, conveying and disposing of such municipal solid waste at a\nsanitary landfill.  Recyclable materials may be accumulated and disposed of separately from other municipal solid waste at\nan approved public or private recycling operation.\n(2)  Scrap tires may be disposed of at a sanitary landfill for scrap tire recycling.\n(3)  No hazardous waste or asbestos material may be accumulated nor disposed of at a sanitary landfill unless such\nsanitary landfill has been authorized by the Colorado Department of Public Health and Environment for such purposes.\nSection 11-4.  Licensing procedure - Fee.\nIt shall be unlawful for any person to hire himself/herself to collect, convey over any of the streets or dispose of any\nmunicipal solid waste without having obtained a license to haul municipal solid waste from the City Clerk.  No license shall\nbe issued until the applicant has paid the annual license fee of One Hundred Dollars ($100.00) and has met the\nrequirements of Sections 11-5 and 11-6 of the Code of Ordinances.  Application shall be made in the manner set forth for\nbusiness licenses in Chapter 9 of the Code of Ordinances.\nSection 11-5.  Vehicles used in transporting municipal solid waste.\n(1)  All vehicles used in the business of transporting municipal solid waste within the City, shall, at a minimum, have the\nfollowing:\n(a)  A permanent cover of canvas or equally suitable or superior material designed to cover the entire open area of\nthe body of such vehicle;\n(b)  A body so constructed as to be permanently leak-proof as to such municipal solid waste;\n(c)  Extensions of sideboards and tailgate, if any, constructed of permanent materials.\n(2)  Prior to the issuance of any license or renewal of the same, the City shall inspect all vehicles\nused in the transporting of solid waste to determine that such vehicles meet the requirements set forth in this Section.  No\nvehicle shall be used in the business of transporting municipal solid waste unless it has been inspected by the City and\nshall have been determined to meet the requirements set forth in this Section.\nSection 11-6.  Insurance requirements.\nAny person in the business of transporting municipal solid waste, within the City, must have, prior to commencing such\noperations, and at all times after commencing such operations, in each motor vehicle used in such business, a motor\nvehicle liability insurance policy or evidence of such policy issued by an insurance carrier or insurer authorized to do\nbusiness in the State of Colorado in the sum of not less than One Hundred Fifty Thousand Dollars ($150,000.00) for\ndamages for or on account of any bodily injury to or the death of each person as the result of any one accident, in the sum\nof not less than One Hundred Fifty Thousand Dollars ($150,000.00) for damages to the property of others as the result of\nany one accident, and in the sum of not less than Four Hundred Thousand Dollars ($400,000.00) for damages for or on\naccount of any bodily injury to or death of all persons and for damages to the property of others.\nSection 11-7.  Suspension or revocation of license.\nIn addition to the penalties set forth in Section 11-13 of the Code of Ordinances, violation of either Section 11-5 or 11-6 shall\nbe grounds for suspension or revocation of the license to transport municipal solid waste.  Any person suspected of such\nviolation shall be provided a written notice of the alleged violation by the City Clerk, which notice shall advise the licensee\nof the date and time of the hearing on said violation.  The City Clerk shall hold a hearing on the alleged violation on the\ndate and time set in the notice, at which the licensee shall be present.  Should the City Clerk find that a violation has\noccurred, she/he shall suspend or revoke the license to transport municipal solid waste.\nSection 11-8.  Storage and placement of municipal solid waste.\n(1)  All municipal solid waste accumulated for collection and disposal shall be placed in a leak proof metal or plastic\ncontainer.  Grass clippings, tree trimmings and other similar vegetative waste shall be likewise kept in a metal or plastic\ncontainer or boxed or bagged except that tree trimmings need not be kept in a container, box or bag, provided they are cut\ninto strips of no greater than three feet in length and piled or stacked neatly.  All municipal solid waste containers shall be\nkept free of rodents, insects, bugs and other vectors.  Placement of all containers for the accumulation of municipal solid\nwaste shall be on private property except that such containers may be placed on public property fronting the residences or\nplace of business where such municipal solid waste is generated or accumulated for convenience on such day that the\nmunicipal solid waste is collected for disposal.  Such placement shall not create an obstruction to the proper passage of\nvehicles or pedestrians. Once such municipal solid waste is collected, such container(s) shall be promptly replaced on\nprivate property.\n(2)  Municipal solid waste accumulated for collection and disposal by a duly licensed contractor or\nmunicipal solid waste collection operator shall be so collected and disposed of no less frequently than once per week.\nSection 11-9.  Scattering of municipal solid waste.\nNo person shall cast, place, sweep, or deposit anywhere within the City any municipal solid waste in any manner, that may\nresult in such municipal solid waste being carried or deposited by the elements upon any street, sidewalk, alley, sewer,\nparkway or other public place or place any solid waste in any trash receptacle either owned by another or provided for use\nand benefit of another by a private hauler of solid waste.\nSection 11-10. Accumulation and use of manure.\nIt shall be unlawful for any owner, occupant or agent of property to keep any manure for any purpose other than to spread\nit lightly on lawns or gardens for fertilizing purposes.\nSection 11-11. Burning of municipal solid waste.\nIt shall be unlawful for any person to set fire to or burn any garbage, rubbish or waste material or any hay, grass clippings\nor any other combustible materials, including waste paper, in any receptacle or upon the ground.\nSection 11-12. City Landfill fees. (Repealed and re-enacted, Ord. 3002, eff. 8-14-20)\n(1)  Fees assessed for the disposal of garbage, trash, and tire carcasses, and all other types of acceptable refuse at the\nTrinidad Landfill shall be at the following rates for each delivery:\n(a) General Customers\n(I) Municipal Solid Waste, $27.00 per ton with a minimum of $10.00\n(II) Construction waste, $31.00 per ton\n(III) Yard waste, $31.00 per ton with a minimum of $10.00\n(IV) Five dollars ($5.00) per container of waste material not to exceed thirty-five (35) gallons in volume\n(b) Licensed Commercial haulers\n(I) Typical Municipal Solid Waste, $22.00 per ton\n(II) Construction waste, $25.00 per ton\n(c) Special waste shall not be subject to the rate set forth in subsection (a) or (b), but instead shall be subject to the\nfollowing rates:\n(I) Special wastes such as contaminated soil,\nsand trap waste, non-friable asbestos, and other\nsimilar wastes which require additional\nhandling by landfill personnel\nDisposal fee\n$35.00 per ton minimum fee, special\nnegotiation may be required\n(II) Passenger car tires and light truck tires up to\nand including a 16 ½” wheel size\n$4.00 per tire\n(III) Medium duty and heavy duty truck tires\nranging in size larger than a 16 ½” wheel up to\nand including a 22 ½” wheel\n$6.00 per tire\n(IV) All tires sizes larger than a 22 ½” wheel up\nto and including heavy equipment tires\n$20.00 per tire\n(V) Upholstered furniture (sofas, loveseats\nchairs, couches, ottomans, mattresses and box\nsprings)\n$5.00 each\n(2) All fees in this ordinance are hereby effective on and after September 1, 2020.\n(3) Such fees shall be in effect and charged at drop off for individual customers to a credit or debit card. However\ncustomers of City utilities who present a current bill will be allowed to charge the amount due to their utility bill. No\nindividual will be allowed to charge amount due to someone else’s utility account unless prior arrangements have been\nmade. Customers may also pre-pay at the City Utility Billing Office on the first floor of City Hall at 135 N. Animas Street.\n(4) All garbage, rubbish, or other municipal waste material under the control of the City at the City landfill, shall be the\nproperty of the City, and it shall be unlawful for any person to enter upon such sites, or carry off, dispose of, burn or in any\nmanner disturb or molest any matter or item deposited or existing upon such sites, except under the direction or authority\nof the Public Works Director or his/her designee.\n(5) All vehicles hauling municipal waste for disposal at the landfill shall be enclosed or tarped. Any person who does not\ncomply with this requirement shall be assessed a double charge for disposal of his/her load. \nSection 11-13.      Penalty for violation.\nAny person convicted of violating any provisions of this Article shall be punished by a fine not to exceed Three Hundred\nDollars ($300.00) or by imprisonment not to exceed ninety (90) days.  (Ord. 1441, 11/17/92.)\n"}