{"Chapter 4 - [Title from PDF Content]": "Chapter 4 - Animals\nARTICLE 1.  GENERAL PROVISIONS.\nSections:\n4-1                         Butchering unlawful and a nuisance; exception.\n4-2                         Cruelty to animals.\n4-2-1                      Tethering and penning.\n4-3                         Keeping hogs in City.\n4-4                         Fowl not to run at large.\n4-5                         Animals not to run at large.\n4-6                         Offensive pens - Nuisance.\n4-7                         Keeping of noisy and odoriferous poultry.\n4-8                         Penalty for violation.\n4-9                         Release of impounded animal without authority.\nARTICLE 2.  IMPOUNDING.\n4-10                       Animals running at large to be impounded.\n4-11                       Disposition of impounded animals.\n4-12                       Impoundment fees; claiming impounded animal.\nARTICLE 3.  DOGS AND CATS.\n4-13                       Definitions.\n4-14                       License and registration required; fees.\n4-15                       Tag and Collar.\n4-16                       Vaccination.\n4-17                       Confinement of dogs and cats biting persons or suspected of being rabid; procedure.\n4-18                       Dogs running at large.\n4-19                       REPEALED\n4-20                       Liability of owner.\n4-21                       Impounding dogs.\n4-22                       Notice to owner and period of impoundment.\n4-23                       Disposition of impounded dogs and cats.\n4-24                       Keeping of vicious dogs prohibited.\n4-25                       Definitions.\n4-26                       Unlawful conduct.\n4-27                       Investigation and Complaints.\n4-28                       Citations, Orders & Impoundment.\n4-29                       Penalty-Fines.\nCHAPTER 4.  ANIMALS\nARTICLE 1.  GENERAL PROVISIONS.\nSection 4-1.          Butchering unlawful and a nuisance; exception.\n(1)  It shall be unlawful for any person to kill or dress any cow, calf, sheep, hog or goat or to steam or render any tallow or\nlard, except for his/her own use or consumption.\n(2)  Any person who violates this section shall be deemed guilty of maintaining a nuisance.  (Ord. 1958, Sec. 4-1.)\nSection 4-2.          Cruelty to animals.\n\nIt shall be unlawful for any person to commit cruelty to animals.  A person commits cruelty to animals if, except as\nauthorized by law, he/she knowingly over drives, overloads, overworks, tortures, torments, deprives of necessary\nsustenance unnecessarily or cruelly beats, needlessly mutilates, needlessly kills, carries in or upon any vehicles in a cruel\nmanner, or otherwise mistreats or neglects any animal, or causes or procures it to be done, or, having the charge and\ncustody of any animal, fails to provide it with proper food, drink or protection from the weather or abandons it.  Any\nperson who violates this Section shall be subject to the penalty set forth in Section 1-8 of the Code of Ordinances.\nSection 4-2-1.          Tethering and penning.\nIt is a violation for any owner or keeper of an animal to:\n(1)       Keep any animal on a permanent tether that restricts movement of the tethered animal to an area less than one\nhundred forty-four square feet (144 sq. ft.), or less than a twelve foot (12’) radius at ground level.\n(2)       Tether an animal with a choke-type collar or prong-type collar.\n(3)       Keep any animal tethered for more than four (4) hours during a twenty-four (24) hour period or keep any animal\nconfined in an outdoor pen, or cage without appropriate shelter for more than four (4) hours during any twenty-four (24)\nhour period.\n(4)       Keep any animal tethered without appropriate shelter at all times from the weather or for any duration when\noutdoor conditions (extreme heat, cold, wind, rain, snow or hail) pose an adverse risk to the health or safety of the animal.\n(5)       Keep any animal tethered with a tether that has weights attached or that contains metal chain links more than one-\nquarter of an inch thick.\n(6)       Provide an inappropriately sized shelter for the animal, defined as a structure with a roof and sufficient ventilation\nwhile providing the animal ability to maintain body heat in cold months and ability to dissipate heat in warm months.\n(7)       Tether an animal so as to restrict its access to suitable and sufficient clean water and food.\n(8)       Tether an animal in a manner that allows it to become entangled with the tether or other object that restricts its\nmovement.\n(9)       No person owning or keeping any animal shall subject the animal to cruel conditions or inhumane chaining or\ntethering at any time (ie., exposure to filth, taunting or harassing,  or subjecting it to dangerous conditions).\n(10)     Cage, pen, or kennel an animal in a confinement with sidewalls less than four (4) feet nor provide a floor area less\nthan 24 square feet per animal or a length less than three times the length of the animal, whichever is greater.\nAny person who violates this Section shall be subject to the penalty set forth in Section 1-8 of the Code of Ordinances.\n(Ord. 2048, Sec. 4-2-1 enacted, eff. 12-01-17)\nSection 4-3.          Keeping hogs in the City.\nIt shall be unlawful for any person to keep hogs or pigs within the City, except as follows.  Any person may keep what is\ncommonly known as a Miniature Pot-Bellied Pig within any zone district within the City in which domestic animals are\npermitted.\nSection 4-4.    Fowl not to run at large.\nIt shall be unlawful for any owner or keeper of chickens, ducks, geese or other like fowl to permit them at any time to run\nat large within the City.  (Ord. 1958, Sec. 4-10.)\nSection 4-5.    Animals not to run at large.\nIt shall be unlawful for any owner or keeper of horses, asses, mules, cattle, sheep, goats and swine to permit them to run at\nlarge within the City.  (Ord. 1958, Sec. 4-13.)\nSection 4-6.    Offensive pens - Nuisance.\nIt shall be unlawful for any person after notice to abate by a City officer, to permit or maintain any pen, place or premises\nin or upon which animals are kept so as to be offensive or any annoyance to any person.  All such places are declared to be\na nuisance.  (Ord. 1958, Sec. 4-6.)\nSection 4-7.    Keeping of noisy and odoriferous poultry.\nIt shall be unlawful and a nuisance for any person to knowingly keep, maintain or permit to remain, under his/her control,\nupon any lot or parcel of land in the City, any poultry or fowl, or any creature which by any persistent or pertinacious\nnoise, sound or outcry, or by the creation or causing of offensive odors, shall disturb the peace or comfort of any\nneighborhood or interfere with any person in the reasonable and comfortable enjoyment of life or property, and such\nconditions shall be abated upon the order of the City Manager or any other authorized official of the City.\nSection 4-8.   Penalty for violation.\nAny person who knowingly violates any of the provisions of this Article shall be deemed guilty of a misdemeanor and upon\nconviction thereof shall be subject to the penalties provided in Section 1-8 of this Code.\nSection 4-9.   Release of impounded animal without authority.\nIt shall be unlawful for any person to release or attempt to release any animal that has been impounded, from the custody\nof any animal control officer or police officer of the City, or from the City's Animal Shelter, transport vehicle or cages or\ntraps set in the field, by opening the gate of the Animal Shelter, tearing down the fence or enclosure, or in any other\nmanner without the consent of the person in charge thereof.\nARTICLE 2.  IMPOUNDING.\nSection 4-10.        Animals running at large to be impounded; notice of sale.\nAny animal control officer or police officer shall impound at the City's Animal Shelter any of the animals listed in Sections\n4-4 or 4-5 of this Code, found running at large.  Where livestock is so impounded, the State Brand Inspector shall be\nnotified as soon as practicable of such impoundment.\nSection 4-11.  Disposition of impounded animals. (Ord. 1942, Sec. 4-11 repealed and reenacted, eff.\n8/16/13)\n(1)       Disposition of impounded livestock shall be in accordance with State statutes and regulations and at the direction of\nthe State Brand Inspector.\n(2)       The following procedures shall be followed with respect to the disposal of all other animals impounded pursuant to\nthis Article:  No such animal shall be put up for adoption or humanely destroyed unless the ownership of such animal\ncannot be ascertained or at least ten (10) days have elapsed since written notice of impoundment has been issued to the\nowners.  Said notice shall advise the owner as to where the animal was impounded, the date and time of the impoundment,\nthe location where the animal is being held, a description of the animal, that the animal must be claimed within ten (10)\ndays of the issuance of the notice, and the impound fee and feeding costs to be paid prior to the release of the animal to the\nowner.  Said notice shall be either mailed by certified mail to the owner’s last known address or hand delivered to the\nowner.\nSection 4-12.  Impoundment fees; claiming impounded animal. (Ord. 1942, Sec. 4-12 repealed and\nreenacted, eff. 8/16/13)\nThe owner of any animal impounded pursuant to this Article shall be charged Ten Dollars ($10.00) per day for boarding\nand feeding of said animal.  If the owner of the impounded animal shall claim such animal within the ten (10) day period\nspecified in the notice and pay all costs then accrued for impounding and feeding, plus a Fifteen Dollar ($15.00)\nredemption fee, the animal shall be released to the owner; except that in the case of livestock, the owner may be required\nby the State Brand Inspector to pay the cost of transporting the animal to the Animal Shelter before the animal is released.\nARTICLE 3.  DOGS AND CATS.\nSection 4-13.        Definitions.\nAs used herein:\n(1) Animal control Officer shall mean the person employed by the City Manager as being responsible for control of animals\nby the City.\n(2) Dog shall mean an animal of canine species, male or female.\n(3) Female dog shall mean a dog of the female sex.\n(4) Male dog shall mean a dog of the male sex.\n(5) Owner or owns means any person, firm, corporation, or organization owning, possessing, harboring, keeping, having\nfinancial or property interest in, or having control or custody of a domestic animal (meaning any dog, cat, any animal kept\nas a household pet, or livestock), including a dangerous dog as the term is defined in Section 4-24 of this Article 3.  (Ord.\n1942, Sec 4-13(5), amended eff. 8/16/13)\n(6) Spayed female dog shall mean a dog of the female sex upon which surgery has been performed to make her incapable\nof reproduction.\n(7) Bodily injury means any physical injury that results in bruising, muscle tears, or skin lacerations requiring, or that\ncould require, professional medical treatment or any physical injury that requires or could require corrective or cosmetic\nsurgery.  (Ord. 1942, Sec 4-13(7), eff. 8/16/13)\n(8) Serious bodily injury means bodily injury which, either at the time of the actual injury or at a later time, involves a\nsubstantial risk of death, a substantial risk of serious permanent disfigurement, a substantial risk of protracted loss or\nimpairment of the function or any part or organ of the body, or breaks or fractures. (Ord. 1942, Sec 4-13(8), eff. 8/16/13)\nSection 4-14. License and registration required; fees.\n(1) All dogs and/or cats kept, harbored and maintained by their owners, except as provided in Subsection (4) hereof, shall\nbe licensed and registered annually, and each owner shall pay to Noah’s Ark Animal Welfare Association for its use and\nbenefit, the following license fees:\n(a) Female dogs (unspayed) and male dogs (Unneutered)------$15.00\n(b) Male dogs (neutered) and female dogs (spayed)-------------$  8.00\n(c) Cats------------------------------------------------------------------$ 3.00\n(2) All license fees shall be due and payable not later than the 15th day of January of the ensuing year.\n(3) The owner shall state at the time application is made for license, and upon printed forms provided for such purpose,\nhis/her name and address, and the name, breed, color and sex of each dog and/or cat owned or kept by him/her.\n(4) All dogs and/or cats over four (4) months old shall be licensed as herein provided, within ten (10) days after their\nacquisition or purchase by the owner or after their arrival in the City. (Ord. 1978, Sec. 4-14, repealed and reenacted, eff. 6-\n2-15)\nSection 4-15. Tag and collar.\n(1) A license tag will be furnished by Noah’s Ark Animal Welfare Association upon receipt of the application, together with\na certificate from a veterinarian licensed to practice veterinary\nmedicine in this State, unless the same has been waived as provided in Section 4-16, that the dog and/or cat has a\ncertificate of rabies vaccination that is valid until the end of the year, together with the payment of the required fee. Every\nowner shall be required to provide each dog and/or cat with a collar to which the license tag must be affixed, and shall see\nthat the collar and tag are constantly worn.\n(2) In case a dog and/or cat tag is lost or destroyed, a duplicate will be issued by Noah’s Ark Animal Welfare Association\nupon presentation of a receipt showing the payment of the license fee for the current year and the payment of a Two\nDollars ($2.00) fee for the issuance of the duplicate tag.\n(3) Dog and/or cat tags shall not be transferable from one dog and/or cat to another and no refund shall be made on any\ndog and/or cat license fee because of the death of the dog and/or cat or the owner leaving the City before the expiration of\nthe license. (Ord. 1978, Sec. 4-15, repealed and reenacted, eff. 6-2-15)\nSection 4-16. Vaccination.\n(1) Each dog and/or cat shall be vaccinated against rabies and such vaccination shall be repeated as determined by the\nveterinarian administering the original vaccination. A certificate of vaccination shall be completed in duplicate by the\nveterinarian, and one (1) copy retained in the veterinarian's file. In the event the dog and/or cat is not of age to be properly\nvaccinated, the vaccination shall be waived therein and a certificate delivered to Noah’s Ark Animal Welfare Association.\n(2) No dog and/or cat shall be licensed as provided in Section 4-14 unless a valid certificate of rabies vaccination\naccompanies the application for the license. (Ord. 1978, Sec. 4-16, repealed and reenacted, eff. 6-2-15)\nSection 4-17.        Confinement of dogs and cats biting persons or suspected of being rabid; procedure.\n(1)  The owner of any dog or cat that has bitten any person shall immediately advise the Supervising Animal Control\nOfficer of this fact.  Any dog or cat that has bitten any person or has been exposed to another animal that is believed to\nhave rabies, shall be immediately confined for a period of ten (10) days or for a longer period, at the discretion of the\nAnimal Control Officer.  No owner of any dog or cat that has bitten any person or that has been exposed to another animal\nthat is believed to have rabies, shall destroy such animal before it can be properly confined by the Supervising Animal\nControl Officer.  Such confinement may be on the premises of the owner, if deemed appropriate in the discretion of the\nSupervising Animal Control Officer, but it must be within the City for a minimum of ten (10) days.  If the dog or cat is not\nconfined on the premises, the confinement shall be at the City Animal Shelter or any veterinary hospital of the owner's\nchoice.  Such confinement shall be at the expense of the owner.  Stray dogs whose owners cannot be located shall be\nconfined in the City Animal Shelter.\n(2)  No person knowing or suspecting a dog or cat has rabies shall allow such dog or cat to be taken off his/her premises or\nbeyond the limits of the City without the written permission of the Animal Control Officer.  Every owner, or other person\nupon ascertaining a dog or cat is rabid, shall immediately notify the Animal Control Officer or a police officer, who shall\nremove the dog or cat to the Animal Shelter for observation, or follow the procedure as provided for in Subsection (1)\nhereof.\nSection 4-18. Dogs running at large.\nNo owner or person in possession of any dog shall permit the same to run at large within the City, and all\ndogs shall be confined to the immediate premises of the owner or person in possession of the dog, except\nwhen:\nRestrained by a leash, chain, rope, cord or other device physically attached to the collar of the dog, which\nkeeps the dog under the absolute control of the owner or person in possession of the dog;\nWithin public places where it is clearly posted by the City that no leash is required. (Ord. 3065, Sec. 4-18,\namended, eff. 3/3/23)\nSection 4-19.        REPEALED (Ord. 1992, eff. 10/16/15)\nSection 4-20. Liability of owner. (Ord. 1732, Sec 4-20, amended eff. 8/29/03)\nThe owner of any dog shall comply with the following conditions:\n(1)  Shall not allow said dog to obstruct or interfere with any pedestrian or motor vehicle upon any public way or the\nentrance of any building or upon any public area.\n(2)  Shall keep and maintain said dog so that it does not, by noise or other activities, injure or interfere with the rights of\nother persons.\n(3)  Shall commit no cruel or inhumane action against said dog.\n(4)  Shall be liable and responsible for said dog at all times, whether it is on or off the owner's premises.\n(5) Shall not feed stray/homeless dog(s) without taking full responsibility for the dog(s) by providing the dog(s) with\ncontinued humane treatment which shall include proper food, water, shelter, veterinarian care, rabies vaccination, and\nalter the dog(s).  Any person who feeds stray dogs must follow the regulations by the city in reference to licensing and\nvaccination.\n(6) It is unlawful for any owner, or temporary owner, to own a pair of dogs of opposite sex of breeding age without one or\nboth of the dogs being altered even if not allowed to roam at large, with the exception of licensed pet stores, veterinary\nclinics, and animal shelters.\n(7) It is unlawful for any person to offer for sale or for free any dog(s) six (6) months of age or older without the dog(s)\nbeing altered, with the exception of pet stores with a current city business license and animal shelters.\n(8) It is unlawful for any person to own any number of unaltered dogs of the opposite sex and of breeding age (six months\nof age or older), with the exception of pet stores with a current city business license and animal shelters.\n(9) It is unlawful for any person who is the owner, or other person in possession, of a dog to permit such dog to cause\nannoyance in any neighborhood in the City by damage any lawn, garden, shrubbery, or any property of another at any\ntime, or in any other way to create a nuisance on the property of another, including the discharge of deposit of feces or\nother waste matter.\n(10) It is unlawful for a person to own, keep or harbor more than three dogs in any residence or provided establishment\nwithin the city.  Within thirty (30) days of enactment of this ordinance, any dog owner who altered and licensed his or her\ndogs in excess of three can continue to own, keep or harbor such dogs in excess of three.  Any owner who has in excess of\nthree dogs and complies with this sub-section cannot replace any dog in excess of three if any of the dogs dies or goes\nmissing.  It is the owner’s responsibility to provide written documentation of the altering and licensing of the dogs.\nSection 4-21.        Impounding dogs.\nThe Animal Control Officer or any police officer may catch and impound any dog that is not wearing a proper license as\nherein provided, that is not under proper control or confined to the owner's premises as herein provided or is in violation\nof any Section of this Article, in the Animal Shelter, provided, however, that if any dog cannot be safely caught and\nimpounded because of its dangerous or vicious propensities, such dog may be slain.\nSection 4-22.        Notice to owner and period of impounding. (Ord. 1762, Sec 4-22 amended eff. 10/15/04)\n(1)  Any dog or cat which has been impounded at the Animal Shelter pursuant to this Article, and whose owner cannot be\nascertained, shall be held at least seventy-two (72) hours before said dog or cat is disposed of by adoption or by humane\ndestruction.  No notice shall be required prior to disposition of said dog or cat.\n(2) Any dog or cat which has been impounded at the Animal Shelter pursuant to this Article, and whose owner is\nascertained, shall not be disposed of by adoption or humane destruction until at least ten (10) days after notice of\nimpoundment has been issued to the owner.  Said notice shall advise the owner as to where the dog or cat was impounded,\nthe date and time of the impoundment, the location where the dog or cat is being held, a description of the dog or cat, that\nthe dog or cat must be claimed within ten (10) days of the issuance of the notice, and the impoundment fee to be paid, and\nany vaccination and/or licensing requirements which must be met prior to the release of the dog or cat to the owner.   Said\nnotice shall be mailed by certified mail to the owner at the owner’s last known address or hand delivered to the owner.  \n(Ord. 1942, Sec. 4-22(2) repealed and reenacted, eff. 8/16/13)\n(3) Any dog that has been impounded at the Animal Shelter pursuant to a summons and complaint under Section 4-24\n“Keeping of vicious dogs prohibited” shall be held indefinitely.  The dog may be released pending the resolution of the\nsummons and complaint if the owner of the dog has shown cause to the Municipal Judge as to why the dog should be\nreleased.  The owner of the dog must establish to the Municipal Judge facts that show that the owner has taken steps to\nconfine, restrain, or properly supervise the dog before the dog is released to the owner pending resolution of the summons\nand complaint.\nSection 4-23.  Disposition of impounded dogs and cats. (Ord. 1523, Sec. 4-23 repealed and reenacted 12/5/95)\nAny owner may redeem a dog or cat being held at the Animal Shelter upon proof of ownership thereof and the payment of\na care and maintenance fee of Eight Dollars ($8.00) per day or any portion of a day that the dog or cat is maintained at the\nAnimal Shelter or any greater fee that might be charged by a veterinarian for the impounding of such dog or cat, a\ntranquilization fee of Ten Dollars ($10.00) where it has been necessary to tranquilize such dog or cat in order to impound\nit, and payment of a redemption fee of Fifteen Dollars ($15.00), subject to the provisions of Section 4-17 and vaccination\nand/or licensing requirements.\nSection 4-24.    Keeping of dangerous dogs prohibited. (Ord. 1924, Sec. 4-24 repealed and reenacted, eff.\n8/16/13)\n(1)       It shall be unlawful for any person to own, keep, harbor or possess a dangerous dog anywhere in the City.\n(2)       As used in this section, unless the context otherwise requires:\n(a)       Dangerous dog means any dog that:\n(I)        Inflicts bodily or serious bodily injury upon, or causes the death of a person or domestic animal; or\n(II)       Engages in or is trained for animal fighting as described and prohibited in C.R.S. 18-9-204; or\n(III)      Demonstrates tendencies that would cause a reasonable person to believe that the dog may inflict\nbodily or serious bodily injury upon, or cause the death of any person or domestic animal.\n(IV)     Such dog shall not be deemed to be a dangerous dog under the following circumstances where such dog\nhas bitten or attacked under the following circumstances:\n(a)       Any person engaged in the unlawful entry into or upon the dog owner’s property where such dog is\nkept;\n(b)       Any person engaged in the unlawful entry upon the dog owner’s automobile or any vehicle wherein\nsuch dog is confined, or which is parked on the street immediately adjacent to the owner’s property;\n(c)       Any person engaged in attacking or molesting another person;\n(d)       Any person engaged in attempting to stop an altercation between such dog and another dog;\n(e)       Any person who deliberately and wantonly provokes such dog to bite or attack such person,\nanother person or another animal.  (Ord. 2035, Sec. 4-24(2)(a) repealed and reenacted, eff. 7/28/17)\n \n(3) Any person who knowingly violates any of the provisions of this section shall be deemed guilty of a\nmisdemeanor and upon conviction thereof shall be subject to the penalties provided in Section 1-8 of this\nCode.  (Ord. 3064, Sec. 4-24(3), amended, eff. 3/3/23)\nSection 4-25.        Definitions (Ord. 1732, Sec 4-25 repealed and reenacted eff. 8/29/03)\nDefinitions. As used in this chapter unless the context otherwise indicates, the following terms shall have the meaning\nascribed to each:\n(1) “Altered” means any animal that has been sprayed or neutered.\n(2)   “Animal Shelter” means an animal shelter operated by city or county government or a shelter operated by a non-profit\norganization organized to benefit animals.\n(3) “Cat” means any commonly domesticated feline animal and includes both the male and female sex of the species.\n(4) “Free Roaming” means any cat that is allowed or that is able to leave the property of the owner at will.\n(5) “Nuisance Cat” means any cat that is allowed to free roam and is not altered.\n(6) “Owner” means an adult person or custodian possessing, harboring, keeping, feeding or having control or custody of a\ncat or any person having any financial interest, right, or property in the cat and also includes any person who permits a\ncat(s) to remain on or about any premises occupied by that person.\n(7) “Temporary Owner” means an adult person or custodian who harbors an animal with the knowledge and consent of the\nowner who is temporarily unable to care for the animal because of absence or indisposition.  An animal is deemed to be\nharbored if it is sheltered and/or fed.  A temporary owner shall be responsible for any violations of this chapter and shall\npay fines or fees charged as a result of any violation.\nSection 4-26.        Unlawful conduct.\n(1) It is unlawful for the owner, or temporary owner, of any cat(s) to allow it to be a nuisance cat(s). (Ord. 1732, eff., 8-29-\n03)\n(2) It is unlawful for any person to feed stray/homeless cat(s) without taking full responsibility for the cat(s) by providing\nthe cat(s) with continued humane treatment which shall include proper food, water, shelter, veterinarian care, rabies\nvaccination, and alter the cat(s).  Any person who feeds stray cats must follow the regulations by the city in reference to\nlicensing and vaccination. (Ord. 1732, eff., 8-29-03)\n(3) It is unlawful for any owner, or temporary owner, to own a pair of cats of opposite sex of breeding age without one or\nboth of the cats being altered even if not allowed to free roam, with the exception of licensed pet stores, veterinary clinics,\nand animal shelters. (Ord. 1732, eff., 8-29-03)\n(4) It is unlawful for any person to offer for sale or for free any cat(s) six (6) months of age or older without the cat(s) being\naltered, with the exception of pet stores with a current city business license and animal shelters. (Ord. 1732, eff., 8-29-03)\n(5) It is unlawful for any person to own any number of unaltered cats of the opposite sex and of breeding age (six months\nof age or older), with the exception of pet stores with a current city business license and animal shelters. (Ord. 1732, eff., 8-\n29-03)\n(6) It is unlawful for any person who is the owner, or other person in possession, of a cat to permit such cat to cause\nannoyance in any neighborhood in the City by any loud or unusual noise, or to damage any lawn, garden, shrubbery, or\nany property of another at any time, or in any other way to create a nuisance on the property of another, including the\ndischarge or deposit of feces or other waste matter. (Ord. 1732, eff., 8-29-03)\n(7) It is unlawful for a person to own, keep or harbor more than three cats in any residence or provided establishment\nwithin the city.  Within thirty (30) days of enactment of this ordinance, any cat owner who altered and licensed his or her\ncats in excess of three can continue to own, keep or harbor such cats in excess of three.  Any owner who has in excess of\nthree cats and complies with this sub-section cannot replace any cat in excess of three if any of the cats dies or goes\nmissing.  It is the owner’s responsibility to provide written documentation of the altering and licensing of the cats. (Ord.\n1732, eff., 8-29-03)\n(8) It is unlawful for a person to own, keep or harbor a cat or cats that have not been vaccinated pursuant to Section 4-16.\n(Ord. 1732, eff., 8-29-03)\nSection 4-27         Investigation and Complaints.\n(1) Upon receipt of a complaint by one or more persons alleging the presence of possible nuisance cat(s), the name of the\nowner of the animal, the address of the owner, and the description of the suspected cat(s), an animal control officer may\ninvestigate the complaint to determine if in fact the animal is a nuisance cat. (Ord. 1732, eff., 8-29-03)\n(2) Persons bothered by a nuisance cat may humanely trap the cat(s) on complainant’s property.  Complainants, after\nmaking prior arrangements, may deliver the cat to the animal control shelter.  Humane traps will be available at animal\ncontrol for a nominal fee and/or refundable deposit.  Persons using animal control traps shall be provided instructions\nregarding use of humane traps. (Ord. 1732, eff., 8-29-03)\nSection 4-28         Citations, Orders & Impoundment.\n(1) The department shall order the owner of a nuisance cat or dog running at large or vicious dog to have the animal\naltered at the owner’s expense, or if there is only one cat owned, order the owner to prevent the cat from free roaming.\n(Ord. 1732, eff., 8-29-03)\n(2) A citation or order may be issued to the owner or temporary owner of a cat for failure to comply with any applicable\nsection of this chapter. (Ord. 1732, eff., 8-29-03)\n(3) Animal control may set humane traps, resulting from complaints, where free roaming nuisance cat(s) are suspected\nand a secure trapping site is available. (Ord. 1732, eff., 8-29-03)\n(4) Free roaming cats may be impounded at the city-county animal control shelter. (Ord. 1732, eff., 8-29-03)\n(5) Any unaltered cat that is impounded shall be spayed or neutered at the owner’s expense and all impound fees, board\nfees, etc., paid before it can be reclaimed from the shelter.  Animal control shall transport the cat to owner’s choice of\nveterinarian clinics within the city limits. (Ord. 1732, eff., 8-29-03)\nSection 4-29 Penalty for violation. (Ord. 1903, Sec. 4-29 repealed and reenacted, eff. 9/17/10)\n(1)  An owner or temporary owner who violates any of the provisions of this Article shall be deemed guilty of a\nmisdemeanor and, upon conviction thereof, shall be subject to the assessment of a fine in accordance with this Section.  No\njail time shall be imposed for any violation of this Article.\n(2)  An owner or temporary owner who is found guilty of a first offense of any violation of this Article, other than a\nviolation addressed in subsection (3) below, shall be fined an amount of not less than Thirty Dollars ($30.00), plus an\nincrement of Twenty-Five Dollars ($25.00) for each additional offense occurring within a twelve (12) month period.\n(3)  An owner or temporary owner who fails to license and register his or her dog(s) or cat(s) or fails to vaccinate the dog(s)\nor cat(s) shall be fined an amount of Twenty Dollars ($20.00).\n", "Chapter 5 - [Title from PDF Content]": "Chapter 5 - Buildings\nARTICLE 1. IN GENERAL.\nSections:\n5-1.    International Building Code.\n5-2.    International Residential Code.\n5-3.    Reserved.\n5-4.    International Mechanical Code.\n5-5.    International Fuel Gas Code.\n5-6.    International Energy Conservation Code.\n5-7.    International Existing Building Code.\n5-8.    International Property Maintenance Code.\n5-9.    Reserved.\nARTICLE 2.  CONTRACTOR LICENSING.\n5-10.   Definitions, Classifications and Fees.\n5-11.   Testing.\n5-12.   Insurance Requirements.\n5-13.   Duties and Responsibilities of Licensee.\n5-14.   Suspension and Revocation of License.\n5-15.   Application Form and Contents.\n5-16 – 5-22  Reserved.\nARTICLE 3.  NON-CONFORMANCE\n5-23.        Reserved.\nARTICLE 4.  MEANS OF APPEAL\n5-24.        Board of Building Code Appeals and Means of Appeal.\n5-25.        Building Code Variance Petition.\nARTICLE 5.  VACANT PROPERTY REGISTRATION\n5-25.        Title, purpose and intent.\n5-26.        Definitions.\n5-27.        Registration required.\n5-28.        Fees.\n5-29.        Property maintenance obligations.\n5-30.        Inspections.\n5-31.        Unlawful conduct; penalties; enforcement.\n5-32.        Joint and several liability.\n5-33 – 5-44. Reserved.\nARTICLE 5.  ANTI-DILAPIDATION CODE\n5-45.        Title, purpose and intent.\n5-46.        Definitions.\n5-47.        Dilapidated Buildings.\n5-48.        Inspections.\n5-49.        Dilapidated Buildings prohibited.\n5-50.        Violations; penalties; enforcement.\n5-51 – 5-54. Reserved.\nARTICLE 6. - ADMINISTRATIVE ENFORCEMENT\n5-55.        Purpose.\n5-56.        Definitions.\n5-57.        Notice of violation.\n5-58.        Administrative citations – general provisions.\n5-59.        Issuance of administrative citation.\n5-60.        Administrative citation – contents.\n5-61.        Appeals – notice and scheduling.\n5-62.        Conduct of appeals hearings.\n5-63.        Failure to obey subpoena.\n\nSchedule of Permit Fees\nTotal Valuation:\nFee:\n$1.00 to $500.00\n$24.00\n$501.00 to\n$2,000.00\n$24.00 for the first $500.00; plus $3.00 for each additional $100.00 or\nfraction thereof, to and including $2,000.00\n$2,001.00 to\n$40,000.00\n$69.00 for the first $2,000.00; plus $11.00 for each additional $1,000.00\nor fraction thereof, to and including $40,000.00\n$40,001.00 to\n$100,000.00\n$487.00 for the first $40,000.00; plus $9.00 for each additional\n$1,000.00 or fraction thereof, to and including $100,000.00\n$100,001.00 to\n$500,000.00\n$1,027.00 for the first $100,000.00; plus $7.00 for each additional\n$1,000.00 or fraction thereof, to and including $500,000.00\n$500,001.00 to\n$1,000,000.00\n$3,827.00 for the first $500,000.00; plus $5.00 for each additional\n$1,000.00 or fraction thereof, to and including $1,000,000.00\n$1,000,001.00 to\n$5,000,000.00\n$6,327.00 for the first $1,000,000.00; plus $3.00 for each additional\n$1,000.00 or fraction thereof, to and including $5,000,000.00\n$5,000,001.00 and\nup\n$18,327 for the first $5,000,000.00; plus $1.00 for each additional\n$1,000.00 or fraction thereof\nOther Inspections and Fees:\n1. Plan review fee......................Sixty five percent (65%) of the permit fee2. \n2. Inspections outside of normal business hours.............  $50.00 per hour* (Minimum charge –\ntwo hours)\n3.  Reinspection fees assessed under provisions of IBC § 108.4..........................  $50.00 per hour*\n4.  Inspections for which no fee is specifically indicated............................  $50.00 per hour*\n5.  Additional plan review required by changes, additions, or revisions to plans\n……..............$50.00 per hour*\n6.  For use of outside consultants for plan checking and inspections, or both..... …….......…...……\nActual Cost**\n7.  For issuance of each temporary Certificate of Occupancy ................................$750.00***\n8.  Administrative Fees...........................  $150.00 min  ($50.00 per hour thereafter)\nNOTATION:  Reference City of Trinidad Municipal Code Chapter 7, Article 3, Section 7-23\nregarding imposition of Use Tax.\n5-64.        Failure to attend administrative appeal.\n5-65.        Failure to comply with administrative enforcement order.\n5-66.        Penalties assessed.\n5-67.        Failure to pay fines.\nCHAPTER 5.  BUILDINGS\n(Ord. 1949, Chapter 5, repealed and reenacted eff. 12/17/13)\nARTICLE 1.  IN GENERAL.\n(Ord. 2061, Article 1, repealed and reenacted eff. 7-13-18)\nSection 5-1.  International Building Code.\n1. The International Building Code, 2018 Edition, including Appendix Chapter C\n(“Group U Agricultural Buildings”) and J (\"Grading\"), as published by the International Code Council, 500 New Jersey\nAvenue, NW, 6th Floor, Washington, DC 20001 (headquarters), is hereby adopted by reference as the Building Code of the\nCity of Trinidad, Colorado, as if fully set forth in this ordinance, together with the additions, insertions, and changes\nprescribed in this Section. At least one (1) copy of said International Building Code, 2018 Edition, shall remain on file in\nthe Office of the City Clerk and open to public inspection.\n2. The following sections of the International Building Code, 2018 Edition (\"IBC\"), are hereby revised:\na. Amend IBC § 101.1, Title, as follows: insert \"the City of Trinidad, Colorado\" where indicated.\nb. Amend IBC § 109.2, Schedule of permit fees, as follows: insert the following Schedule of Permit Fees:\nc. Amend IBC § 114.4,\n*  Or the total hourly cost to the City, whichever is greatest.  The cost shall include supervision,\noverhead, equipment, hourly wages, and fringe benefits of the employees involved.\n**  Actual costs include administrative and overhead costs.\n***  $500.00 shall be refunded if a Certificate of Occupancy is issued prior to the expiration of the\nTemporary Certificate of Occupancy.\nGROUND\nSNOW\nLOAD \nWIND DESIGN \nSEISMIC \nDESIGN \nCATEGORY \nSUBJECT TO DAMAGE\nFROM \nWINTER\nDESIGN\nTEMP \nICE BARIER\nUNDERLAYMENT\nREQUIRED \nFLOOD\nHAZARDS \nAIR\nFREEZ\nINDEX\nSpeed(mph) \nTopographic\neffects \nSpecial\nwind\nregion \nWind\nborne\ndebris\nzone \nWeathering \nFrost\nline\ndepth \nTermite \n30 \n115 \nNO \nNO \nNO \nB \nSevere \n32” \nSlight to\nmoderate \n6 \nYes \nAdopted\n5/2/98\nFIRM\n080107\n0001 B\n4/3/84 \n597 \nMANUAL J DESIGN CRITERIA \nElevation \nLatitude \nWinter\nheating  Summer cooling \nAltitude\ncorrection\nfactor \nIndoor design\ntemperature \nDesign  \ntemperature  \ncooling \nHeating \ntemperature  \ndifference \n5761 \nNorth 37  6 \n90 \n.82 \n70 \n75 \n64 \nCooling temperature\ndifference \nWind\nvelocity\nheating \nWind\nvelocity\ncooling \nCoincident wet bulb \nDaily range  Winter humidity  Summer humidity \n-- \n15 \n15 \n7.5 \n60 \nH \n30% \n50% \n-- \nEXTERIOR WALL\nELEMENT\nMINIMUM FIRE\nRESISTANCE RATING\nMINIMUM FIRE SEPARATION\nDISTANCE\nWalls\n(Fire-resistance\nrated)\n1 hour with exposure from\nboth sides\n0 feet\n(Not fire-resistance\nrated)\n0 hours\n5 feet \nProjections\n(Fire-resistance\nrated)\n1 hour on the underside\n2 feet\n(Not fire-resistance\nrated)\n0 hours\n5 feet \nOpenings\nNot allowed\nNot applicable\n< 3 feet\n25% maximum of\nwall area\n0 hours\n>= 3 feet and < 5 feet\n \n0 hours\n>= 5 feet\nViolation penalties, to\nread: Any person who\nviolates a provision of\nthis code or fails to\ncomply with any of the\nrequirements thereof, or\nwho erects, constructs,\nalters, or repairs a\nbuilding or structure in violation of the approved construction documents or directive of the building official, or of a\npermit or certificate issued under the provisions of this code, shall be subject to penalties as prescribed in Chapter 1,\nSections 1-8 and 1-9 of the Code of the City of Trinidad, Colorado.\nd. Amend IBC § 115.3, Unlawful continuance, to read: Any person who shall continue any work after having been served\nwith a stop work order, except such work as that person is directed to perform to remove a violation or unsafe condition,\nshall be subject to penalties as prescribed in Chapter 1, Sections 1-8 and 1-9  of the Code of the City of Trinidad, Colorado.\nf. Amend IBC § 1612.3, Establishment of flood hazard areas, as follows: insert name of jurisdiction as \"the City of Trinidad,\nColorado,\" and insert \"April 3, 1984,\" as the date of issuance.\nTABLE R302.1\nEXTERIOR WALLS\n1\n2\nPenetrations All\nComply with IRC § R302.4\n< 3 feet\nNone required\n>= 3 feet\nFee Schedule\nValuation of Work:\nPermit Fee:\nNot more than\n$2,000.00\n$30.00\nMore than $2,000.00\n$30.00 plus, $10.00 per each $1,000.00\nvaluation or fraction thereof.\n1. Fire separation\ndistance of three (3) feet\ncan be used if the\nexterior wall cladding and trim are of noncombustible material. (Refer to IRC § R202 for a definition of \"noncombustible\nmaterial.\")\n2. Fire separation distance of three (3) feet can be used if the soffit cladding and facia board are of noncombustible\nmaterial. (Refer to IRC § R202 for a definition of \"noncombustible material.\")\ng. Amend IRC § R313.2, One- and two-family dwellings automatic fire systems, to delete the exception and to read: An\nautomatic residential fire sprinkler system may be installed in one- and two-family dwellings.\nh. Amend IRC R315.2.2, Alterations, repairs and additions, by deleting exception 2.\ni. Amend IRC § R315.3, Location, to read:  Carbon monoxide alarms in dwelling units shall be installed outside of each\nseparate sleeping area within 15’ of the bedroom doors. Where a fuel-burning appliance is located within a bedroom or its\nattached bathroom, a carbon monoxide alarm shall be installed within the bedroom.\nj. Delete IRC Chapter 11, entitled \"ENERGY EFFICIENCY,\" in its entirety. Please refer to the International Energy\nConservation Code, adopted in Section 5-12 of this Article, for energy conservation requirements.\nk. Amend IRC § P2603.5.1, Sewer depth, as follows: insert \"thirty-two (32)\" in two locations.\nSection 5-3. Reserved.\nSection 5-4. International Mechanical Code.\n1. The International Mechanical Code, 2018 Edition, including Appendix A (\"Chimney Connector Pass-Throughs\"), as\npublished by the International Code Council, 500 New Jersey Avenue, NW, 6th Floor, Washington, DC 20001\n(headquarters), is hereby adopted by reference as the Mechanical Code of the City of Trinidad, Colorado, as if fully set\nforth in this ordinance, together with the additions, insertions, and changes prescribed in this Section. At least one (1) copy\nof said International Mechanical Code, 2018 Edition, shall remain on file in the Office of the City Clerk and open to public\ninspection.\n2. The following sections of the International Mechanical Code, 2018 Edition (\"IMC\"), are hereby revised:\na. Amend IMC§ 101.1, Title, as follows: insert \"the City of Trinidad, Colorado\" where indicated.\nb. Amend IMC § 106.5.2, Fee schedule, as follows: insert the following fee schedule:\nc. Amend IMC§ 106.5.3, Fee refunds, as follows: insert \"fifty percent (50%)\" as the specified percentage in both\nlocations.\nd. Amend IMC§ 108.4, Violation penalties, to read: Persons who shall violate a provision of this code or shall fail to\ncomply with any of the requirements thereof, or who shall erect, install, alter, or repair mechanical work in violation\nof the approved construction documents or directive of the code official, or of a permit or certificate issued under the\nprovisions of this code, shall be subject to penalties as prescribed in Chapter 1, Sections 1-8 and 1-9 of the Code of the\nCity of Trinidad, Colorado.\ne. Amend IMC § 108.5, Stop work orders, to read: Upon notice from the code official that mechanical work is being\ndone contrary to the provisions of this code or in a dangerous or unsafe manner, such work shall immediately cease.\nSuch notice shall be in writing and shall be given to the owner of the property, or to the owner's agent, or to the\nperson doing the work. The notice shall state the conditions under which work is authorized to resume. Where an\nemergency exists, the code official shall not be required to give a written notice prior to stopping the work. Any\nperson who shall continue any work on the system after having been served with a stop work order, except such work\nas that person is directed to perform to remove a violation or unsafe condition, shall be liable for a fine of not less\nthan Three Hundred Dollars ($300.00) nor more than Two Thousand Six Hundred Fifty ($2,650.00).\nf. Amend IMC § 109.1, Application for appeal, to read: Any person shall have the right to appeal an order, decision, or\ndetermination of the code official to the board of appeals. An application for appeal shall be based on a claim that the\ntrue intent of this code or the rules legally adopted thereunder have been incorrectly interpreted, the provisions of\nthis code do not fully apply, or an equally good or better form of construction is proposed. The application shall be\nfiled no later than fifteen (15) days following the issuance of the order, decision, or determination.\ng. Delete IMC§§ 109.2 through 109.6, regarding membership and procedures of the board of appeals. \nSection 5-5. International Fuel Gas Code.\nFee Schedule\nValuation of Work:\nPermit Fee:\nNot more than $2,000.00\n$30.00\nMore than $2,000.00\n$30.00 plus $10.00 per each\n$1,000.00 valuation or\nfraction thereof.\n1. The International Fuel Gas Code, 2018 Edition, as published by the International Code Council, 500 New Jersey\nAvenue, NW, 6th Floor, Washington, DC 20001 (headquarters), is hereby adopted by reference as the Fuel Gas Code of the\nCity of Trinidad, Colorado, as if fully set forth in this ordinance, together with the additions, insertions, and changes\nprescribed in this Section. At least one (1) copy of said International Fuel Gas Code, 2018 Edition, shall remain on file in\nthe Office of the City Clerk and open to public inspection.\n2. The following sections of the International Fuel Gas Code, 2018 Edition (\"IFGC\"), are hereby revised:\na. Amend IFGC § 101.1, Title, as follows: insert ''the City of Trinidad, Colorado\" where indicated.\nb. Amend IFGC § 106.1, Where required, to read: An owner, authorized agent, or contractor who desires to erect,\ninstall, enlarge, alter, repair, remove, convert, or replace an installation regulated by this code, or to cause such\nwork to be done, shall first make application to the code official and obtain the required permit for the work;\nprovided, however, that such a permit shall only be required from the City of Trinidad, Colorado, if the City, rather\nthan the State of Colorado, is performing fuel gas inspections. Exception: Where appliance and equipment\nreplacements and repairs are required to be performed in an emergency situation, the permit application shall be\nsubmitted within the City's next working business day.\nc. Amend IFGC § 106.6.2 Fee schedule, to read: The fees for all fuel gas work requiring a permit from the City of\nTrinidad shall be as indicated in the following schedule:\nd. Amend IFGC § 106.6.3, Fee refunds, as follows: insert \"fifty percent (50%)\" as the specified percentage in both\nlocations.\ne. Amend IFGC § 108.4, Violation penalties, to read: Persons who shall violate a provision of this code, fail to comply\nwith any of the requirements thereof, or erect, install, alter, or repair work in violation of the approved construction\ndocuments or directive of the code official, or of a permit or certificate issued under the provisions of this code, shall\nbe subject to penalties as prescribed in Chapter 1, Sections 1-8 and 1-9 of the Code of the City of Trinidad, Colorado.\ne. Amend IFGC § 108.5, Stop work orders, to read: Upon notice from the code official that work is being done\ncontrary to the provisions of this code or in a dangerous or unsafe manner, such work shall immediately cease. Such\nnotice shall be in writing and shall be given to the owner of the property, the owner's agent, or the person doing the\nwork. The notice shall state the conditions under which work is authorized to resume. Where an emergency exists,\nthe code official shall not be required to give a written notice prior to stopping the work. Any person who shall\ncontinue any work on the system after having been served with a stop work order, except such work as that person is\ndirected to perform to remove a violation or unsafe condition, shall be subject to penalties as prescribed in Chapter 1,\nSections 1-8 and 1-9 of the Code of the City of Trinidad, Colorado.\nf. Amend IFGC § 109.1, Application for appeal, to read: Any person shall have the right to appeal an order, decision,\nor determination of the code official to the board of appeals. An application for appeal shall be based on a claim that\nthe true intent of this code or the rules legally adopted thereunder have been incorrectly interpreted, the provisions\nof this code do not fully apply, or an equally good or better form of construction is proposed. The application shall be\nfiled no later than fifteen (15) days following the issuance of the order, decision, or determination.\nf. Delete IFGC §§ 109.2 through 109.6, regarding membership and procedures of the board of appeals\nSection 5-6. International Energy Conservation Code.\n1. The International Energy Conservation Code, 2018 Edition, as published by the International Code Council, 500 New\nJersey Avenue, NW, 6th Floor, Washington, DC 20001 (headquarters), is hereby adopted by reference as the Energy\nConservation Code of the City of Trinidad, Colorado, as if fully set forth in this ordinance, together with the additions,\ninsertions, and changes prescribed in this Section. At least one (1) copy of said International Energy Conservation Code,\n2018 Edition, shall remain on file in the Office of the City Clerk and open to public inspection.\n2. The following sections of the International Energy Conservation Code, 2018 Edition (\"IECC\"), are hereby revised:\na. Amend IECC § C101.1 and R101.1, Title, as follows: insert ''the City of Trinidad, Colorado\" where indicated.\nb. Amend IECC § C108.4 and R108.4, Failure to comply, to read: Any person who shall continue any work after having\nbeen served with a stop work order, except such work as that person is directed to perform to remove a violation or\nunsafe condition, shall be subject to penalties as prescribed in Chapter 1, Sections 1-8 and 1-9 of the Code of the\nCity of Trinidad, Colorado.\nc. Delete IECC § C103.6.3 Systems operation control in its entirety.\nd. Amend IECC § C403.6.1 Variable air volume and multiple-zone systems, #1 and #2 to add “Direct Digital Control”\nin front of the letters DDC to read: …for systems with Direct Digital Control (DDC)…\ne. Amend IECC § R402.4.1.2 Testing to read: The building or dwelling unit shall be tested and verified as having an\nair leakage rate not exceeding five air changes per hour or 0.30 cubic feet per minute for multi-family units and not\nexceeding three air changes per hour or 0.24 cubic feet per minute for all other residential buildings and dwelling\nunits.  (remainder of section unchanged).\nf. Delete IECC §§ C404.5 through C404.5.2.1 in their entirety. (Amended Ord. 2073, eff. 3/15/19)\nSection 5-7. International Existing Building Code.\n1. The International Existing Building Code, 2018 Edition, as published by the International Code Council, 500 New Jersey\nAvenue, NW, 6th Floor, Washington, DC 20001 (headquarters), is hereby adopted by reference as the Existing Building\nCode of the City of Trinidad, Colorado, as if fully set forth in this ordinance, together with the additions, insertions, and\nchanges prescribed in this Section. At least one (1) copy of said International Existing Building Code, 2018 Edition, shall\nremain on file in the Office of the City Clerk and open to public inspection.\n2. The following sections of the International Existing Building Code, 2018 Edition (\"IEBC\"), are hereby revised:\na. Amend IEBC § 101.1, Title, as follows: insert \"the City of Trinidad, Colorado\" where indicated.\nb. Amend IEBC § 113.4, Violation penalties, to read: Any person who violates a provision of this code or who fails to\ncomply with any of the requirements thereof, or who repairs, alters, or changes the occupancy of a building or\nstructure in violation of the approved construction documents or directive of the code official, or of a permit or\ncertificate issued under the provisions of this code, shall be subject to penalties as prescribed in Chapter 1, Sections\n1-8 and 1-9 of the Code of the City of Trinidad, Colorado.\nc. Amend IEBC § 114.3, Unlawful continuance, to read: Any person who shall continue any work after having been\nserved with a stop work order, except such work as that person is directed to perform to remove a violation or\nunsafe condition, shall be liable for a fine of not less than Three Hundred Dollars ($300.00) nor more than Two\nThousand Six Hundred Fifty ($2,650.00).\nd. Add to IEBC § 106.2.7. Phased Construction, (only for existing and historic structures within the city limits) as\nfollows:\ni. A Colorado licensed design professional will do an assessment of the building or structure which will be\nprovided to the Building Official for review to ascertain the current type of construction and structural\nadequacy.\nii. A building may use a Phased approach to a remodel project only if complete, stamped plans for that\nphase and the location/description of future phases including intended occupancy are provided to and\napproved by the Building Official prior to the initiation of the project. \nA Phased approach plan submittal shall include:\nA code analysis of all intended occupancies based on construction type.\nConstruction documents shall be of sufficient clarity to indicate the location, nature and extent of\nthe work proposed and show in detail that it will conform to the provisions of this code and relevant\nlaws, ordinances, rules and regulations, as determined by the code official. The work areas shall be\nshown along with fire protection system(s) shop drawings, means of egress, exterior wall envelope,\ninterior environment and site plan.\nSection 5-8. International Property Maintenance Code.\n1. The International Property Maintenance Code, 2018 Edition, including Appendix Chapter   A (\"Boarding Standard\"), as\npublished by the International Code Council, 500 New Jersey Avenue NW, 6th Floor, Washington, DC 20001\n(headquarters), is hereby adopted by reference as the Property Maintenance Code of the City of Trinidad, Colorado, as if\nfully set forth in this ordinance, together with the additions, insertions, deletions, and changes prescribed in this Section.\nAt least one (1) copy of said International Property Maintenance Code, 2018 Edition, shall remain on file in the Office of\nthe City Clerk and open to public inspection.\n2. The following sections of the International Property Maintenance Code, 2018 Edition (\"IPMC\"), are hereby revised:\na. Amend IPMC § 101.1, Title, as follows: insert \"the City of Trinidad, Colorado\" where indicated.\nb. Amend IPMC § 103.5, Fees, as follows: See Building Permit Fees, Section 5-1(2)(b).\nc. Amend IPMC § 106.4, Violation penalties, to read: Any person who shall violate a provision of this code, or fail to\ncomply therewith, or with any of the requirements thereof, shall be subject to penalties as prescribed in Chapter 1,\nSections 1-8 and 1-9 of the Code of the City of Trinidad, Colorado.\nd. Amend IPMC § 111.1, Application for appeal, to read: Any person directly affected by an order, decision, or\ndetermination of the code official or a notice or order issued under this code shall have the right to appeal to the\nboard of appeals, provided that a written application for appeal is filed no later than fifteen (15) days following the\nissuance of the order, decision, or determination.  An application for appeal shall be based on a claim that the true\nintent of this code or the rules legally adopted thereunder have been incorrectly interpreted, the provisions of this\ncode do not fully apply, or the requirements of this code are adequately satisfied by other means.\ne. Delete IPMC §§ 111.2 through 111.6, regarding membership and procedures of   the board of appeals.\nf. Amend IPMC § 112.4, Failure to comply, to read: Any person who shall continue any work after having been served\nwith a stop work order, except such work as that person is directed to perform to remove a violation or unsafe\ncondition, shall be subject to penalties as prescribed in Chapter 1, Sections 1-8 and 1-9 of the Code of the City of\nTrinidad, Colorado.\ng. Amend IPMC § 302.4, Weeds, as follows: insert \"six inches (6\").\"\nh. Delete IPMC § 304.14, Insect screens.\ni. Amend IPMC § 602.3, Heat supply, as follows: insert \"January 1 to December 31.\"\nj. Amend IPMC § 602.4, Occupiable work spaces, as follows: insert \"January 1 to December 31.\"\nSection 5-9  Reserved.\nARTICLE 2. CONTRACTOR LICENSING.\n(Ord. 2061, Article 2, repealed and reenacted, eff. 7-13-18)\nSection 5-10. Definitions, Classifications and Fees.\n1. Contractor. Contractor means a person who supervises himself or herself, his or her firm or one (1) or more trades or\nsubcontractors, and who for any compensation undertakes any landscaping, construction, addition, alteration, repair,\ndemolition, removal or moving of any building, structure or utility. A resident homeowner shall not be required to obtain a\ncontractor's license for any landscaping, construction, addition, alteration or repair of the homeowner's occupied\nresidence, or a building or structure accessory to such residence, provided that the homeowner shall first assume all duties\nand responsibilities of a contractor as set forth in this Section by executing a form furnished by the Chief Building Official\npursuant to which the homeowner agrees to assume all duties and responsibilities.\n2. Classification.\na. Contractor A. A Contractor A license is authorized to work with respect to multi-unit residential buildings, office\nbuildings, commercial buildings, tenant finish and alterations thereto and any work authorized under Contractor B,\nC and D licenses. This license covers all buildings including those three (3) stories and above. Requires proof of ICC\ntesting.\nb. Contractor B. A Contractor B license is authorized to work with respect to multi-unit residential buildings, office\nbuildings, commercial buildings, tenant finish and alterations thereto and any work authorized under Contractor C\nand D licenses. This license covers buildings under three (3) stories or less. Requires proof of ICC testing.\nc. Contractor C. A Contractor C license is authorized to work with respect to detached single-family residential\nbuildings and alterations thereto and any work authorized under Contractor D license. Requires proof of ICC\ntesting.\nd. Contractor D. A Contractor D license is authorized to work as a single trade only i.e. home repair, siding, plastering,\nsheetrock installation, excavation, concrete work not in a city right-of-way. No proof of ICC testing required.\ni. Plumbing and electrical contractors fall under D licensing but because they are required to hold a State\nMasters License are not required to show proof of ICC testing.\nii. Mechanical and roofing contractors fall under D licensing but are required to show proof of lCC testing.\n3. Fees.    Contractor's licenses shall be issued for a calendar year. The annual license fee shall be as stated below unless\namended by resolution of the City Council in accordance with the licensing classifications as set forth above [Section 5-\n10(2)]. In addition to the license fee, there is a processing/application fee for new applicants in the amount of $50.00.\na. Contractor A - $150.00\nb. Contractor B - $125.00\nc. Contractor C - $100.00\nd. Contractor D - $75.00 for each license type i.e. roofing and stucco= $150.00\ne. License fees are not refundable. Any fee paid under this Section shall not be refunded for any reason after the\nlicense has been issued.\n4. Violations. A fine as prescribed in Chapter 1, Sections 1-8 and 1-9 of the Code of the City of Trinidad, Colorado shall be\nassessed to the following:\na. Any contractor or subcontractor working within the City limits without possessing a current contractor's license;\nand\nb. Any contractor or subcontractor performing work outside the scope of their license.\nSection 5-11. Testing.\nICC Standardized Contractor Exams. Contractors are required to successfully pass the ICC Contractor Exam. The City and\nits citizens benefit from such commonality having a solid foundation upon which to issue licenses to practice.\nSection 5-12. Insurance Requirements.\n1. The City of Trinidad shall be identified as the Certificate Holder on insurance certificates. Every contractor shall procure\nworkers' compensation coverage as required by state law and general liability coverage with the following minimum limits:\na. General Aggregate: two million dollars ($2.000.000.00).\nb. Products, completed operations: two million dollars ($2,000,000.00).\nc. Personal and advertising injury: one million dollars ($1,000,000.00).\nd. Each occurrence: one million dollars ($1,000,000.00).\ne. A license and permit bond shall be procured for a minimum of $5,000 for all new contractor licenses and any\nrevoked/suspended licensees seeking reinstatement.\n2. No contractor's license shall be issued under this Article until the following documents are filed with the Chief Building\nOfficial:\na. A statement or certificate signed by an authorized agent of an insurance company licensed to do business in the\nState, stating that a policy or policies have been issued to the applicant with the coverage amounts set forth in\nSubsection (1) hereof, and including the effective date and expiration date of the policy or policies; and\nb. A copy of an endorsement to the policy requiring at least ten (10) days' prior written notice to the Chief Building\nOfficial of cancellation of the policy for any reason.\n3. In the event of cancellation of any policy required by this Section, the Chief Building Official shall immediately suspend\nthe contractor's license. The license shall be reinstated when the licensee furnishes the documentation required by\nSubsection (2) hereof.\nSection 5-13. Duties and Responsibilities of Licensee.\n1. All licensees under this Article shall be responsible for the following:\na. All work covered by his/her permit, whether or not such work is done directly by the licensee or his/her employees\nor subcontractors. Subcontractors are required to be licensed with the City even if they are working under the\nsupervision of a licensed contractor.\nb. All funds or property received by him/her for completion of a specific contract or for a specific purpose.\nc. Obtaining any required permits for himself/herself and any subcontractor under his/her supervision.\nd. Safety measures and equipment to protect workers and the public in compliance with applicable federal and state\nlaws.\ne. Compliance with all applicable City ordinances, codes and regulations.\nf. Constructing any building or structure in substantial compliance with the drawings and specifications approved by\nthe Chief Building Official and the permit issued for the same, unless changes are approved by the Chief Building\nOfficial.\ng. Completing all work authorized by the permit unless there is good cause for the non-completion of the work.\nh. Obtaining inspection services where required by this Chapter and any technical code.\ni. Paying any fee assessed under the authority of this Code or any technical codes.\nj. Obeying any order or notice issued pursuant to this Code or any technical code.\nk. Presenting his/her license when requested by the Chief Building Official.\nl. Maintaining workers' compensation and liability insurance as required by Section 5-12.\nSection 5-14. Suspension and Revocation of License.\n1. The Chief Building Official may suspend or revoke a license for any of the following:\na. Failure to comply with any of the duties and responsibilities set forth in Section 5-13.\nb. Using a contractor's license to obtain a permit required under this code for any other person, corporation or legal\nentity.\nc. Violating any provisions of the Trinidad Building Code including any codes which are adopted by reference.\nd. Failure to reveal any material fact in the application for a contractor's license or permit, or the supplying of\ninformation which is untrue or misleading as to any material fact in the application for a contractor's license or\npermit.\ne. Failure to obtain a proper permit for any work for which a permit is required.\nf. Receipt of three (3) or more written verified complaints.\n2. Upon written notification of revocation or suspension of license, the contractor shall have the right to appeal their case\nby oral and documentary evidence, to submit rebuttal evidence, and to conduct such cross-examination as may be required\nfor a full and true disclosure of the facts to the Board of Building Code Appeals.\nSuspension or revocation of a contractor's license shall not be construed to release the contractor from liabilities and\nobligations of completing his contract. During the period prior to the hearing before the Board of Building Code Appeals,\nthe contractor shall not be allowed to submit an application for any other projects.\n3. The Board of Building Code Appeals (BOBCA) may reinstate a license for any contractor whose license has been\nrevoked, provided a majority of the BOBCA votes in favor of such reinstatement for such reason as the BOBCA may deem\nsufficient. In such case where the contractor's license has been revoked and the contractor is petitioning the BOBCA for\nreinstatement, the petitioner shall follow the established policies for requesting such hearing and pay all applicable fees.\nSection 5-15. Application Form and Contents.\n1. Along with the application, proof of ICC testing (if required) and certificates of insurance listing the City of Trinidad as\nthe Certificate Holder must be provided. An application for a contractor's license shall be on a form furnished by the City,\nshall be filed with the Chief Building Official and shall contain the following information under oath:\na. Correct business contact information.\nb. ICC testing information.\nc. Insurance carrier information.\nd. Business references.\ne. Signature, title and date of person making oath of accuracy.\nSections 5-16 through 5-22 RESERVED. (Ord. 2061, eff. 7-13-18)\nARTICLE 3.  NON-CONFORMANCE\nSection 5-23.  Reserved. (Ord. 1976, eff. 6-26-15)\nARTICLE 4.  MEANS OF APPEAL\nSection 5-24.  Board of Building Code Appeals and Means of Appeal.\n(1) Application for appeal. Any person directly affected by a decision of the code official or a notice or order issued\nunder this code shall have the right to appeal to the board of appeals, provided that a written application for appeal is filed\nwithin fifteen (15) days after the day the decision, notice or order was served.  An application for appeal shall be based on a\nclaim that the true intent of this code or the rules legally adopted thereunder have been incorrectly interpreted, the\nprovisions of this code do not fully apply, or the requirements of this code are adequately satisfied by other means.  The\nBoard may only rule on the code interpretation of the CBO.\n(2) Membership of board. The board of appeals shall consist of a minimum of three members who are qualified by\nexperience and training to pass on matters pertaining to property maintenance and who are not employees of the\njurisdiction.  The board shall be appointed by the City Council, and shall serve staggered and overlapping two-year terms.\n(a) Alternate Members. The City Council shall appoint two or more alternate members who shall be called by the\nboard chairman to hear appeals during the absence or disqualification of a member.  Alternate members shall\npossess the qualifications required for board membership.\n(b) Chairperson. The board shall annually select one of its members to serve as chairperson.\n(c) Disqualification of member. A member shall not hear an appeal in which that member has a personal,\nprofessional or financial interest.\n(d) Secretary. The chief administrative officer shall designate a qualified person to serve as secretary to the board.\n The secretary shall file a detailed record of all proceed ings in the office of the chief administrative officer.\n(e) Compensation of members. Compensation of members shall be determined by law.\n(3) Notice of meeting. The board shall meet upon notice from the chairperson, within 20 days of the filing of an appeal,\nor at stated periodic meetings.\n(4) Open hearing. All hearings before the board shall be open to the public.  The appellant, the appellant’s\nrepresentative, the code official and any person whose interests are affected shall be given an opportunity to be heard.  A\nquorum shall consist of not less than two-thirds of the board membership.\n(a) Procedure. The board shall adopt and make available to the public through the secretary procedures under\nwhich a hearing will be conducted.  The procedures shall not require compliance with strict rules of evidence, but\nshall mandate that only relevant information be received.\n(5) Postponed hearing. When the full board is not present to hear an appeal, either the appellant or the appellant’s\nrepresentative shall have the right to request a postponement of the hearing.\n(6) Board decision. The board shall modify or reverse the decision of the code official only by a concurring vote of a\nmajority of the total number of appointed board members.\n(a) Records and copies. The decision of the board shall be recorded.  Copies shall be furnished to the appellant\nand to the code official.\n(b) Administration. The code official shall take immediate action in accordance with the decision of the board.\n(7) Court review. Any person, whether or not a previous party of the appeal, shall have the right to apply to the\nappropriate court for a writ of certiorari to correct errors of law.  Application for review shall be made in the manner and\ntime required by law following the filing of the decision in the office of the chief administrative officer.\n(8) Stays of enforcement. Appeals of notice and orders (other than Imminent Danger notices) shall stay the\nenforcement of the notice and order until the appeal is heard by the appeals board.\nSection 5-25.  Building Code Variance Petition.\n(1)   Before any variance from building codes may be granted, the Board of Building Code Appeals must find all of\nthe following:\n(a) Existence of special conditions or circumstances. That special conditions and circumstances exist which are\npeculiar to the structure or building involved and which are not applicable to other structures or buildings in\nthe same zoning district.\n(b) Conditions not created by applicant. That the special conditions and circumstances do not result from the\naction or negligence of the applicant.\n(c) Special privilege not conferred. That granting the variance requested will not confer upon the applicant any\nspecial privileges denied to other buildings or structures in the same zoning district.\n(d) Hardship conditions exist. That literal interpretation of the provisions of the building code regulations\nwould deprive the applicant of rights commonly enjoyed by other properties in this same zoning district under\nthe terms of this ordinance and would work unnecessary and undue hardship on the applicant.\n(e) Only minimum variance granted. That the variance granted is the minimum variance that will make\npossible the reasonable use of the building or structure.\n(f) Not injurious to the public welfare. That the grant of the variance will be in harmony with the general intent\nand purpose of the building code and that such variance will not be injurious to the area involved or otherwise\ndetrimental to the public interest or welfare.\n(g). Existing non-conforming uses of other property not the basis for approval. No non-conforming use of\nneighboring lands, structures, or buildings in the same district and no permitted use of lands, structures or\nbuildings in other districts shall be considered grounds for the issuance of a variance.\n(2) Application and instructions below.\n1. Fill in the owner’s information section.  It is important to have a complete address and phone number for\ncommunication between the applicant and the department.\n2. Fill in the project description box.  Explain what the building project is i.e. basement alteration, second floor\nalteration, two-story addition, etc.\n3. If there is an agent working for the owner and the agent is a better contact for information regarding the variance,\nfill in the agent information area.\n4. Answer the three questions:\na. State the code and section number with a summary of what the code says.  Also, indicate what the non-\nconforming conditions for the project are i.e. COMM21.04 minimum stair width is 36 inches; i.e. will\nhave 34 inches of stair width.\nb. State why the rule cannot be satisfied i.e. not structurally feasible.\nc. State what will be done to provide an equivalency to the code.  These items should be things that relate to\nthe item the variance is being sought for and exceed code requirements.\n5. Print the owner’s name on the line indicating to do so.\n6. The owner of the property is required to sign where indicated.  If the project is for a one or two family home, the\nform is not required to be notarized.  If the project is for a commercial building, the form is required to be\nnotarized.\nBUILDING CODE VARIANCE PROCEDURE\n1. Fill out the variance form.\n2. If the variance is for a commercial building and is not for an accessibility code contact the fire department so they\ncan fill out a fire department position statement.\n3. Submit the application and a $250.00 fee for a residential variance or a $490.00 fee for a commercial variance to\nthe building inspection department.  Also, where applicable, submit the fire department position statement.\n4. A field inspector may visit the site to verify existing conditions and the completeness of the application.\n5. If there have previously been at least 5 variances for the same item approved, the variance may be approved on\nprecedence.  In this case the applicant will not have to attend a meeting of the Board of Building Code Appeals and\nwill be notified by letter that the variance is approved.  The letter will be sent within 7 days after the scheduled\nmeeting.\n6. In all other cases the variance will be presented to the Board of Building Code Appeals at a monthly meeting.  Seven\ndays before the meeting the supervisor will review the variance for approval to be put on the agenda.  Five days\nbefore the meeting the secretary will mail out the agenda to the Board of Building Code Appeals members and to\nthe applicants.\n7. When a variance is heard by the board the applicant or agent must attend the meeting to answer questions.\n8. The meeting minutes will be mailed within 7 days after the meeting.\nARTICLE 5.  VACANT PROPERTY REGISTRATION\n(Ord. 2029, Article 5, amended, eff. 6/16/17)\nSection 5-26.    Title, purpose and intent.\n(1) This Article shall be known as the City of Trinidad Vacant Property Registration Code, or the “Property Registration\nCode.”\n(2) The purpose and intent of this Article is to mitigate the elevated risk inherently present in abandoned properties of\nbecoming deteriorated, abandoned, unsecured, vandalized and hazardous, all to the detriment of the public health, safety\nand welfare.  When allowed to proliferate, vacant properties can cause widespread blight, provide havens for criminal\nactivity and vagrancy, destroy the safety and quality of neighborhoods, pose unnecessary dangers to public safety\nprofessionals, deplete already-scarce City resources, diminish property values throughout the City, undermine the City’s\nability to enforce its criminal laws, and interfere with the City’s duty to protect its citizens from unsafe and harmful\nconditions.  This Article is intended to provide an avenue for the City to be aware of vacant properties and to monitor,\ninspect and enforce certain minimum maintenance standards at such properties that pose a threat to the public health,\nsafety, and welfare.\nSection 5-27.    Definitions\nFor the purposes of this Article, the following words and phrases shall have the following meanings, unless the context\nclearly indicates otherwise.\nCode Official means the Chief Building Official of the City of Trinidad or any other City official, employee or agent\ndesignated and authorized by the City Manager to enforce this Article.\nPerson in Control means and includes, in regards to any particular property, the person, persons, entity or entities holding\ntitle; a mortgagee or vendee; a receiver; an executor; a trustee; and any other person, entity, lessee or holder of a lesser\nestate or interest, who possesses the authority to enter the property.\nVacant Property means any property upon which any building remains unoccupied by authorized persons for any\nconsecutive period of time greater than one year.\nVacant Property Registration Form means the form required by this Article to register a vacant property and available in\nthe office of the City Clerk.\nSection 5-28.  Registration required.\n(1)  Each Vacant Property within the City must be registered with the City pursuant to this Section within thirty (30) days\nof becoming a Vacant Property under the terms of this Article.  It is the joint and several obligation of each Person in\nControl of such property to register the same and to annually renew such registration within thirty (30) days of the\nanniversary date of the original registration.  Renewal may consist of written notification, with no particular form\nrequired, when the renewal indicates that no information has changed since the last provided information.  Each renewal\nmust include the applicable renewal fee.\n(2)  Vacant Property Registration Forms shall be filed with the City Clerk and the City Clerk shall not accept any\nincomplete Form.  A complete Vacant Property Registration Form shall include, at a minimum, the following information,\nand be accompanied by the applicable registration fee:\n(a)  Location and description of the Vacant Property, including the legal description, parcel identification number,\nphysical address and mailing address, if not the same.\n(b)  The full name, mailing address, residential address (if different than mailing address) and telephone number for\neach individual known by the applicant to be a Person in Control.\n(c)  The full name, mailing address, business address (if different than mailing address) and telephone number of at\nleast one (1) officer, manager or director, for each entity known by the applicant to be a Person in Control, if such\nPerson in Control is a business entity.\n(d)  If no Person in Control has a Colorado residential or business address within fifty (50) miles of the City of\nTrinidad, the full name, mailing address, residential or business address (if different than mailing address) and\ntelephone number of the agent for the property who shall have either a residential or business Colorado address\nwithin fifty (50) miles of the City of Trinidad, along with a copy of the writing designating the agent to act as the\nrepresentative of the applicant on issues related to the Vacant Property and for receipt of notices and legal service of\nprocess related to the Vacant Property.\n(e)  An affirmation that the application is complete and contains no false, misleading or fraudulent statements.\n(f)  An affirmation of and consent to the City’s right to enter the Vacant Property for purposes of inspection for\ncompliance with this Article.\n(3)  It is the duty of each Person in Control to ensure that all of the information provided in a Vacant Property Registration\nForm is kept up to date at all times, and it shall be unlawful for a Person in Control to fail to provide updated information\nto the City within ten (10) days after the date upon which any information provided is no longer accurate.  This obligation\nincludes an obligation to notify the City in writing no later than ten (10) days after a Vacant Property is occupied in such a\nway that it no longer constitutes a Vacant Property under this Article.\nSection 5-29. Fees.\n(1)  Original registration fee.  Each original Vacant Property Registration Form filed for any particular property for any\nparticular consecutive vacancy period shall be accompanied by a registration fee of five hundred dollars ($500).\n Notwithstanding the foregoing, the original registration fee shall be waived if a Person in Control registers a Vacant\nProperty promptly after such Person in Control becomes aware that the property qualifies as such under this Article and\nprior to the City’s issuance of any written notice that the property is required to be registered under this Article.\n(2) Renewal registration fee.  Written notice of the required annual renewal of each registered Vacant Property shall be\naccompanied by a renewal registration fee of five hundred dollars ($500).  Notwithstanding the foregoing, the renewal\nregistration fee shall be waived if a Person in Control files the required annual renewal no later than thirty (30) days after\nthe anniversary date of original registration of the Vacant Property.\nSection 5-30. Property maintenance obligations.\n(1)  It is the duty and obligation of each Person in Control of a Vacant Property to maintain the same free from conditions\nthat would identify the property as a long-term vacancy to a person with ordinary sensory abilities observing the Vacant\nProperty from adjacent or nearby public property or right-of-way.  Such prohibited conditions include, but are not limited\nto:\n(a)  Signs, placards and any other written indication that the property is foreclosed or vacant, excepting, however,\nany “do not occupy” order or other notice or order issued by the City of Trinidad or any other entity with jurisdiction\nover the Vacant Property in regards to fire, health and safety regulations, required or authorized to be posted on such\nproperty by law;\n(b)  Excess debris and litter;\n(c) Broken windows or doors that are not repaired within thirty (30) days.  For purposes of this subsection,\n“repaired” shall mean restored to its original condition or replaced with a window or door of approximately the same\ndesign.  A broken window or door may be covered with plywood or similar boarding material as an emergency\nmeasure, but in no event longer than thirty (30) days;\n(d)  Handbills, circulars, newspapers, advertisements and similar materials deposited and remaining on the property\nfor more than five (5) consecutive days;\n(e)  Standing water other than what naturally occurs on the property as a result of its geographical condition and the\nweather, such as, but not limited to, standing water in swimming pools, yard decorations and or animal and bird\nfeeders;\n(f)  Any condition, or combination thereof, constituting a violation of the City of Trinidad Anti-Dilapidation Code or\nthe International Property Maintenance Code (IPMC), as adopted and amended by the City, pursuant to Section 5-14\nof this Code.\n(2)  The maintenance requirements of this Section are in addition to, and shall not be considered to conflict with or\nabrogate, any and all other property maintenance requirements set forth in the Trinidad Municipal Code and all codes\nadopted by reference thereby.  Nothing in this Section or Article shall operate to eliminate, mitigate or otherwise affect the\nlegal responsibilities and duties of each Person in Control of Vacant Property to comply with each and every other law\napplicable to such property, including but not limited to building, housing, nuisance, and zoning regulations.\nSection 5-31.  Inspections.\n(1)  Pursuant to the consent to inspect granted by the Vacant Property Registration Form, the City may enter and inspect\nany registered Vacant Property for purposes of determining compliance with this Article by filing an inspection request\nwith the Person in Control or with such other person designated as the authorized agent by the Vacant Property\nRegistration Form, at least five (5) business days prior to the requested inspection date.\n(2)  If the inspection request issued under subsection (1) above is denied or ignored, or if inspection of the Vacant Property\non the inspection date is otherwise made impossible, the City may appear before the Municipal Court Judge and request,\npursuant to Rule 241(b)(2) of the Municipal Court Rules of Procedure, as amended, a court order authorizing the City to\nenter upon the premises for purposes of inspection for compliance with the requirements and limitations of this Article.\n Upon possession of the court order, the City may enter the Vacant Property, using such reasonable force as may be\nnecessary to gain entry.\n(3)  It shall be unlawful for any person to deny entry to an authorized City employee, agent or official when such individual\nis acting pursuant to a court order that has been issued according to the procedure outlined in this section.\nSection 5-32.  Unlawful conduct; penalties; enforcement.\n(1)  It shall be unlawful for any Person in Control and any authorized agent designated by a Person in Control to fail to\nperform any act required by this Article, or to knowingly permit such failure.  Each and every day that a violation of this\nArticle exists constitutes a separate and distinct offense and any party committing such violation, upon conviction thereof,\nshall be guilty of a misdemeanor and subject to the fines and penalties set forth in Section 1-8 of this Code.\n(2)  A violation of the property maintenance obligations set forth under this Article is hereby declared to be a public\nnuisance, subject to abatement by the City in accordance with Article 7 of Chapter 16 of this Code.\n(3)  A violation of this Article may be prosecuted and enforced through the administrative enforcement process set forth\nunder Article 6 of this Chapter 5.\n(4)  Each and every remedy and enforcement avenue set forth under this Section is cumulative and distinct, and the City\nmay enforce this Article through any and all legal avenues available to it.\nSection 5-33.  Joint and several liability.\nEach Person in Control and each authorized agent designated by a Person in Control is jointly and severally responsible\nand liable for violations of this Article, and all fees, costs and fines levied as a result of such violations, arising out of the\nVacant Property over which such person has, or has been delegated, control.\nSections 5-34 – 5-45.  Reserved.\nARTICLE 5.  ANTI-DILAPIDATION CODE\n(Ord. 2009, Article 5, enacted 5-17-16)\nSection 5-45.  Title, purpose and intent.\n(1) This Article shall be known as the City of Trinidad Anti-Dilapidation Code, or the “Anti-Dilapidation Code.”\n(2) The purpose and intent of this Article is to prevent and remedy the deterioration and neglect of buildings that\nconstitute threats to the public health, safety and welfare by presenting fire hazards, threatening to collapse and damage\npersons or property, attracting and harboring illicit and illegal activity, harboring vermin and feral animals, and providing\nan environment within which mold, dust and other contagion may thrive.  This Article is intended to define such buildings\nand provide an efficient and effective enforcement mechanism to remedy the same.\nSection 5-46.  Definitions.\nFor the purposes of this Article, the following words and phrases shall have the following meanings, unless the context\nclearly indicates otherwise.\nCode Official means the Chief Building Official of the City of Trinidad or any other City official, employee or agent\ndesignated and authorized by the City Manager to enforce this Article.\nDilapidated Building means any building or structure deemed to be dilapidated under the provisions of Section 5-47 of this\nArticle.\nSection 5-47. Dilapidated Buildings.\nFor purposes of this Article, any building or structure which has any or all of the conditions or defects hereinafter\ndescribed shall be deemed to be a Dilapidated Building, provided that such conditions or defects exist to the extent that the\nlife, health, property or safety of the public or its occupants are endangered.\n(1)  Exterior doors or windows are broken, missing, damaged, not secured, or are so poorly constructed or maintained as\nto be an ineffective barrier between the interior and exterior of the building.\n(2)  Exterior walls, roofs, steps, chimneys, porches, decks, fences, fascia board, soffits, or other features are damaged,\ncollapsed or collapsing, broken, or so deteriorated as to expose the interior of the building to weather.\n(3)  Any door, aisle, passageway, stairway or other means of exit is not of sufficient width or size or is not so arranged as to\nprovide safe and adequate means of exit in case of fire or panic.\n(4) The walking surface of any aisle, passageway, stairway or other means of exit is so warped, worn, loose, torn, covered in\nor littered with some other matter or substance, or otherwise unsafe as to not provide safe and adequate means of exit in\ncase of fire or panic.\n(5) Any portion of the building has been damaged by fire, earthquake, wind, flood or by another cause, to such an extent\nthat the structural strength or stability thereof is materially less than it was before such catastrophe and is less than the\nminimum requirements of the Building Code for new buildings of similar structure, purpose or location.\n(6) Any portion or member or appurtenance thereof is likely to fail, or to become dislodged or detached, or to collapse and\nthereby injure persons or damage property, including but not limited to gutters, rain guards, ornamental trim, ornamental\ndesign, ornamental decorations, cornice, and cobbling.\n(7) The building or structure, or any portion thereof, because of dilapidation; deterioration; decay; faulty construction; the\nremoval, movement or instability of any portion of the ground; the deterioration, decay or inadequacy of its foundation; or\nany other cause, is likely to partially or complete collapse.\n(8)  The building or structure, or any part thereof, is manifestly unsafe for the purpose for which it is being used.\n(9)  The building or structure has been so damaged by catastrophe or has become so dilapidated or deteriorated as to\nbecome an attractive nuisance to children; a harbor for unauthorized occupants; or so as to provide a venue for covert\ncriminal activity.\n(10) The building or structure has been constructed, exists or is maintained in violation of any specific requirement or\nprohibition applicable to such building or structure provided by the building regulations of the City of Trinidad, or of any\nlaw or ordinance of the state, or City relating to the condition, location or structure of buildings.\n(11)  If intended for dwelling purposes, the structure or building, because of inadequate maintenance, dilapidation, decay,\ndamage, faulty construction or arrangement, inadequate light, air or sanitation facilities, or otherwise, is determined by\nthe department of health or a City official to be unsanitary, unfit for human habitation or in such a condition that is likely\nto cause sickness or disease.\n(12) The building or structure, because of obsolescence, dilapidated condition, deterioration, damage, inadequate exits,\nlack of sufficient fire-resistant construction, faulty electric wiring, gas connections or heating apparatus, or other cause, is\ndetermined by the Fire Chief, or his or her designee or another City official, to be a fire hazard.\n(13) The building or structure is condemned or posted as unsafe to occupy by the City or by any other entity with\njurisdiction over the building or structure, or the same is vacant and unregistered as required by the Property Registration\nCode.\n(14) The building, structure, or property is left in a state of incomplete construction, partial demolition, damaged by\nvandalism, fire, earthquake or other acts for a period of 6 months, excluding such time when work is in progress pursuant\nto a valid building or other construction permit.\n(15) The building, structure, or property is consistently in violation of City of Trinidad Codes or Ordinances or require a\ndisproportionate amount of City service or personnel response.\n(16) The condition of the building, structure, or property is maintained and kept in such a way that it is likely to attract,\ncontain, or harbor vermin, debris, trash, illegal dumping or other conditions which are a detriment to the public health,\nsafety and welfare.\nSection 5-48.  Inspections.\n(1) Whenever necessary to make an inspection to enforce this Article, or whenever a Code Official has reasonable cause to\nbelieve that there exists in or upon any property a Dilapidated Building, the Code Official shall first present proper\ncredentials and shall request entry. If entry is refused, such officer shall give the owner or occupant, or if the owner or\noccupant cannot be located after a reasonable effort, he or she shall leave at the property, a written notice, of intent to\ninspect not sooner than twenty-four (24) hours after the time specified in the notice of intention to inspect. The notice\nshall state that the owner or occupant has the right to refuse entry and that, in the event such entry is refused, inspection\nmay be made only upon issuance of a search warrant by the Municipal Judge or a judge of any other court having\njurisdiction.\n(2) In addition to, or in lieu of, the procedures described in Subsection (1) above, a Code Official may appear before the\nMunicipal Judge and, upon presentation of an affidavit showing probable cause, shall obtain a search warrant entitling\nsuch officer or other authorized representatives of the City to enter the property described in said warrant. For purposes of\nthis Section, probable cause exists when the supporting affidavit alleges sufficient facts to warrant a person of reasonable\ncaution to believe that a Dilapidated Building, as defined by this Article, is located or maintained on the described\nproperty.  In determining whether probable cause for issuance of a search warrant exists, the Municipal Court Judge shall\nconsider the totality of the facts and circumstances known to the affiant, and due consideration shall be given to the\naffiant's experience and training in evaluating the existence or probable existence of violations of building code\nrequirements and health, safety and welfare regulations.  In determining whether probable cause exists for issuance of the\nsearch warrant, the Municipal Court Judge shall make a practical, commonsense decision as to whether, given the totality\nof the circumstances set forth in the affidavit, there is a fair probability that conditions constituting a Dilapidated Building\nwill be found in a particular place.\n(3) After obtaining a search warrant, the Code Official and any other City representative authorized by such warrant may\nenter the property described therein using such reasonable force as may be necessary to gain entry. It shall be unlawful for\nany owner or occupant of said property to resist reasonable force used by any authorized agent acting pursuant to this\nArticle.\n(4)  Whenever an emergency situation exists in relation to the enforcement of any of the provisions of this Article, a Code\nOfficial, upon a presentation of proper credentials or identification in the case of occupied property, or possession of said\ncredentials in the case of unoccupied property, may enter into any property within the jurisdiction of the City. In said\nemergency situation, such officer may use such reasonable force as may be necessary to gain entry into said property. It is\nunlawful for any owner or occupant of the property to deny entry to the Code Official or to resist reasonable force used by\nsuch officer acting pursuant to this Subsection.\nSection 5-49. Dilapidated Buildings prohibited.\n(1) It is unlawful for any person to own, occupy or have under his or her control any property with a Dilapidated Building\nlocated thereon.\n(2)  It is unlawful and an offense for any person to construct, maintain or otherwise keep a Dilapidated Building within the\nCity, or to knowingly permit, aid, abet or facilitate any of the foregoing.\nSection 5-50.  Violations; penalties; enforcement.\n(1)  Whenever in any section of this Article the doing of any act is required, prohibited or declared to be unlawful, any\nperson or entity who shall be convicted of a violation of any such section shall, for each offense, upon conviction thereof,\nbe subject to the fines and penalties set forth in Section 1-8 of this Code. Each and every day that a violation of this Article\nexists constitutes a separate and distinct offense.\n(2)  A Dilapidated Building, as defined by this Article, is hereby declared to be a public nuisance, subject to abatement by\nthe City in accordance with Article 7 of Chapter 16 of this Code.\n(3)  A violation of this Article may be prosecuted and enforced through the administrative enforcement process set forth\nunder Article 6 of this Chapter 5.\n(4)  Each and every remedy and enforcement avenue set forth under this Section is cumulative and distinct, and the City\nmay enforce this Article through any and all legal avenues available to it.\nSections 5-51 – 5-54.  Reserved.\nARTICLE 6. - ADMINISTRATIVE ENFORCEMENT\n(Ord. 2009, Article 6, enacted 5-17-16)\n Section 5-55.  Purpose.\n  This Article is intended to encourage prompt compliance with the building regulations established by this Chapter and\nprompt payment of penalties for violations thereof.  \nSection 5-56. Definitions.\n   For the purposes of this Article, the following words and phrases shall have the following meanings, unless the context\nclearly indicates otherwise.\n  Administrative hearing officer or AHO means that person or body designated by the City Manager from time to time to\nhear appeals from administrative citations issued under this Article.\n  City Manager means the City Manager or his or her designee.\n  Code Official means the Chief Building Official of the City of Trinidad or any other City official, employee or agent\ndesignated and authorized by the City Manager to enforce any provision of this Chapter 5.\n  Municipal Court means the municipal court for the City of Trinidad, Colorado.\n  Responsible Party means a person or entity who has violated this Chapter or, in the case of property subject to an\nadministrative citation under this Article, who has possession or control of any real property or premises, whether as\nowner, co-owner, occupant, tenant, lessee, mortgagee or vendee, receiver, executor, trustee or holder of any other estate or\ninterest in such property.\nSection 5-57.   Notice of violation.\n(1) Upon becoming aware of a violation of any provision of this Chapter, a Code Official may issue a notice of violation to a\nResponsible Party. The notice shall state the date and location of the violation, the approximate time the violation was\nobserved, identifying, where applicable, the property in violation by address or legal description. The notice shall refer to\nthe applicable section violated, describe the violation, and describe the action required to correct the violation. The notice\nshall require the Responsible Party to correct the violation within thirty (30) days, and shall explain the consequences of\nfailure to correct said violation, including the issuance of an administrative citation.\n(2)  Service of a notice of a violation on a Responsible Party shall be by any of the following means:\n(a)  The Code Official may personally deliver a copy of the notice of violation to a Responsible Party; or\n(b)  A copy of the notice may be mailed by first-class, certified  mail to the last known address of a Responsible Party as\nreflected in the county real estate records; or\n(c) A copy of the notice of violation may be posted in a conspicuous place at the site of the violation.\n(3)  The City’s provision of notice pursuant to paragraph (2)(b) of this section to the last known address of a Responsible\nParty as reflected in the records of the Las Animas County Assessor’s Office shall be considered adequate notwithstanding\nany error in the county's records. An officer may reasonably rely upon current county records to obtain an accurate\naddress for a Responsible Party.\n(4)  At any hearing conducted pursuant to Section 5-62, the AHO may consider evidence of actual notice received by a\nResponsible Party in determining whether adequate notice of a violation or of a citation has been provided. The AHO may\nfind that notice is adequate despite a lack of technical compliance with subsection (2) hereof upon evidence that a\nResponsible Party received actual notice of a notice of violation at least thirty (30) days prior to the issuance of an\nadministrative citation for the specified violation(s) or actual notice of an administrative citation.\n(5) Any person in charge receiving a notice of violation may request a meeting with the City Manager or City Manager\nDesignee and the Code Official to pursue a resolution as allowed per section 5-58 (6).  The Code Official shall not issue an\nadministrative citation until after such a meeting is scheduled.  The scheduling of this meeting shall not take place any\nlonger than fourteen (14) days from the issuance of the notice of violation by the Code Official unless authorized by the\nCity Manager in writing.\nSection 5-58.   Administrative citations – general provisions.\n (1) Any Responsible Party violating any provision of this Chapter 5 may be issued an administrative citation by a Code\nOfficial as provided in this Article.\n(2) Notwithstanding any other provision of this Code, Responsible Parties cited under the provisions of this Article shall\nhave only the appeal rights granted herein.\n(3)  Administrative citations shall be issued only after the Responsible Party has received a notice of violation and has been\ngiven time to comply as stated in the notice of violation.\n(4)  Each day a violation exists or continues shall constitute a separate and distinct violation for which a separate\nadministrative citation may be issued. However, once an administrative citation has been issued for a violation of an\napplicable section, no additional administrative citation shall be issued for the same violation for ten (10) days or, if the\nResponsible Party appeals, until after the appeal has been heard and the Responsible Party has not complied with an order\nof the Administrative Hearing Officer within ten (10) days of its issuance or such other time as the AHO has specified.\n(5)  A fine assessed by means of an administrative citation issued by the Code Official shall be paid to and filed with the\nOffice of the City Treasurer/Finance Director, and if not timely paid, shall be collected in accordance with the procedures\nspecified in this Article.\n(6) Enforcement actions for violations of applicable sections are intended to be alternative in nature. At any one time, the\nCity may pursue a civil, criminal, or administrative action against a Responsible Party. The City may also choose to pursue\nan alternative action upon staying the original action.\nSection 5-59.  Issuance of administrative citation.\n(1)  If a Responsible Party has failed to correct the violation noted in the notice of violation within the time provided on\nsuch notice, a Code Official may issue an administrative citation to the Responsible Party on a form approved by the City\nManager.\n(2)  The Code Official may require that the Responsible Party provide evidence of identity and residential or working\naddress.\n(3)  The Code Official shall first attempt to issue the administrative citation to a Responsible Party at the site of any\nviolation, if a Responsible Party can be located there.  However, the Code Official may issue an administrative citation to a\nResponsible Party by any of the methods described in Subsection 5-53(2) above.\n(4)  The Code Official shall attempt to obtain the signature of the person receiving the administrative citation on the\ncitation. If that person refuses or fails to sign the administrative citation, the failure or refusal to sign shall not affect the\nvalidity of the citation and subsequent proceedings.\n(5)  Notice shall be deemed served on the earliest of: (i) the date of receipt by the Responsible Party, if personally served;\n(ii) the fourth day after the mailing of the administrative citation; or (iii) the date the administrative citation was posted.\nSection 5-60.  Administrative citation – contents.\n(1)  The administrative citation shall state the location of the violation(s) and the date(s) and approximate time(s) the\nviolations were observed. Where applicable, the administrative citation shall identify the property in violation by address\nor legal description.\n(2)  The administrative citation shall refer to the applicable sections violated and describe the violations.\n(3)  The administrative citation shall describe the action required to correct the violations.\n(4) The administrative citation shall require the named Responsible Party to correct the violations immediately and shall\nexplain the consequences of failure to correct said violations.\n(5)  The administrative citation shall state the amount of fine imposed for the violation.\n(6)  The administrative citation shall explain how the fine shall be paid, the time period by which it shall be paid, and the\nconsequences of failure to pay the fine.\n(7)  The administrative citation shall briefly state the process for appealing the administrative citation.\n(8)  The administrative citation shall contain the signature of the Code Official and the signature of the Responsible Party\nif it can be obtained.\nSection 5-61.  Appeals – notice and scheduling.\n(1) A person served with an administrative citation may file a notice of appeal within five (5) business days from the service\nof the administrative citation. Compliance with this time limit shall be a jurisdictional prerequisite to any appeal brought\nunder this Article, and failure to comply shall bar any such appeal.\n(2)  The notice of appeal shall be made in writing and shall be filed with the City Clerk in person, by facsimile transmission\nor by mail. Regardless of the manner of filing such appeal, the notice of appeal must be filed with the City Clerk within five\n(5) business days from the date the administrative citation was served.\n(3)  As soon as practicable after receiving the written notice of appeal, the City Manager or City Manager designee shall\nassign an AHO who shall schedule a date, time and location for the hearing.\n(4)  Written notice of the date, time and location of the hearing shall be personally served upon or sent by certified mail to\nthe Responsible Party at least seven (7) calendar days prior to the date of the hearing. The hearing shall be held no more\nthan thirty (30) days after a timely filed notice of appeal.\n(5)  In computing the day a notice of appeal must be filed or the day by which a hearing must be held, the first day is\nexcluded and the last day is included. If the last day of any period is a Saturday, Sunday, or legal holiday, the period is\nextended to the first day thereafter which is not a Saturday, Sunday, or legal holiday.\nSection 5-62.  Conduct of appeals hearings.\n(1) Administrative appeals are intended to be informal in nature. Formal rules of evidence and discovery do not apply. The\nprocedure and format of the administrative hearing shall follow the procedures provided in this section.\n(2) The parties to an administrative appeal shall be the named Responsible Party and the City Building Department.\nParties may be represented by legal counsel. Each party may call and question witnesses, cross-examine witnesses and\npresent evidence in support of its case.\n(3)  The AHO, at the request of any party to the hearing, may subpoena witnesses, documents and other evidence where\nthe attendance of the witness or the admission of evidence is deemed necessary to decide the issues at the hearing. All\ncosts related to the subpoena, including witness and mileage fees, shall be borne by the party requesting the subpoena. The\nform of, and the process for issuing subpoenas, shall be the same as in the Municipal Court.\n(4)  The AHO shall have the power to call and question witnesses, review and consider the relevancy of documentary or\nother tangible evidence, and rule on evidentiary questions.\n(5) The only issue to be decided by the AHO is whether the Code Official exceeded his/her authority in issuing the\nadministrative citation. To do so, the City bears the burden of proof to establish the existence of a violation of the cited\nportion(s) of this Chapter. The City's meeting of this burden of proof shall constitute prima facie evidence that the Code\nOfficial did not exceed his/her authority. The appellant shall have the burden of rebutting such evidence.\n(6)  The standard of proof required in an administrative appeal is a preponderance of the evidence.\n(7)  Copies, photographs, and photocopies may be admitted into evidence or substituted in evidence in place of original\ndocuments.\n(8)  Hearings shall be recorded by electronic means and transcripts of such recordings shall be made at the expense of the\nparty requesting the transcript.\n(9)  Whenever it appears that an appeal is not filed within the time permitted by this Article, or that the AHO for some\nother reason lacks jurisdiction, the appeal may be dismissed on the motion of any party or on the AHO's own motion.\n(10)  The decision of the AHO shall be known as an administrative enforcement order.\n(11) The AHO may uphold the administrative citation and all penalties or dismiss the administrative citation and all\npenalties or may waive or conditionally reduce the penalties assessed by the administrative citation. The AHO may also\nimpose conditions and deadlines to correct the violations or require payment of any outstanding penalties.\n(12)  In the event that the AHO does not dismiss the administrative citation, the AHO shall assess reasonable\nadministrative costs of not less than one hundred dollars ($100.00), but not to exceed two hundred dollars ($200.00).\n(13)  The administrative enforcement order shall become final on the date of mailing the order to the Responsible Party. A\ncopy of the order shall be provided to the City.\nSection 5-63.  Failure to obey subpoena.\n  It is unlawful for any person to refuse to obey a subpoena issued by an AHO. Failure to obey a subpoena constitutes\ncontempt and may be criminally prosecuted and have penalties imposed in the same manner as violation of a Municipal\nCourt subpoena.\nSection 5-64.  Failure to attend administrative appeal.\n  Any Responsible Party who fails to appear at the hearing is deemed to waive the right to a hearing and the adjudication of\nthe issues related to the hearing, provided that proper notice of the hearing has been provided. The AHO may take\ntestimony, evidence and argument from the City and issue an administrative enforcement order.\nSection 5-65.  Failure to comply with administrative enforcement order.\n  It is unlawful for a Responsible Party who has been served with a copy of the final administrative enforcement order to\nfail to comply with the order. Failure to comply with a final administrative enforcement order may be criminally\nprosecuted and have penalties imposed similar to those for failure to comply with an order of the Municipal Court.\nSection 5-66.  Penalties assessed.\n(1)  The City Manager shall develop a fine schedule based upon the Manager's assessment of the cost to the City for\nenforcing the provisions of this Article. The Manager shall publish the fine schedule on the City’s web site and post the\nsame at one (1) or more conspicuous location(s) at City Hall where the same may be inspected by the public during all\nregular City business hours.  The schedule of fines shall be graduated in amount, with the smallest fine being assessed for\nthe first administrative citation and increasingly larger fines for second, third and subsequent administrative citations. No\nsingle fine assessed for an administrative citation shall exceed one thousand dollars ($1,000.00). The schedule of fines\nshall be amended no more than once per year.\n(2) If the Responsible Party fails to correct the violation, subsequent administrative citations may be issued for violations\nof the same applicable section.\n(3) Payment of the fine shall not excuse the failure to correct the violations nor shall it bar further enforcement action by\nthe City.\n(4)  All fines assessed shall be payable to the City of Trinidad.\nSection 5-67.  Failure to pay fines.\n(1) The failure of any Responsible Party to pay the fines assessed by an administrative citation within the time specified on\nthe citation or administrative enforcement order, if an administrative hearing was held, may result in the imposition of a\nlate fee of fifty dollars ($50.00), a twenty percent (20%) charge to defray the cost of collection, and interest at a rate of ten\npercent (10%) per annum on all unpaid amounts.\n(2) In the event of failure to pay all fines assessed, the City Manager may refer the matter for collection by whatever means\nare available to the City.\n(3) As authorized by C.R.S. § 31-20-105, the City may certify all delinquent charges and assessments made under this\nArticle to the treasurer of the County to be collected and paid over by the Treasurer of the County in the same manner as\ntaxes are collected.\n(4)  An action or other process provided by law may be maintained by the City to recover or collect any amounts, including\nlate fees, interests, and administrative costs, owing under this Article.\n", "Chapter 6 - [Title from PDF Content]": "Chapter 6 - Elections\nSections :\n6-1                   Nominating petition requirements; qualifications of candidates; conduct of elections.\n6-2                   Vacancies in Council or Office of Mayor.\n6-3                   Write-in candidate affidavit.\nCHAPTER 6.  ELECTIONS.\nSection 6-1.    Nominating petition requirements; qualifications of candidates; conduct of elections.\n(1)  Any candidate seeking election to the office of Mayor or City Council Person, shall appear in person before the City\nClerk and sign an affidavit of intent to seek such office.  Upon receipt of such affidavit, the City Clerk shall provide the\nperson desiring to be a candidate a petition of nomination form.  Petition of nomination forms shall be issued only to those\npersons signing the affidavit of intent, and shall contain the name and address of the affiant and shall indicate the office to\nwhich he/she is seeking election.\n(2)  The requirements for write-in candidates shall be governed by Section 6-3 of this Code.\n(3)  All other procedures for nomination of candidates for City Council or Mayor, the conduct of all elections, qualifications\nof Council Persons, the Mayor and electors, and all other matters pertaining to municipal elections shall be governed by\nthe Charter of the City of Trinidad, the \"Uniform Election Code of 1992\" and the \"Colorado Municipal Election Code of\n1965.\"  (Ord. 1486, 09/20/94.)\nSection 6-2.    Vacancies in Council or Office of Mayor.\nThe City Council shall have the power, by appointment, to fill all vacancies in the City Council and Office of Mayor, and the\nperson so appointed shall hold office until the next regular election and until his/her successor is elected and qualified.  If\nthe term of the person creating the vacancy extends beyond the next regular election, the person elected to fill the vacancy\nshall be elected for the unexpired term.\nSection 6-3.    Write-in candidate affidavit.\nNo write-in vote for any office in a regular or City Council vacancy election shall be counted unless an affidavit of intent\nhas been filed indicating that the person desires the office and is qualified to assume the duties of that office if elected.\n Such affidavit of intent shall be filed with the City Clerk prior to five days before the regular or City Council vacancy\nelection.  (Ord. 1370, 02/20/90.)\n\n", "Chapter 7 - [Title from PDF Content]": "Chapter 7 - Finance and Taxation\nARTICLE 1.  GENERAL PROVISIONS.\nSections:  \n7-1                         Bills against City - Form of claim.   \n7-2                         Presentation of bills against City; payment of salaries.   \n7-3                         Property - Taxable and exempt.   \n7-4                         Equalization of property valuation; levy.   \n7-5                         Collection of City taxes; bond of County collector.   \n7-6                         Allowance to County officers for collection of City taxes.   \n7-6.1                      Revenue changes.   \nARTICLE 2.  CITY SALES TAX ACT.    \n7-7                         Purpose of Article.   \n7-8                         Citation of Article.   \n7-9                         Definitions.   \n7-10                       Taxable transactions - Exceptions.   \n7-11                       Transactions - Out of City sales.   \n7-12                       Retailer responsible to collect and remit tax.   \n7-13                       Schedule of taxes.   \n7-14                       Credit sales.   \n7-15                       Excess tax - Collection and remittance.   \n7-16                       Retailer holds tax in trust for City.   \n7-17                       License and tax additional.   \n7-18                       False or fraudulent returns; refusal to file returns.   \n7-19                       Use of proceeds of tax.   \n7-20                       Penalty for violation.   \nARTICLE 3.  USE TAX.    \n7-21                       Purpose.   \n7-22                       Application and exemptions.   \n7-23                       Building and Construction Use Tax.   \n7-24                       Motor Vehicle Use Tax.   \nARTICLE 4.  SALES TAX SIMPLIFICATION ACT.    \n7-25                       Sales Tax - Nonapplicability.   \n7-26                       Use Tax - Nonapplicability.   \n7-27                       Sales Tax - Credit for Sales or Use Taxes previously paid to another municipality.\n7-28                       Use Tax - Credit for Sales or Use Taxes previously paid to another municipality.   \n7-29                       Use Tax - Alternative dispute resolution procedure -Deficiency notice or claim for refund.   \nARTICLE 5.  BUSINESS AND OCCUPATION TAX ON UTILITY COMPANIES.    \n7-30                       Levy of tax.   \n7-31                       Amount of tax.   \n7-32                       Payment of tax and filing statements.   \n7-33                       Failure to pay tax.   \n7-34                       Penalty for violation.   \n7-35                       Inspection of records.   \n7-36                       Credit against tax.   \n\n7-37                       Exemption from Article.   \n7-38                       Construction of Article.   \nARTICLE 6.  ECONOMIC DEVELOPMENT FUND.    \n7-39                       Economic Development Fund established.   \n7-40                       Economic Development Fund purpose.   \n7-41                       Determination of use of Economic Development Fund.   \nARTICLE 7.  LODGING TAX    \n7-42                       Lodging Tax Imposed on Transaction of Furnishing Rooms or Accommodations/Exceptions.   \n7-43                       Point of Imposition.   \n7-44                       Administration.   \n7-45                       Persons Liable/Remittance of Tax.   \n7-46                       City Lodging Tax Fund.   \n7-47                       Lodging Tax Advisory Board.    \nARTICLE 8. PURCHASES    \n7-50                       Small purchases   \n7-51                       Purchases based on informal bids   \n7-52                       Purchases based on formal bids   \n7-53                       Exceptions   \nARTICLE 9.  RESPONSIBLE FINANCIAL MANAGEMENT.   \n7-54                       Responsible Financial Management Funding   \nCHAPTER 7.  FINANCE AND TAXATION.     \nARTICLE 1.  GENERAL PROVISIONS.    \nSection 7-1.    Bills against City - Form of claim.   \n    \n(1)  All bills against the City shall be presented in the form of an itemized account, stating specifically the nature of the\nindebtedness and shall be sworn to by the claimant, his/her agent or attorney, before the City Clerk, or some other person\nduly authorized by law to administer oaths, which affidavit may be in the following form:\n\"STATE OF COLORADO    \n    COUNTY OF LAS ANIMAS\"  ss.\n   \nI, A.B., on oath, state that the foregoing account is just and due, and no part thereof   \nhas been paid (except ________________) and that it comprises all claims I have   \nagainst the City of Trinidad to date.\"   \n(2)  If the claim is for a fixed salary or for any certain sum by contract with the City Council, the account need not be sworn\nto.  All such bills shall be read in open session of the Council, and may be allowed, rejected, referred to any appropriate\ncommittee, or otherwise disposed of, as the Council may direct.  (Ord. 1958, Sec. 26-2.)   \nSection 7-2.    Presentation of bills against City; payment of salaries.       \n   (1)  All bills against the City shall be presented for approval, auditing and allowance at regular meetings of the City\nCouncil.   \n   (2)  The City Manager is authorized to make payment of salaries and wages to all City employees every two weeks after\ncompletion of proper payroll or time cards have been approved by the respective department heads or immediate\nsupervisors of said employees.  Such salaries and wages shall be computed upon fourteen (14) calendar day periods\nreflecting the work hours or authorized leave time of each respective employee.  All such payroll shall be approved by the\nCity Council as now provided for by ordinance, and the same shall be approved at regular meetings of the City Council.      \n     State law references:    As to the powers of the City to levy taxes, see C.R.S. 1973, Sec. 31-15-302; as to finance matters\ngenerally see C.R.S. 1973, Title 31, Art. 20.    \nSection 7-3.    Property - Taxable and exempt.   \n     \n   The same amount and property, real and personal, shall be exempt from assessment and taxation for City purposes, as\nare now or may hereafter be exempt by general law from assessment and taxation for County purposes; and all property\nwithin the City that is subject to assessment and taxation for County purposes shall be subject to assessment and taxation\nfor City purposes.  (Ord. 1958, Sec. 26-5.)   \nSection 7-4.    Equalization of property valuation; levy.   \n    \n   When the equalization of the value of property within the City shall have been completed each year by the County\nCommissioners of Las Animas County, as required by law, it shall be the duty of the City Clerk to correct the duplicate\nreturn of such property made to the City Council by the Assessor, in accordance with the changes in the valuation of the\nsame adopted by the County Commissioners.  The City Council shall by resolution levy upon the real and personal\nproperty described in such amended return such sum or sums as may be required for any purpose for which it may be\nauthorized to levy taxes, and it shall therein specify the rate of taxation as fixed by it for City purposes upon all property\nwithin the City.  The City Clerk shall then certify a copy of such resolution to the County Assessor who shall proceed to\nextend upon the tax lists of the current year as required by law.  (Ord. 1958, Sec. 26-6.)   \n     State law reference:    As to levy and limitations thereon, see C.R.S. 1973, Sec. 29-1-301.    \nSection 7-5.    Collection of City taxes; bond of County collectors.   \n   The County Treasurer or other County collector of County taxes shall collect the City taxes at the same time he/she\ncollects other taxes.  He/she shall give such bond as may be fixed by ordinance, and he/she shall pay over all taxes\ncollected for the City to the City Finance Director at the end of each month, upon presentation to him/her of an order\nsigned by the Mayor and City Clerk.  He/she shall be liable upon his/her official bond as County Treasurer for the faithful\ndischarge of all the duties and obligations imposed by law.  (Ord. 1958, Sec. 26-7.)   \n     State law reference:    As to provisions pertaining to collection of City taxes by County Treasurer, see C.R.S. 1973,\nSec, 31-20-106.    \nSection 7-6.    Allowance to County officers for collection of City taxes. \n   The City Council each year shall make such allowance, to be paid out of the general fund as shall be reasonable and just\nto the County officers as compensation for the extra labor imposed by this Article or general law of the State, and shall pay\nsuch other charges as by law may pertain to the collection of the City taxes.  (Ord. 1958, Sec. 26-8.)  \n     State law reference:    As to City's share of expenses of County officers, see C.R.S. 1973, Sec. 31-20-107.    \nSection 7-6.1. Revenue changes.   \n   Pursuant to Article X, Section 20 of the Colorado Constitution, the qualified electors of the City of Trinidad authorize the\nCity to collect, retain and expend all sales tax, use tax, and property tax revenues, and all Non-Federal grants, fees and\nother revenues for capital projects and other basic municipal services, notwithstanding any state restriction on fiscal year\nspending, including without limitation the restrictions of Article X, Section 20 of the Colorado Constitution on and after\nJanuary 1, 1995. Nothing in this section shall be interpreted to authorize any increase in the rate of taxation of the sales\nand use tax, or property tax, without a vote of the people if and when required pursuant to Article X, Section 20 of the\nColorado Constitution. (Ord. 1514, 8-12-1995.)   \nARTICLE 2.  CITY SALES TAX ACT.    \nSection 7-7.    Purpose of Article.  \n \n  The purpose of this Article is to impose a sales tax on the sale of tangible personal property at retail and the furnishing of\nservices within the City. (Repealed and reenacted, Ord. 2080, eff. 8-16-19)\n \nSection 7-8.    Citation of Article.   \n   \n   This Article shall be known as the \"City Sales Tax Act\" and may be cited as such.  (Ord. 1181, Sec. 2, 10/4/80.)   \nSection 7-9.    Definitions.   \nAs used herein:   \n   (1)  City Clerk  shall mean the Clerk of the City of Trinidad.  \n   (2)  City Treasurer  shall mean the Treasurer of the City of Trinidad.\n     \n   (3)  Doing business or engaging in business  shall mean the selling, leasing or delivering in the City any activity in the\nCity in connection with the selling, leasing, or delivery in the City, of tangible personal property by the retail sale as\ndefined in this section, for use, storage, distribution or consumption within the City.  This term includes, but shall not be\nlimited to the following acts or methods of transacting business.   \n   (a)  The maintaining within the City, directly or indirectly or by a subsidiary, of an office, distributing house,\nsalesroom or house, warehouse, or other place of business;   \n     \n   (b)  The soliciting whether by direct representatives, indirect representatives, manufacturer's agents or by\ndistribution of catalogues or other advertising or by use of any communication media or by use of the newspaper,\nradio or television advertising media, or by any other means whatsoever, of business from persons residing in the\nCity, and by reason thereof receiving orders from, or selling or leasing tangible personal property to, such persons\nresiding in the City for use, consumption, distribution and storage for use and consumption in the City.   \n   (4)  Executive Director  shall mean the executive director of the Department of Revenue of the State of Colorado.   \n   (5)  Retail sale  shall mean all sales made within the City except wholesale sales.   \n   The definition of all other words, terms and phrases shall be as defined in Section 102, Article 26, Title 39, C.R.S. 1973 as\namended, and said definitions are incorporated herein by reference.  (Ord. 1398, Sec. 2, 6/18/91., Ord. 1539, Sec. 2, 8-31-\n1996.)   \n   (6) Repealed (Ord. 1539, Sec. 7-9, eff. 8/31/96)   \nSection 7-10.  Taxable Transactions - Exemptions.   \n \n(1) There is hereby levied and shall be collected and paid a tax in the amount stated in Section 7-13 of this Article on the\nsale of tangible personal property at retail and the furnishing of services within the City.  The tangible personal property\nand services taxable pursuant to this Article shall be the same as the tangible personal property and services taxable\npursuant to Section 39-26-104, C.R.S., and subject to the same exemptions as those specified in Section 39-26-713, C.R.S.,\nexcept the exemption allowed by Section 39-26-709, C.R.S. for purchases of machinery or machine tools, the exemptions\nof sales and purchases of those items in Section 39-26-715(1)(a)(II), C.R.S., the exemption for sales of food specified in\nSection 39-26-707, C.R.S., the exemptions for vending machine sales of food set forth in Section 39-26-714(1)(b), C.R.S.,\nthe exemption for occasional sales by a charitable organization set forth in Section 39-26-718, C.R.S., the exemption for\nsales and purchases of farm equipment and farm equipment under lease or contract specified in Section 39-26-716(2)(3)\n(4), C.R.S., and the exemption for sales of low-emitting motor vehicles, power sources, or parts used for converting such\npower sources as specified in Section 39-26-719, C.R.S. (Repealed and reenacted, Ord. 2080, eff. 8-16-19)\n(2) All sales of personal property on which a specific ownership tax has been paid or is payable shall be exempt from the\ntax imposed by this Article when such sales meet both of the following conditions: \n                        (a)       The purchaser is a non-resident of or has his/her principal place of business outside of the City;\nand\n                        (b)       Such personal property is registered or required to be registered outside the City limits under the\nlaws of the State of Colorado. (Repealed and reenacted, Ord. 2080, eff. 8-16-19)\n(3) The amount subject to tax shall not include the amount of any sales or use tax imposed by Article 26 of Title 39, C.R.S.\n(Repealed and reenacted, Ord. 2080, eff. 8-16-19)\n   (4)    This sales tax shall not apply to the sale of construction and building materials, as the term is used in C.R.S. 29-2-\n109, if such materials are picked up by the purchaser and if the purchaser of such materials presents to the retailer a\nbuilding permit or other documentation acceptable to the City evidencing that a local use tax has been paid or is required\nto be paid.   \n   (5)    This sales tax shall not apply to the sale of tangible personal property at retail or the furnishing of services if the\ntransaction was previously subjected to a sales or use tax lawfully imposed on the purchaser or user by another statutory\nor home rule city and county, city, or town equal to or in excess of that sought to be imposed by this City.  A credit shall be\ngranted against the sales tax imposed by this City with respect to such transaction equal in amount to the lawfully imposed\nlocal sales or use tax previously paid by the purchaser or user to the previous statutory or home rule city and county, city\nor town.  The amount of the credit shall not exceed the sales tax imposed by this City.  (Ord. 1398, Sec. 2, 9/3/91.)   \n(6) This sales tax shall not apply to the sale of food purchased with food stamps.  For the purpose of this subsection (6),\n\"food\" shall have the same meaning as provided in 7 U.S.C. Section 2012(g), as such section existed on October 1, 1987, or\nas thereafter amended. (Repealed and reenacted, Ord. 2080, eff. 8-16-19)\n(7) This sales tax shall not apply to the sale of food purchased with funds provided by the special supplemental food\nprogram of women, infants, and children, 42 U.S.C., 1786.  For purposes of this subsection (7), \"food\" shall have the same\nmeaning as provided in 42 U.S.C. Section 1786, as such section existed on October 1, 1987, or as thereafter amended.\n(Repealed and reenacted, Ord. 2080, eff. 8-16-19)\nSection 7-11.  Transactions - Out of City sales.   \n \n   (1)  All retail sales are deemed to be consummated at the place of doing business of the retailer unless the tangible\npersonal property sold is delivered by the retailer or his/her agent to a destination outside the City limits or to a common\ncarrier for delivery to a destination outside the City limits.   \n   (2)  The gross receipts from sales consummated outside the City limits shall include delivery charges when such charges\nare subject to state sales and use tax imposed by Article 26, Title 39, C.R.S. 1973, regardless of the place to which delivery\nis made.   \n   (3)  In the event a retailer has no permanent place of business in the City, or has more than one place of business, the\nplace at which the retail sales are consummated for the purpose of this Article shall be determined by the provisions of\nArticle 26, Title 39, C.R.S. 1973, as amended, and by the rules and regulations promulgated by the Department of Revenue\nof the State of Colorado.  (Ord. 1398, Sec. 2, 9/3/91.)   \nSection 7-12.  Retailer responsible to collect and remit tax.   \n   (1)  Every retailer shall, irrespective of the provisions of Section 7-13 of this Article, be liable and responsible for the\npayment of an amount equivalent to the amount specified in Section 7-13 of this Article.   \n   (2)  Every retailer shall remit the amount specified in subsection (1) of this section to the executive director. The\ncollection, administration and enforcement of the tax imposed by this Article shall be performed by the executive director\nin the same manner as the collection, administration and enforcement of the Colorado state sales tax.  Unless otherwise\nprovided in Article 2, Title 29, C.R.S. 1973, as amended, the provisions of Article 26, Title 39, C.R.S. 1973, as amended,\nshall govern the collection, administration and enforcement of the tax imposed by this Article.  (Ord. 1181, 10/4/80.)   \nSection 7-13.  Schedule of taxes.    (Ord. 1857, Sec. 7-13 repealed and reenacted, eff. 6/27/08)  \n(1)      There is hereby imposed upon sales of tangible personal property and the furnishing of services as specified in\nSection 7-10 of this Article a tax at the rate of four percent (4%) of the amount of sale, to be computed in accordance with\nschedules or systems approved by the executive director. (Repealed and reenacted, Ord. 2080, eff. 8-16-19)\n(2)  Except as provided in subsection (3) of this Section, the retailer shall add the tax imposed hereby or the average\nequivalent thereof to the sale price or charge, showing such tax as a separate and distinct item, and when added, such tax\nshall constitute a part of such price or charge and shall be a debt from the consumer or user to the retailer until paid and\nshall be recoverable at law in the same manner as other debts.  \n(3)  Any retailer selling malt, vinous and spirituous liquors by the drink may include in his/her sales price the tax levied by\nthis Article, except that no such retailer shall advertise or hold out to the public in any manner directly or indirectly, that\nsuch tax is not included as part of the sales price to the consumer.  The schedules described in subsection (1) of this Section\nshall be used by such retailer in determining the amounts to be included in such sales price.  Use of the schedules set forth\nin subsection (1) of this section shall not relieve such retailer from liability for payment of the full amount of tax levied by\nthis Article.   \n(4)  Every retailer shall be entitled, as collecting agent of the City, to apply and credit the amount of his/her collections\nagainst the amount paid by him/her under the provisions of Section 7-15, remitting any excess collections over said\namount less the expense allowance provided in subsection (5) of this section, to the executive director.   \n(5)  Every retailer may deduct three and one-third percent (3 1/3%) of the amount of tax to be paid by him/her under this\nArticle to cover his/her expense of collection and remittance of the tax.   \n(6)  The amount of sale subject to tax under this Article shall not include the amount of any sales or use tax imposed by\nArticle 26, Title 39, C.R.S.  (Ord. 1398, Sec. 2, 9/3/91.)   \nSection 7-14.  Credit sales.   \n  \n   (1)  In case of a sale upon credit, or a contract for sale wherein it is provided that the price shall be paid in installments\nand title does not pass until a future date, or a chattel mortgage or a conditional sale, there shall be paid upon each\npayment, upon the account of purchase price, that portion of the total tax which the amount paid bears in the total\npurchase price.  Notwithstanding any other provision of this subsection (1), a retailer doing business wholly or partly on a\ncredit basis may, at his/her election, make a return, and remit sales tax on credit sales, on the basis of the aggregate\namount of cash received during the month from taxable credit sales.  The retailer may determine the tax to be remitted on\nthe basis of his/her reasonable estimate of the aggregate amount of tax which he/she has collected from his/her credit\nconsumers during the month.  A retailer's estimate of the taxes to be collected on credit sales made in any month (referred\nto in this section as \"base month\") shall be deemed reasonable if the cumulative sum of the monthly amounts of taxes on\nsuch credit sales remitted by the retailer on months following the base month is not less than twenty-five percent, forty-\nthree and seventy-five one-hundredths percent, sixty-two and five-tenths percent, respectively, of the total taxes due on\nthe aggregate credit sales made by the retailer in the base month.  In no event, however, shall the amount of taxes remitted\nby the retailer in any month be less than the amount which the retailer actually estimates to have been collected in that\nmonth.   \n   (2)  If the retailer transfers, sells, assigns or otherwise imposes of an account receivable, he/she shall be deemed to have\nreceived the full balance of the consideration for the original sale and shall be liable for the remittance of the sales tax on\nthe balance of the total sale price not previously reported; except that such transfer, sale, assignment, or other disposition\nof an account receivable by a retailer to a closely held subsidiary, as defined in section 39-26-102 (10)(k), C.R.S. 1973 as\namended, shall not be deemed to require the retailer to pay the sales tax on the credit sale represented by the account\ntransferred prior to the time the customer makes payment on said account.  (Ord. 1181, 10/4/80.)   \nSection 7-15.  Excess tax - Collection and remittance.   \n \n   If any vendor, during any reporting period, collects as a tax an amount in excess of four percent of his/her total taxable\nsales, he/she shall remit to the executive director of the department of revenue, the full net amount of the tax imposed in\nthis Article 2 and all such excess.  The retention by the retailer or vendor of any excess of tax collections over the four\npercent of the total taxable sales of such retailer or vendor or the intentional failure to remit punctually to the executive\ndirector the full amount required to be remitted by the provisions of this Article is declared to be unlawful and constitutes\na violation of this Article.   \nSection 7-16.  Retailer holds tax in trust for City.\n   All sums of money paid by the purchaser to the retailer as taxes imposed by this Article shall be and remain public\nmoney, the property of the City, in the hands of such retailer or vendor, and he/she shall hold the same in trust for the sole\nuse and benefit of the City until paid to the executive director, and failure to so pay the executive director, such retailer\nshall be punished as provided herein. (Ord. 1181, 10/4/80.)   \nSection 7-17.  License and tax additional.   \n \n   The license and tax imposed by this Article shall be in addition to all other licenses and taxes imposed by law, except as\nherein provided.  (Ord. 1181, 10/4/80.)   \nSection 7-18.  False or fraudulent returns; refusal to file returns.        \n   It shall be unlawful for any retailer to refuse to file any returns provided to be filed in this Article, or to file any false or\nfraudulent return, or fail or refuse to make payment to the executive director of any taxes collected or due the City or in\nany manner evade the collection and payment of the tax or any part thereof, or for any person or purchaser to fail or refuse\nto pay such tax or evade the payment thereof, or to aid or abet another in any attempt to evade the payment of the tax.\n (Ord. 1181, 10/4/80.)   \nSection 7-19.  Use of proceeds of tax.   \n  \n(1)  Tax Monies collected pursuant to this Article shall be used as follows:   \n        (a)  A Sum equal to seventy-five percent (75%) of the amount collected shall be deposited in the general fund of\nthe City.  \n   \n       (b)  The sum equal to the remaining twenty-five percent (25%) of the amount shall be set aside in a reserve fund\nand shall be used to pay for capital projects, including the construction, maintenance and improvement of public\nworks, the purchase of land and buildings, and capital purchases, as determined by City Council. City Council shall\nhold at least one public hearing per year for the purpose of providing an opportunity for the public to express\nopinions as to how such monies should be spent. (Repealed and reenacted, Ord. 2080, eff. 8-16-19)   \n(2)  The allocation of the tax monies collected pursuant to this Article set forth in subsection (1) of this Section, shall\nremain in effect until December 31, 2026.  Unless the one percent (1%) sales tax to be used for capital projects is extended\nby vote of the people prior to that date, the rate of sales tax shall decrease to three percent (3%) on January 1, 2027, and\nfrom that date forward all tax monies collected pursuant to this Article shall be deposited in the general fund of the City.\n(Repealed and reenacted, Ord. 2080, eff. 8-16-19)   \nSection 7-20.  Penalty for violation.   \n \n   Any person who shall violate any of the provisions of this Article shall be guilty of violation thereof and shall be punished\nby a fine not to exceed Three Hundred Dollars ($300.00) or imprisonment not to exceed ninety (90) days, or both such\nfine and imprisonment.  (Ord. 1181, 10/4/80.)   \nARTICLE 3.  USE TAX.    \nSection 7-21.  Purpose.       \n   The purpose of this Article is to raise revenue and provide a complementary tax to the Trinidad City Sales Tax. The tax\nimposed herein is a Use Tax on building and construction materials which are purchased outside the City of Trinidad by\nCity residents for use, storage or consumption within the City of Trinidad, and on motor vehicles which are purchased\noutside the City of Trinidad by City residents for use, storage or consumption within the City of Trinidad.   \nSection 7-22.  Application and exemptions.   \nIn no event shall the Use Tax imposed by this Article extend or apply:   \n   (1)  To the storage, use or consumption of any tangible personal property, the sale of which is subject to a retail\nsales tax imposed by the City of Trinidad.   \n     \n   (2)  To the storage, use or consumption of any tangible personal property purchased for resale in the City of\nTrinidad, either in its original form or as an ingredient of a manufactured or compounded product, in the regular\ncourse of a business;   \n     \n   (3)  To the storage, use or consumption of tangible personal property brought into the City of Trinidad by a\nnonresident thereof for his/her own storage, use or consumption while temporarily within the City of Trinidad;   \n     \n   (4)  To the storage, use or consumption of tangible personal property by the United States government, or the State\nof Colorado, or its institutions, or its political subdivisions in their governmental capacities only or by religious or\ncharitable functions;   \n     \n   (5)  To the storage, use or consumption of tangible personal property by a person engaged in the business of\nmanufacturing, compounding for sale, profit, or use any article, substance, or commodity, which tangible personal\nproperty enters into the processing of or becomes an ingredient or component part of the product or service which is\nmanufactured, compounded or furnished and the container, label, or the furnished shipping case thereof;   \n     \n   (6)  To the storage, use, or consumption of any article of tangible personal property the sale or use of which has\nalready been subjected to a legally imposed sales or use tax of another statutory or home rule town, city or city and\ncounty equal to or in excess of that imposed by this Ordinance.  A credit shall be granted against the use tax imposed\nby this Ordinance with respect to a person's storage, use or consumption in the City of Trinidad of tangible personal\nproperty purchased by him/her in a previous statutory or home rule town, city, or city and county.  The amount of\nthe city credit shall be equal to the tax paid by him/her by reason of the imposition of a sales or use tax of the\nprevious statutory or home rule town, city, or city and county on his/her purchase or use of the property.  The\namount of the credit shall not exceed the tax imposed by this ordinance.   \n     \n   (7)  To the storage, use or consumption of tangible personal property and household effects acquired outside of the\nCity of Trinidad and brought into it by a non-resident acquiring residency;   \n     \n   (8)  To the storage or use of a motor vehicle if the owner is or was, at the time of purchase, a nonresident of the City\nof Trinidad, and he/she purchased the vehicle outside the City of Trinidad for use outside the City of Trinidad and\nactually so used it for a substantial and primary purpose for which it was acquired and he/she registered, titled and\nlicensed said motor vehicle outside of the City of Trinidad;   \n     \n   (9)  To the storage, use or consumption of any construction and building materials and motor and other vehicles on\nwhich registration is required, if a written contract for the purchase thereof was entered into prior to the effective\ndate of such use tax;   \n     \n   (10)  To the storage, use or consumption of any construction and building materials required or made necessary in\nthe performance of any construction contract bid, let or entered into at any time prior to the effective date of such\nuse tax ordinance or proposal.  (Ord. 1325, Sec. 2, 8/18/87.)   \nSection 7-23.  Building and Construction Use Tax.        \n   (1)  There is hereby imposed on the privilege of storing, using or consuming any construction and building materials of\nevery kind and form purchased outside the City of Trinidad, for use, storage or consumption within the City of Trinidad, a\nUse Tax of four percent (4%) of the purchase price of said construction or building materials.  (Ord. 1325, Sec. 2, 8/18/87.)\n       \n   (2)  Said Use Tax shall be paid by estimate through payment to the City an amount equal to fifty percent (50%) of the\ntotal cost of the project as indicated on the application for a city building permit and shall be evidenced by the issuance of a\nbuilding permit by the City Building Inspector.  Provided, however, the City shall, when necessary, issue a certificate of\nexemption from payment of any further sales or use tax for the materials to be used, stored or consumed pursuant to such\nbuilding permit.  \n  \n   (3)  The collection and administration of the Use Tax imposed by this Section shall be performed by the Treasurer in\nsubstantially the same manner as the collection, administration and enforcement of the Colorado Sales and Use Tax as\nprovided in Article 26, Chapter 39, Colorado Revised Statutes.  The City Manager is hereby authorized to promulgate such\nadditional rules and regulations as may be necessary for the proper administration of enforcement of this section.   \nSection 7-24.  Motor Vehicle Use Tax.   \n \n   (1)  There is hereby imposed on the privilege of using, storing, or consuming every motor vehicle purchased outside this\ncity by any resident of this City for the purpose of use, storage or consumption within this City, a Use Tax in the amount of\nfour percent (4%) of the purchase price of said motor vehicle.  (Ord. 1325, Sec. 2, 8/18/87.)        \n   (2)  Said Use Tax shall be applicable to every motor vehicle for which registration is required by the laws of the State of\nColorado.   \n \n   (3)  No registration shall be made of any motor vehicle for which registration is required, and no certificate of title shall\nbe issued for such vehicle by the Department of Revenue or its authorized agents, until any tax due upon the use, storage\nor consumption thereof pursuant to this Ordinance has been paid.   \n   (4)  The Use Tax imposed by this section shall be collected by the authorized agent of the Department of Revenue in the\nCounty in which the purchaser resides.   \n   (5)  The proceeds of said Use Tax shall be paid to the City periodically in accordance with an agreement entered by and\nbetween the City and the authorized County Agent of the Department of Revenue.   \n   (6)  The City Manager and the Mayor are hereby empowered to enter into and execute on behalf of the City any\nagreements necessary for the administration and enforcement of this Section in accordance with the provisions of Section\n24-35-110, Colorado Revised Statutes.   \nARTICLE 4.  SALES TAX SIMPLIFICATION ACT.    \nSection 7-25.  Sales Tax - Nonapplicability.   \n  \n   For transactions consummated on or after January 1, 1986, the City's sales tax shall not apply to the sales of construction\nand building materials, as the term is used in 29-2-109, C.R.S., if such materials are picked up by the purchaser and if the\npurchaser of such materials presents to the retailer a building permit or other documentation acceptable to the City\nevidencing that a local use tax has been paid or is required to be paid.  (Ord. 1285, Sec. 1, 12/17/85.)   \nSection 7-26.  Use Tax - Nonapplicability.   \n \n   For transactions consummated on or after January 1, 1986, the City's use tax shall not apply to the storage of\nconstruction and building materials.  (Ord. 1285, Sec. 1, 12/17/85.)   \nSection 7-27.  Sales Tax - Credit for Sales or Use Taxes previously paid to another municipality.    \n   For transactions consummated on or after January 1, 1986, the City's sales tax shall not apply to the sale of tangible\npersonal property at retail or the furnishing of services if the transaction was previously subjected to a sales or use tax\nlawfully imposed on the purchaser or user by another statutory or home rule municipality equal to or in excess of four\npercent (4%).  A credit shall be granted against the City's sales tax with respect to such transaction equal in amount to the\nlawfully imposed local sales or use tax previously paid by the purchaser or user to the previous statutory or home rule\nmunicipality.  The amount of the credit shall not exceed four percent (4%).  (Ord. 1285, Sec. 1, 12/17/85.)   \nSection 7-28.  Use Tax - Credit for Sales or Use Taxes previously paid to another municipality.        \n   For transactions consummated on or after January 1, 1986, the City's Use Tax shall not apply to the storage, use, or\nconsumption of tangible personal property the sale of which has already been subjected to a legally imposed Sales or Use\nTax of another statutory or home rule municipality equal to or in excess of four percent (4%).  A credit shall be granted\nagainst the City's Use Tax with respect to a person's storage, use, or consumption in the City of tangible personal property\npurchased by him/her in a previous statutory or home rule municipality.  The amount of the credit shall be equal to the tax\npaid by him/her by reason of the imposition of a sales or use tax of the previous statutory or home rule municipality on\nhis/her purchase or use of the property.  The amount of the credit shall not exceed four percent (4%).   \nSection 7-29.  Use Tax - Alternative dispute resolution procedure - Deficiency notice or claim for refund.  \n    \n   (1)  For transactions consummated on or after January 1, 1986, the taxpayer may elect a state hearing on the City\nManager's or his/her designee's final decision on a deficiency notice or claim for refund pursuant to the procedure set\nforth in this Section.   \n   (2)  As used in this Section, \"state hearing\" means a hearing before the Executive Director of the Department of Revenue\nor delegate thereof as provided in 29-2-106.1 (3), C.R.S.   \n   (3)  When the City asserts that use taxes are due in an amount greater than the amount paid by a taxpayer, the City shall\nmail a deficiency notice to the taxpayer by certified mail.  The deficiency notice shall state the additional use taxes due.\n The deficiency notice shall contain a notification, in clear and conspicuous type, that the taxpayer has the right to elect a\nstate hearing on the deficiency pursuant to 29-2-106.1 (3), C.R.S.  The taxpayer shall also have the right to elect a state\nhearing on the City's denial of such taxpayer's claim for a refund of use tax paid.   \n   (4)  The taxpayer shall request the state hearing within thirty days after the taxpayer's exhaustion of local remedies.  The\ntaxpayer shall have no right to such hearing if he/she has not exhausted local remedies or if he/she fails to request such\nhearing within the time period provided for in this subsection (4).  For purposes of this subsection (4), \"exhaustion of local\nremedies\" means:   \n   (a)  The taxpayer has timely requested in writing a hearing before the City and such City has held such hearing and\nissued a final decision thereon.  Such hearing shall be informal and no transcript, rules of evidence, or filing of briefs\nshall be required; but the taxpayer may elect to submit a brief, in which case the City may submit a brief.  The City\nshall hold such hearing and issue the final decision thereon within ninety days after the City's receipt of the\ntaxpayer's written request therefor, except the City may extend such period if the delay in holding the hearing or\nissuing the decision thereon was occasioned by the taxpayer, but, in any event, the City shall hold such hearing and\nissue the decision thereon within one hundred eighty days of the taxpayer's request in writing therefor; or   \n     \n   (b)  The taxpayer has timely requested in writing a hearing before the City and the City has failed to hold such\nhearing or has failed to issue a final decision thereon within the time periods prescribed in paragraph (a) above.   \n   (5)  If a taxpayer has exhausted his/her local remedies as provided in subsection (4) above, the taxpayer may request a\nstate hearing on such deficiency notice or claim for refund, and such request shall be made and such hearing shall be\nconducted in the same manner as set forth in Section 29-2-106.1 (3) through (7), C.R.S.   \n   (6)  If the deficiency notice or claim for refund involves only the City, in lieu of requesting a state hearing, the taxpayer\nmay appeal such deficiency notice or denial of a claim for refund to the District Court of the County of Las Animas as\nprovided in 29-2-106 (8), C.R.S., provided the taxpayer complies with the procedures set forth in subsection (4) of this\nsection.   \n   (7)  If the City reasonably finds that the collection of Use Tax will be jeopardized by delay, the City may utilize the\nprocedures set forth in section 39-21-111, C.R.S.   \nARTICLE 5 . BUSINESS AND OCCUPATION TAX ON UTILITY COMPANIES.    \nSection 7-30.  Levy of tax.   \n \n   There is levied on and against utility companies operating within the City a tax on the occupation and business of:   \n   (1)  Maintaining a telephone exchange and lines connected therewith in the City and of supplying local exchange\ntelephone service to the inhabitants of the City;   \n   (2)  Maintaining and operating within the City a plant for the transmission and distribution of artificial or natural gas, or\na mixture thereof, and of furnishing either or both of said products to the inhabitants of the City; and   \n   (3)  Maintaining and operating within the City a plant for the transmission and distribution of electrical energy and of\nfurnishing and distributing electricity or electrical energy to the inhabitants of the City.   \nSection 7-31.  Amount of tax.   \n   That the amount of tax hereby levied for 1978 shall be a flat sum in the amount of Thirty Eight Thousand Two Hundred\nDollars ($38,200.00), and for years subsequent to 1978, Two and 75/100 Dollars ($2.75) annually for each telephone\naccount for which local exchange service is provided within the City of Trinidad, as provided in Section 2 of this Ordinance\nNo. 998, Series 1971.   \nSection 7-32.  Payment of tax and filing statements.   \n \n   (1)  The tax levied by this Ordinance No. 988, Series 1971, which were made under protest or accrued by telephone\nutilities, shall be applied against the flat fee tax for 1978.  Payment of the 1978 tax shall be made fifty percent (50%) on\nJuly 31, 1978 and fifty percent (50%) on or before October 31, 1978 and for years subsequent to 1978, the tax shall be\npayable in twelve (12) equal monthly installments each installment to be payable on the last business day of each calendar\nmonth.   \n   (2)  Within fifteen (15) days after the effective date of this Ordinance, each telephone utility subject to the tax imposed\nherein shall file with the Clerk in such form as the Clerk may require, a statement showing the total number of telephone\naccounts for which local exchange telephone service was provided within the City on January 1, 1978.  Such statements\nshall be filed in each subsequent year within fifteen (15) days after January 1, showing the total number of such accounts\non January 1.   \nSection 7-33.  Failure to pay tax.   \n \n   If any utility company subject to this Article shall fail to pay the taxes as herein provided, the full amount thereof shall be\ndue and collected from such company, and the same, together with an addition of ten (10%) percent of the amount of taxes\ndue, shall be and hereby is declared to be a debt due and owing from such company to the City.  The City Attorney upon\nthe direction of the City Council, shall commence and prosecute to final judgment and determination in any court of\ncompetent jurisdiction an action at law to collect the said debt in the name of the people of the State. (Ord. 988, Sec. 4,\n12/6/71.)   \nSection 7-34.  Penalty for violation.   \n \n   If any officer, agent or manager of a utility company which is subject to the provisions of this Article shall fail, neglect or\nrefuse to make or file any quarterly statement in the manner herein prescribed, the said officer, agent, or manager shall, on\nconviction thereof, be punished by a fine of not less than Twenty Five Dollars ($25.00) nor more than Three Hundred\nDollars ($300.00).  (Ord. 988, Sec. 5, 12/6/71.)   \nSection 7-35.  Inspection of records.   \n  \n   The City, its officers, agents or representatives shall have the right at all reasonable hours and times to examine the\nbooks and records of the utility companies which are subject to the provisions of this Article and to make copies of the\nentries or contents thereof.  (Ord. 988, Sec. 6, 12/6/71.)   \nSection 7-36.  Credit against tax.   \n  \n   Any utility company maintaining facilities within the City pursuant to a franchise granted by the City may claim as a\ncredit against the tax levied by this Article the amount of any franchise payments made in accordance with the terms of\nsuch franchise.  (Ord. 988, Sec. 7, 12/6/71.)   \nSection 7-37.  Exemption from Article.   \n \n   The provisions of this Article shall not apply to any utility owned and operated by the City.  (Ord. 988, Sec. 8, 12/6/71.)   \nSection 7-38.  Construction of Article.   \n  \n   This Article shall not be construed as granting a franchise or franchise rights to any utility company.  (Ord. 988, Sec. 9,\n12/6/71.)   \nARTICLE 6.  ECONOMIC DEVELOPMENT INCENTIVES    \nSection 7-39. Economic Development Incentives.  \n(1)    Development incentives may be considered as follows to encourage business location or the creation of deed\nrestricted workforce housing that will result in economic growth for the City:\n1. Conveyance of real property owned by the City at no or reduced consideration;\n2. Reduction, deferment, or abatement of outstanding property tax;\n3. Refund of general property tax, pursuant to CRS 39-30-107.5(1); \n4. Refund of personal property tax, pursuant to CRS 31-15-903; \n5. Property tax credit or Incentive Payment, pursuant to HB 02-1399;\n6. Refund of sales tax levied by the City, pursuant to CRS 39-30-107.5(2);\n7. Waiver or reduction of both deed-restricted affordable workforce housing and commercial permit fees; \n8. Waiver or reduction of utility tap fees for both deed-restricted affordable workforce housing and commercial\ndevelopment;\n9. Any other incentive deemed appropriate not specifically identified herein.\nSection 7-40. Economic Development Incentive Considerations.   \n(1)  In making an initial determination as to the appropriateness and extent of a development incentive offer and whether\nit is in the best interest of the City, the following factors shall be considered:\n1. The size and fair market value of the improvements, number of deed restricted units, and business facilities that are\nproposed to be located in the City.\n2. The number of employees that are proposed to be employed at the business site, the proposed educational and/or\ntraining requirements of the employees to be employed, whether or not the employees will be those already\nretained by the business or will be recruited from the City and the surrounding communities, and the projected\nsalaries of the employees.\n3. Workforce intended to be served by affordable housing, deed restrictions to protect long-term affordability, reuse\nor rehabilitation of vacant or dilapidated property, or impacts to increasing the city’s existing housing stock.\n4. The impact that the proposed business will have on the City’s resources and infrastructure.  Particularly, the\nbusiness shall provide information regarding the amount of water that may be required to operate the business, the\nprojected discharge of wastewater, and special wastes produced by the business that would require the availability\nof additional resources by the City, whether the business would require increased law enforcement resources,\nand/or whether the business would produce significant amounts of odor, noise, or dust pollution, and other\nimpacts upon the City’s infrastructure due to the nature of the proposed business.\n5. The financial ability of the proposed business ownership to build the improvements, connect to City infrastructure,\nor other considerations.   The business ownership may be required to provide proof of such financial ability as part\nof an agreement for the provision of development incentives by the City.\n6. Whether the proposed business is in conformance with the City’s Comprehensive Plan and is of a character that is\namenable to the City and the surrounding community. \n7. Whether the business would result in a contribution to the economic diversity of the City.  \n8. Whether the proposed business will purchase materials and seek services from the City’s existing businesses.\n9. Any other factors determined to be peculiar to the proposed business.\nSection 7-41.  Negotiation; Determination.\n(1)  The City may contract with outside consultants or internally to collect the necessary data; conduct the initial\nassessment of the appropriateness and extent of the development incentive offer, based on the factors outlined in Section\n7-40(a) through (i); and make subsequent recommendations to the City regarding whether granting the development\nincentive is advantageous to the City and warrants the pursuit of an agreement as described in 7-41(2) or (3). \n(2)  Upon determination that the granting of a development incentive for commercial development is advantageous to the\nCity and warranted pursuant to the considerations set forth herein, the business ownership shall enter into an agreement\nwith the City setting forth the terms and conditions by which the development incentive will be allowed.  Such agreement\nshall be approved by a majority of a quorum at a public meeting of the City Council.   \n(3)  Upon determination that the granting of a development incentive for deed- restricted workforce housing development\nis advantageous to the City and warranted pursuant to the considerations set forth herein, the property ownership shall\nexecute a deed restriction or other affordability mechanism deemed appropriate by the City Attorney to be recorded prior\nto final payment of the incentive. If the incentive exceeds $50,000, the property owner or business owner shall enter into\nan agreement with the City setting forth the terms and conditions by which the development incentive will be allowed.\n Such agreement shall be approved by a majority of a quorum at a public meeting of the City Council.  (Ord. 3043, Article 6\nRepealed and Reenacted, eff. 7/15/22)\nARTICLE 7. LODGING TAX    (Ord. 3072, Art. 7, repealed  and re-enacted, eff. 4/28/23)\nSection 7-42.  Lodging Tax Imposed on Transaction of Furnishing Rooms or\nAccommodations/Exceptions.   \n     \n1. Imposition. Pursuant to the approval of the eligible registered electors in the City of Trinidad at the election held on\nNovember 6, 2001, there is hereby imposed and levied and shall be collected a 3% lodging tax on the purchase price paid\nor charged to persons for the transaction of furnishing rooms or accommodations by any person, partnership, association,\ncorporation, estate, receiver, trustee, assignee, lessee, or person acting in a representative capacity or any other\ncombination of individuals by whatever name known to a person who for consideration uses, possesses, or has the right to\nuse or possess any room in a hotel, apartment hotel, lodging house, motor hotel, guesthouse, guest ranch, trailer coach,\nmobile home, auto camp, or trailer court and park, under any concession, permit, right of access, license to use, or other\nagreement, or otherwise. The tax authorized hereby shall not be imposed upon food, service, beverages, telephone, laundry\nor like services incidental to the furnishing of lodging or shelter and for which a separate charge is customarily made.\n2. Exceptions.\n(a) The tax imposed in this article shall not apply to the following individuals or entities and under the following specific\ncircumstances:\n(1) If a purchaser is a resident of the taxable premises for a period of at least thirty (30) consecutive days;\n(2) If the purchaser enters into or has entered into a written agreement for lodging at the taxable premises for a\nperiod of at least thirty (30) consecutive days; or\n(3) If the purchaser is an agency, subdivision or department of the federal government or the government of the state\nor one of its political subdivisions and is purchasing lodging in a governmental capacity or in direct pursuit of its\ngovernmental functions and activities.\n(b) The tax imposed by this article shall also be specifically inapplicable to vendors which qualify as clinics, hospitals, other\nmedical facilities, privately owned and operated convalescent homes for the aged, infirm, indigent or chronically ill. \nSection 7-43.  Point of Imposition.   \n \n   For the purpose of the lodging tax imposed by this Ordinance, all sales are consummated at the place where the actual\nrooms or accommodations, which are provided, are located. \nSection 7-44.  Administration.   \n  \n1. The City lodging tax shall be collected, administered, and enforced, to the extent feasible, pursuant to Section 29-2-106,\nC.R.S., as amended.\n2. The Finance Department is given responsibility for administration and implementation of this Article under the\ndirection of the City Manager.\n3. Administration of Article. In order to effectuate the purposes of this Article, the Finance Director, under the direction of\nthe City Manager, shall prescribe necessary forms for the making of returns, for the ascertainment, assessment and\ncollection of the taxes imposed and for the proper administration and enforcement thereof and to permit uniform methods\nof adding the tax or the average equivalent thereof to the purchase price. For the purpose of ascertaining the correctness of\nany return or for the purpose of making an estimate of the tax due from any taxpayer, the Finance Director shall have the\npower to examine or cause to be examined any books, papers, records or memoranda bearing upon the matters required to\nbe included in the return. \n4. Books and records required of taxpayer.\n(a) Taxpayer's retention of records. It shall be the duty of every person liable to the City for any tax imposed under\nthis Article to keep and preserve for a minimum of three (3) years such books, accounts and records as may be\nnecessary to determine the amount of such tax liability.\n(b) Availability of records to Finance Director. All such books, accounts and records shall be open for examination at\nany time by the Finance Director. If such person keeps or maintains such person’s books, accounts and other records\nor any portion thereof outside the state, upon demand by the Finance Director, such person shall make such\navailable at a suitable place within the state, to be designated by the Finance Director, for examination, inspection\nand audit by the Finance Director. The Finance Director, in the discretion of the Finance Director, may make, permit\nor cause to be made the examination, inspection or audit of books, accounts and other records so kept or maintained\nby such person outside the state at the place where such are kept or maintained or at any place outside the state\nwhere such will be made available, provided that such person shall have entered into a binding agreement with the\nCity to reimburse the City for all costs and expenses incurred by the City in order to have such examination,\ninspection or audit made in such place.\n(c) Subpoena to secure records. If any taxpayer shall refuse voluntarily to furnish any of the information required in\nParagraph 3(2) of this Section, when requested by the Finance Director, the Finance Director, by subpoena issued\nunder the Finance Director's hand, may require the attendance of the taxpayer and the production by the taxpayer of\nany such information in the taxpayer's possession and may administer an oath to the taxpayer and take the\ntaxpayer's testimony. If the taxpayer fails or refuses to respond to the subpoena and give testimony or produce any\ndocuments or information as directed in the subpoena, the Finance Director may apply to a judge of the Municipal\nCourt for a citation against such taxpayer for contempt, and the judge may cause arrest of such person; and upon\nhearing, the judge shall have, for the purpose of enforcing obedience to the requirements of the subpoena, power to\nmake such order as, in the judge's discretion, the judge deems consistent with the law for punishment of contempt.\n(d) Subpoena to secure evidence. If the Finance Director is unable to secure from the taxpayer information relating\nto the correctness of the taxpayer's return or the amount of the income of the taxpayer, the Finance Director may\napply to a judge of the Municipal Court for the issuance of subpoenas to such other persons as the Finance Director\nbelieves may have knowledge in the premises, and upon making a showing satisfactory to the court that the taxpayer\ncannot be found or evades service of subpoena or fails or refuses to produce records or give testimony, the judge shall\nhave power to cause the issuance of subpoenas under the seal of the court to the person sought to be so summoned,\nrequiring them or any of them to appear before the Finance Director and give testimony relating to the taxpayer's\nreturn or income. In case any of such persons so served with subpoena shall fail to respond thereto, the judge may\nproceed against such persons as in cases of contempt.\n5. Preservation of tax reports and returns.\n(a) City's preservation of records. All reports and returns of taxes received by the Finance Department covered by\nthis Article shall be preserved for three (3) years and thereafter until the Finance Director orders them to be\ndestroyed.\n(b) Confidential nature of returns. Except in accordance with judicial order or as otherwise provided by law, the\nFinance Director shall not divulge or make known in any way any information disclosed in any document, report or\nreturn filed in connection with any of the taxes covered by this Article. The officials charged with the custody of such\ndocuments, reports and returns shall not be required to produce any of them or evidence of anything contained in\nthem in any action or proceeding in any court, except on behalf of the Finance Director in an action or proceeding\nunder the provisions of any such taxing statutes when the report of facts shown thereby are directly involved in such\naction or proceeding, in either of which events the court may require the production of and may admit in evidence so\nmuch of such reports or of the facts shown thereby as are pertinent to the action or proceeding and no more.\n(c) Taxpayer records. Nothing in this Section shall be construed to prohibit the delivery to a person or a person's duly\nauthorized representative of a copy of any return or report filed in connection with such person's tax, and such copies\nmay be certified by the Finance Director and when so certified shall be evidence equally with and in like manner as\nthe originals and may be received by the courts of this state as evidence of the contents.\n(d) Publication of statistics; returns available to City Attorney. Nothing in this Section shall be construed to prohibit\nthe publication of statistics so classified as to prevent the identification of particular reports or returns and the items\nthereof or the inspection of returns by the City Attorney or other legal representatives of the City.\n(e) Records available to authorized parties. Notwithstanding the provisions of this Section, the Finance Director, in\nthe discretion of the Finance Director, may furnish to the taxing officials of any other state and its political\nsubdivisions and to the United States any information contained in tax returns and related schedules and documents\nfiled pursuant to this Article or in the report of an audit or investigation made with respect thereto, provided that\nsuch jurisdiction enters into an agreement with the Finance Director to grant similar privileges to the City and,\nprovided further, that such information is to be used only for tax purposes.\n6. Employees' restrictions. It shall be unlawful for any officer or employee of the City engaged in any administration which\nis governed by this Article to engage in the business or profession of tax accounting or to accept employment, with or\nwithout consideration, from any person holding a City business license for the purpose, directly or indirectly, of preparing\ntax returns or reports required by the laws of the City, by the state, by any other state or by the United States government\nor to accept any employment for the purpose of advising, preparing materials or data or the auditing of books or records to\nbe used in an effort to defeat or cancel any tax or part thereof that has been assessed by any city of the state, by the state,\nany other state or its political subdivisions or by the United States government. (Ord. 3072, Sec. 7-42, repealed  and re-\nenacted, eff. 4/28/23)\n  \nSection 7-45.  Persons Liable/Remittance of Tax.   \n \nAs defined in this article, all vendors providing lodging are required to act as trustees and collect taxes on behalf of the\nCity. The tax should be collected from purchasers in accordance with this article and must be remitted to the City on a\nquarterly basis by the 20th of each month following the close of the quarter unless the 20th falls on a holiday or weekend,\nthen it is due the following business day. Any remittance that is received by the City after the deadlines listed herein will be\nsubject to a five percent (5%) late fee. Along with the remittance, vendors must submit a quarterly report in the forms\nprovided by the Finance Director. \nSection 7-46.  City Lodging Tax Fund.   \n \n1. All revenues derived from the lodging tax, less costs of collection and administration, shall be placed in a special fund,\nseparate and distinct from the general fund. All interest derived from the investment of revenues within such special fund\nshall also be deposited for the benefit of the special fund.\n2. The funds derived from the imposition of tax hereby authorized shall be expended for the following purposes:\n(a) Thirty-five (35) percent for sustainable tourism marketing, including advertising and attracting conferences,\nconventions, capital expenditures, and meetings;\n(b) Twenty (20) percent for personnel and expenses related to tourism including, but not limited to, the welcome\ncenter and a Convention and Visitors Bureau;\n(c) Thirty (30) percent for maintenance, improvement, and development of quality of life facilities and programs;\n(d) Ten (10) percent to support art and cultural events, programs, and facilities; and\n(e) Five (5) percent for any of the above purposes or other purposes related to the impacts of tourism as the City\nCouncil may determine.\n(f) Any money left unspent following inclusion in an annual budget shall be held in reserves and allocated according\nto the provisions above for the following fiscal year.\n(g) The approved budget for the fiscal year beginning January 1, 2023, and ending on December 31, 2023, shall be\nmaintained as adopted by the City Council; however, it may be spent for any of the above purposes subject to City\nCouncil approval.\n3. All expenditures of lodging tax revenues shall be in accordance with budgetary limitations and specific proposals\nsubmitted to and approved by the City Council, as the same may occur from time to time. Approval of fund expenditures\nshall be accomplished through the adoption of the annual budget or by the adoption of a resolution or resolutions by the\nCity Council detailing the purpose and extent of such expenditures.\n4. There shall be budgeted from the monies received from the imposition of lodging tax an amount equal to two (2)\npercent thereof to reimburse the City for administrative and clerical expenses incurred in the administration and\ncollection of the tax authorized in this article. \nSection 7-47.  Lodging Tax Advisory Board.   \n1. There is established a Lodging Tax Advisory Board consisting of five (5) members who shall study, investigate, and\nadvise the City Council as to the development and promulgation of policies for the implementation, support and use of\nrevenues as defined in Section 7-46. The Board may also advise on other policy-related matters related to tourism as\nrequested from time to time by the City Council.\n2. Members of the Lodging Tax Advisory Board shall be appointed in accordance with Section 8.3 of the City’s Charter;\nhowever, preference shall be given to those individuals with experience in a tourism-related industry.\n3. Terms of Office/Removal.\n(a) The terms of appointment for the members of the Board shall be staggered for overlapping terms of three years.\n(b) Any member may be removed at any time by the Mayor, with the approval of the majority of the members of the\nCity Council. Any member may be automatically removed for failure to attend 75% of the regular meetings in a\nconsecutive 12-month period.\n4. At its first meeting each year, the Board shall elect a chairperson, vice chairperson and secretary from among its\nmembers, each of whose term shall be for one (1) year, with eligibility for reelection. The Board shall meet as necessary. It\nshall adopt such bylaws, rules and regulations governing its procedures as it may consider necessary or advisable, and\nshall keep a record of its proceedings, which record shall be a public record. A quorum shall consist of a majority of the\nvoting members.\n5. All members of the Lodging Tax Advisory Board shall adhere to the provisions of Section 2-71.1 – Rules of Ethics – of\nthe Trinidad Municipal Code. \nARTICLE 8. PURCHASES.    \nSection 7-50   Small purchases.   \n  \nThe Purchasing Agent shall establish written procedures for purchase of goods and securing of a Professional Services\nAgreement involving the estimated expenditure of $1,000.00 or more, but less than $50,000.00, in aggregate, of public\nmoney. These procedures shall require that competition be sought and written records adequate to document the\ncompetition be maintained in order to properly account for the funds expended, and to facilitate an audit of the small\npurchases made.   However, should an opportunity to purchase a good at a less-than market-value price present itself, that\nrequires a timely response, the City Manager may waive the requirement to obtain additional quotes.  With respect to\nprofessional services, qualification-based selection (QBS) will be used. (Ord. 3089, Sec. 7-50, amended, eff. 1/26/24)\nSection 7-51   Purchases based on informal bids.   \n     \nAll contracts for the purchase of goods and securing of a Professional Services Agreement involving the estimated\nexpenditure of $50,000.00 or more, but less than $100,000.00, in aggregate, of public money, shall be made after\ninformal bids and/or use of State Award pricing and other various purchasing organizations, such as NJPA pricings, are\nobtained. All such contracts shall be in writing and shall be awarded to the lowest responsible bidder, upon authorization\nof the City Manager. The quality and performance of the good(s) offered by each bidder, and the time specified for delivery\nof the good shall be considered in determining the lowest responsible bid. The Department Head and/or the Purchasing\nAgent shall keep a record of all bids submitted and the record shall be available for public inspection after the contract is\nawarded, in the manner provided by law.  However, should an opportunity to purchase a good at a less-than market-value\nprice present itself, that requires a timely response, the City Manager may waive the requirement to obtain additional\ninformal bids.  With respect to professional services, qualification-based selection (QBS) will be used. (Ord. 3089, Sec. 7-\n51, amended, eff. 1/26/24)\nSection 7-52   Purchases based on formal bids.   \n \n   \nExcept as otherwise provided in this Article, no contract for the purchase of goods or securing of a Professional Services\nAgreement involving the estimated expenditure of $100,000.00 or more, in aggregate, of public money shall be awarded\nunless the provisions of this Section are followed, or unless available through State Award or other purchasing\norganizations the City has affiliated with.   (Ord. 3089, Sec. 7-52, amended, eff. 1/26/24)\n(1)  Proposals shall be invited by advertisement in a newspaper having general circulation in the City.  The advertisement\nshall state the time and place where specifications may be obtained, and the time and place for the opening of bids.  At\nleast seven (7) full days must pass between the day the advertisement appears and the day of the bid opening.  The\nadvertisement shall state that the City reserves the right to reject any or all of the bids. (Ord. 1684, eff., 3-29-02)\n(2) The City may require that bid deposits be submitted with each bid.  If bid deposits are required, they shall be in an\namount equal to five percent (5%) of the amount of the bid and may be submitted in the form of cash, a cashier’s check, a\ncertified check issued by a bank or trust company insured by the Federal Deposit Insurance Corporation, a bid bond, or\nany other form of bid security deemed sufficient by the City Attorney.  The bid deposit requirement, including the form in\nwhich bonds or other forms of bid security may be submitted, shall be included in the specifications. (Ord. 1684, eff., 3-29-\n02)\n(3) Bids shall be sealed.  All bids shall be opened in public and the Purchasing Agent or Department Head shall make a\nrecord of the bids received.  The record and the bids received shall be subject to public inspection after the bid opening in\nthe manner prescribed by law. (Ord. 1684, eff., 3-29-02)\n(4) The City may require the successful bidder to furnish a performance bond to secure the faithful performance of all of\nthe terms of the contract.  The performance bond shall be in a form approved by the City Attorney and the form of the\nbond shall be included in the specifications. The City Council may reject the bond of any bidder if it finds it to be\nunacceptable. (Ord. 1684, eff., 3-29-02)\n(5) All contracts to which this Section applies shall be in writing and shall be approved by the City Council.  The City\nCouncil may reject any and all bids. (Ord. 1684, eff., 3-29-02)\nSection 7-53   Exceptions.   \n \n(1) The provisions of this Article do not apply to the purchase of goods or services when:\n(a) the purchase or service is available from one source or when standardization or compatibility is the overriding\nconsideration.\n(2) All such purchases of $100,000.00 or more shall be approved by the City Council. (Ord. 3089, Sec. 7-53, amended, eff.\n1/26/24)\nARTICLE 9.  MARIJUANA SALES TAX       \nSection 7-54.  Purpose.\n    The purpose of this Article is to impose a separate and additional sales tax on the lawful retail sale of marijuana,\nmarijuana products and marijuana accessories within the City.    \nSection 7-55.  Definitions.    \n     For purposes of this Article, the following words shall have the following meanings:   \n \n     (a)       “Consumer” shall have the meaning attributed to it in section (2)(b) of Section 16 of Article XVIII of the\nColorado Constitution;               \n     (b)       “Lawful retail sale of marijuana, marijuana products and marijuana accessories” shall mean the sale of\nmarijuana, marijuana products and marijuana accessories by a licensed retail marijuana store to a consumer in\ncompliance with Section 16 of Article XVIII of the Colorado Constitution and § 12-43.4-101   , et seq.   , C.R.S.;     \n     (c)       “Marijuana” shall have the meaning attributed to it in section (2)(f) of Section 16 of Article XVIII of the\nColorado Constitution;     \n     (d)       “Marijuana Accessories” shall have the meaning attributed to it in section (2)(g) of Section 16 of Article\nXVIII of the Colorado Constitution;     \n     (e)       “Marijuana Establishment” shall have the meaning attributed to it in section 2(i) of Section 16 of Article\nXVIII of the Colorado Constitution;     \n     (f)        “Marijuana Products” shall have the meaning attributed to it in section (2)(k) of Section 16 of Article XVIII\nof the Colorado Constitution; and     \n     (g)       “Retail marijuana store” shall have the meaning attributed to it in section (2)(n) of Section 16 of Article\nXVIII of the Colorado Constitution. (Ord 1998, Sec. 7-55 corrected, eff. 3-1-16)     \nSection 7-56.  Tax Imposed.  \n \n          (a)       A tax is levied and shall be collected upon the lawful retail sale of marijuana, marijuana products and\nmarijuana accessories within the City at a rate of five percent (5%) of the price paid by the consumer thereof rounded\noff to the nearest penny.  \n  \n     (b)       The sales tax imposed by this section shall be in addition to and not in lieu of the sales tax imposed on the\nretail sale of tangible personal property pursuant to Article 2 of this Chapter.     \nSection 7-57.  Collections, administration and enforcement.  \n \n     The collection, administration and enforcement of the sales tax imposed by this Article shall be performed by the City of\nTrinidad Director of Finance in a manner similar to the collection, administration and enforcement of the state-collected\nCity sales tax as provided in Article 26 of Title 39 of the Colorado Revised Statutes.\n \nARTICLE 10.  RESPONSIBLE FINANCIAL MANAGEMENT.   \nSection 7-60.  Responsible Financial Management Funding.   \n \n  Within the General Fund, Water/Sewer Fund, Gas Fund and Power and Light Fund, there is hereby established the\nfollowing special revenue funds:  \n  Contingency Fund – for emergencies, unforeseen events, opportunities and other occurrences outside of the\nplanned fiscal year operating budget.  \n   \n   The Contingency Fund shall be equal to 5% of the budget for each fund, excluding non-operating items such as\ncapital project transfers and debt service payments or shall be funded annually as determined by the City Council in\nadoption of the annual budget.   \n   \n   Repair and Replacement Fund – for the repair and replacement of fleet and capital infrastructure items.\n  \na.    Infrastructure and Buildings   \nb.    Fleet and Rolling Stock \n   The funding for this fund will be determined annually based upon priorities and fleet management.   \n     \n   Information Technology (IT) Equipment Fund – for the repair or replacement of IT equipment.   \n     \n   The funding for this fund will be determined annually based upon priorities and needs.   \n   \n  Within the General Fund there is hereby established the following special revenue fund:  \n   Economic Development Reserve Fund – for support of economic development activities in Trinidad.  The Economic\nDevelopment Reserve Fund shall be funded annually as determined by the City Council in adoption of the annual budget.\n(Ord. 2032, Art. 10 amended, eff. 6/16/17)\n"}