{"Chapter 1 - General Provisions": "Chapter 1 - General Provisions\nARTICLE 1. IN GENERAL.    \nSection:     \n1-1  Designation and citation of Code.     \n1-2  Definitions.     \n1-3   Rules of construction.     \n1-4  Chapters, Articles, Divisions, Sections, and Subsections; headings and catch lines.     \n1-5  Reference to Sections.     \n1-6  Prospective effect of Code; repealed ordinances not revived.     \n1-7  Territorial applicability.     \n1-8  General penalty; subsequent violation; suspension or revocation of license. \n1-9  Continuing offense.     \n1-10  Same offense punishable by different Sections of Code; City Attorney's option.     \n1-11  Judgments and sentences to run consecutively.     \n1-12  Severability of parts of Code.     \n1-13  Location of Code.     \n1-14  Certified copy of Code admissible into evidence.     \n1-15  Certified copies of documents.     \n1-16  Fees for inspection, copying and photographing of public records.     \n1-17  Altering Code prohibited.     \n1-18  Franchises and special privileges; deposit for costs.     \n1-19  Franchises and special privileges; violations; termination.     \n1-20  City seal.     \n1-20-1 Description.  \n  \nARTICLE 2. INSPECTIONS.  \n1-21  Inspections; when entry authorized.     \n1-22  Types of inspections authorized.    \n \nARTICLE 3. SERVICE OF PROCESS.     \n1-23  Personal service.     \n1-24  Manner of proof of service.     \n1-25  Refusal to accept.     \n1-26  Service upon attorney representing party to whom notice is addressed.      \n \nARTICLE 4. ADOPTION OF CODES BY REFERENCE.\n1-27  Definitions.     \n1-28  Adoption of codes by reference; title.     \n1-29  Procedure for adoption.     \n1-30  Adopting ordinance; adoption of penalty clauses by reference prohibited.    \n1-31  Publication of ordinance.     \n1-32  Filing of public record; sale of copies.     \n1-33  Amendments.     \n1-34  Use as evidence.  \n           \nARTICLE 5. MUNICIPAL LIENS. \n1-35  Creation of Municipal Liens.     \n1-36   Discharge of Municipal Liens.    \n \nCHAPTER 1. GENERAL PROVISIONS.  \n\nARTICLE 1. IN GENERAL.      \n      \nSection 1-1  Designation and citation of Code.  \nThe ordinances of the City of Trinidad, Colorado, embraced in this and the following Chapters shall constitute and be\ndesignated, \"The Code of the City of Trinidad, Colorado,\" and may be so cited. The Code may also be cited as the \"Trinidad\nCity Code\" or, in the provisions which follow, as \"this Code\". (Ord. 1958, Sec. 1-1.)           \nSection 1-2 Definitions. (Ord. 3047, Sec 1-2 amended, eff. 8/26/22)      \n(1)  Alley shall mean a street or highway intended to provide access to the rear or side of lots or buildings in urban areas\nand not intended for the purpose of through vehicular traffic.  \n        \n(2)  Building Inspector(s) shall mean such officers, inspectors, deputies and assistants in the Inspection Division of the\nDepartment of Public Works who may be authorized to enforce specific provisions of this Code.      \n    \n(3)  Charter shall mean the Charter of the City of Trinidad.    \n      \n(4)  City, or this City shall be construed as if \"of Trinidad\" followed them and shall extend to and include the several\nofficers, agents and employees of the City of Trinidad.  \n \n(5)  City Council, Council shall mean the City Council of the City of Trinidad.  \n \n(6)  City Engineer shall mean the Director of Public Works of the City of Trinidad, Colorado.    \n(7)  City Manager or Manager shall mean the City Manager of the City of Trinidad.  \n \n(8)  City Clerk; City Clerk-Treasurer, City Treasurer shall mean the City Clerk-Treasurer of Trinidad.    \n(9)  Code shall mean this Code.  \n \n(10)  County shall mean the County of Las Animas.   \n(11)  C.R.S., appearing in this Code, refer to and designates the Colorado Revised Statutes.  \n        \n(12)  District Court shall mean the District Court sitting in and for the County of Las Animas.\n   \n(13)  Month shall mean a calendar month.    \n      \n(14)  Oath shall include an affirmation in all cases in which, by law, an affirmation may be    \nsubstituted for an oath, and in such cases the words swear and sworn shall be equivalent to the words affirm and affirmed.\n   \n(15)  Owner, applied to a building or land, shall include any part owner, tenant in common, tenant in partnership, joint\ntenant, or tenant by the entirety, of the whole or of a part of such building or land.    \n(16)  Person shall extend and be applied to organizations, associations, clubs, societies, firms, partnerships, copartnerships\nand bodies politic and corporate as well as to individuals, any combination of individuals acting as a unit.    \n(17)  Personal property shall include every species of property except real property.    \n    \n(18)  Preceding; following shall mean next before and next after, respectively.  \n(19)  Property shall include personal, real and fixed property.    \n      \n(20)  Public place shall mean a place to which the public or a substantial number of the public has access, and includes but\nis not limited to highways, transportation facilities, schools, places of amusement, parks, playgrounds and the common\nareas of public and private buildings and facilities.    \n(21)  Real property shall mean land, including land under water, buildings, structures, fixtures and improvements on land;\nany property appurtenant to or used in connection with land; and every estate, interest, privilege, leasehold, easement,\nlicense, franchise, right-of-way, and other right in land, legal or equitable, including, without limiting the generality of the\nforegoing, rights-of-way, terms for years, and liens, charges, or encumbrances by way of judgment, mortgage or otherwise,\nand the indebtedness secured by such liens.    \n   \n(22)  Roadway shall mean those portions of a street or highway improved, designed or ordinarily used for vehicular travel.\n   \n(23)  Sidewalk or sidewalk area shall mean that portion of a street between the curb lines, or the lateral lines of a roadway\nand the adjacent property lines, intended for the use of pedestrians.  \n \n(24)  State or this State shall mean the State of Colorado.       \n(25)  Street shall mean the entire width between the boundary lines of every way publicly maintained when any part\nthereof is open to the use of the public for purposes of vehicular travel.\n  \n(26)  Tenant; occupant, applied to a building or land, shall include any person holding a written or oral lease of or who\noccupies the whole or a part of such building or land, either alone or with others.\n   \n(27)  Year shall mean a calendar year.  \n \n(28) Long-Term Rental shall mean the rental of any residential property by a person to any natural person who resides in\nLas Animas County as that person's primary residence for a term of not less than six (6) months. Where such property is\nvacant for a period of three (3) months or more during such six-month period, such property shall not constitute a long-\nterm rental under this definition. In order to meet the definition of a long-term rental, such property must be actively\noffered for rent, as supported by reasonable evidence of such rental.\n(29) Primary Residence shall mean a residence which is the usual place of return for housing as documented in the vested\ntitle of the property or through a long-term lease. The owner or occupant of said residence shall provide at least two of the\nfollowing: motor vehicle registration, driver’s license, Colorado state identification card, voter registration, or tax\ndocuments to establish their primary residence status. A person can have only one primary residence.\nSection 1-3. Rules of construction.  \nIn the construction of this Code and of all ordinances, the following rules shall be observed, unless inconsistent with the\nCity Council or the context clearly indicates otherwise:\n   \n(1) Common and technical usage. Words and phrases shall be read in context and construed according to the rules of\ngrammar and common usage. Words and phrases that have acquired a technical or particular meaning, whether by\nlegislative definition or otherwise, shall be construed accordingly.    \n(2) Computation of time. Whenever a notice is required to be given or an act to be done a certain length of time before any\nproceedings shall be had, the day on which such notice is given, or such act is done, shall not be counted in computing the\ntime, but the day on which such proceeding is to be had shall be counted. If the last day is a Saturday, Sunday or legal\nholiday, that day shall not be counted in the computation.    \n(3) Conflicting provisions. If a general provision of the Code conflicts with a more specific provision of the Code and such\nconflict is irreconcilable, the more specific provision shall prevail as an exception to the general provision, unless the\ngeneral provision is the later adoption and the manifest intent is that the general provision prevail. If it cannot be\ndetermined which conflicting provision is more specific, the provision most recently adopted shall prevail.  \n \n(4) Definitions. The definitions contained in Section 1-2 of this Code shall apply to those terms whenever they are used in\nthe Code unless otherwise expressly provided. Definitions provided within a given chapter, shall be applicable only within\nsuch chapter, unless otherwise expressly provided.  \n      \n(5) Gender. Words importing the masculine gender shall include the feminine and neuter as well as masculine.    \n      \n(6) Heretofore and hereafter. Whenever the word heretofore appears in any Section, it shall be construed to mean any time\nprevious to the day when that Section shall take effect; whenever the work hereafter appears, it shall be construed to mean\nthe time after the Section takes effect.  \n        \n(7) Number. Words importing a singular shall include the plural and the plural shall include the singular.    \n(8) Or; and. “Or” may be read “and” and “and” may be read “or” if the sense requires it.  \n \n(9) Shall; must; may. The words “shall” and “must” are mandatory and the word “may” is permissive.         \n(10) Tense. Words used in the present or past tense shall include the future as well as the present or past.    \n(11) Writing; written. The words “writing” and “written” shall include printing and any other mode of representing words,\nletters and figures.    \nSection 1-4. Chapters, Articles, Divisions, Sections and Subsections; headings and catch lines.   \nAll headings of Chapters, Articles or Divisions and all catch lines of Sections and Subsections are unofficial and intended\nonly for convenience in arrangement and as mere catchwords to indicate the contents of the Chapters, Articles, Divisions,\nSections and Subsections. They shall not be deemed to be part of the contents of the Chapters, Articles, Divisions, Sections\nor Subsections; nor shall the headings and catch lines alter the otherwise intended meaning of any provision of this Code.  \n \nSection 1-5. Reference to Sections.  \n      \nWherever in this Code or the ordinances of this City a reference is made to several Sections and the Section numbers given\nin the reference are connected by the word \"to\", the reference includes both Sections whose numbers are given and all\nintervening Sections.  \n \nSection 1-6. Prospective effect of Code; repealed ordinances not revived.\n      \nThis Code shall not affect any act done, any right accrued, any penalty incurred, any suit, prosecution or proceeding\npending, or the tenure of office of any person holding office, at the time when it takes effect, nor shall the repeal of any\nordinance have the effect of reviving an ordinance theretofore repealed or superseded, or the effect of preventing any\npunishment or penalty incurred before the repeal took effect, or of interfering with any suit, prosecution or proceeding\npending at the time of repeal, for an offense committed under the ordinance repealed.    \nSection 1-7. Territorial applicability.\n      \nThis Code shall refer only to the omission or commission of acts within the territorial limits of the City and to that territory\noutside this City over which the City has jurisdiction or control by virtue of any Constitutional provision or any law.    \nSection 1-8. General penalty; subsequent violation; suspension or revocation of license. (Ord. 2062,\nrepealed and re-enacted, eff. 7-13-18)\n(1) Whenever, in this Code or in any ordinance of the City, or rule, regulation or order promulgated by any law officer or\nagency of the City under authority duly vested in him/her or it, any act or failure to do a required act is prohibited or is\nmade or declared to be unlawful or an offense or a misdemeanor, and no specific penalty is provided therefore, the\nviolation of any such provision of this Code or any ordinance or any rule, regulation or order as aforesaid shall be punished\nby a fine of not less than Three Hundred Dollars ($300.00) nor to exceed Two Thousand Six Hundred Fifty Dollars\n($2,650.00) or by imprisonment in the City Jail or other place of legal incarceration for not more than ninety (90) days, or\nby both such fine and imprisonment in the discretion of the court.\n(2) If the penalty for a particular offense is limited by State statute, then such limitation shall be applicable\nnotwithstanding the provisions of this section.\n(3) The suspension or revocation of any license, certificate or other privilege conferred by the City shall not be regarded as\na penalty for the purposes of this Code but shall be in addition thereto.\nSection 1-9. Continuing offense.   \nUnless otherwise specifically provided, each day any violation of this Code occurs or continues to exist shall constitute a\nseparate and distinct offense.    \nSection 1-10. Same offense punishable by different Sections of Code; City Attorney’s option.       \nIn all cases where the same offense is made punishable or is created by different Sections of this Code, the City Attorney\nmay elect under which to proceed, but not more than one (1) action shall be taken against the same person for the same\noffense.    \nSection 1-11. Judgments and sentences to run consecutively.   \nAll judgments and sentences imposed and ordered by the Municipal Court of the City shall run consecutively unless\notherwise specifically provided by the Judge of such Court. (Ord. 1958, Sec. 1-10.)    \nSection 1-12. Severability of parts of Code.  \n \nThe Sections, paragraphs, sentences, clauses, and phrases of this Code are severable, and if any phrase, clause, sentence,\nparagraph or Section of this Code shall be declared unconstitutional by the valid judgment or decree of a court of\ncompetent jurisdiction, such unconstitutionality shall not affect any of the remaining phrases, clauses, sentences,\nparagraphs and Sections of this Code.    \nSection 1-13. Location of Code.  \n \nThis Code shall be kept on file in the office of the City Clerk, preserved in loose leaf form, or in such other form as the City\nClerk may consider most expedient. It shall be the express duty of the City Clerk, or someone authorized by him/her to\ninsert in their designated places all amendments or ordinances which indicate the intention of the City Council to make the\nsame a part of this Code when the same has been printed or reprinted in page form, and to extract from the Code all\nprovisions which may from time to time be repealed by the City Council. A copy of the Code shall be available for all\npersons desiring to examine it.    \nSection 1-14. Certified copy of Code admissible into evidence.   \nAny copy of the Trinidad City Code or any copy of any addition, amendment or supplement thereto adopted, published\nand certified according to law shall be received in evidence in any court for the purpose of proving the ordinances therein\ncontained with like force and effect and for the same purpose as the original ordinances would be received.    \nSection 1-15. Certified copies of documents.   \nThe City Clerk is authorized to prepare copies of official records and documents of the City and certify the same as being\ntrue and correct copies of the original from which they were copied, and to furnish the same to the person applying\ntherefor upon presentation of receipt of payment by the Director of Finance showing cost of such service has been paid.    \nSection 1-16. Fees for inspection, copying and photographing of public records.\nIn addition to the twenty-five cents ($.25) per page fee provided for in Title 24, C.R.S., 24-72-205(1), the City Clerk shall\ncharge and collect in advance:\n(1) The sum of Three Dollars and fifty cents ($3.50) for furnishing a certified copy of any document, instrument or paper\non file, in addition to twenty-five cents ($.25) per page, for each document, instrument or paper furnished.\n(2) The sum of Thirty Dollars ($30.00) per hour when it shall be necessary to search for and retrieve any public records in\nresponse to any person’s request for such public records. There shall be no charge for the first hour of time for research\nand retrieval of records. The City may require and collect an advance deposit based on the estimated research and retrieval\nand per page fee for public records requests that will require significant staff time and resources to complete.\n(3) The sum of Twenty Dollars ($20.00) for the reproduction of audio recordings.\n(4) The sum of Fifteen Dollars ($15.00) will be assessed per portable storage device when used to produce documents that\nare voluminous, at the discretion of the records custodian.\n(5) Fees to cover the actual cost of shipping/transmitting records may be imposed. However, no transmission fee may be\ncollected for sending digital records via email, though all other fees will be required to be paid in advance. (Ord. 3019,\namended, eff. 5-14-21)\nSection 1-17. Altering Code prohibited.\n  \nIt shall be unlawful for any person to change or amend by additions or deletions, any part or portion of this Code, or to\ninsert or delete pages, or portions thereof, or to alter or tamper with this Code in any manner whatsoever which will cause\nthe law of the City to be misrepresented thereby.    \nSection 1-18. Franchises and special privileges; deposit for costs.\n  \nAny person requesting any special privileges, grants or franchises from the City, is required to deposit with the City Clerk\nsuch sum of money as the Council may deem sufficient to defray all expenses incident to the procuring of such franchises\nor special privileges; provided, if any money remains after payment of all expenses, it shall be refunded to the party paying\nit to the Clerk.    \nSection 1-19. Franchises and special privileges; violations; termination.  \n \nAny violations of the duties and obligations imposed and prescribed to be done and performed by grantees of any franchise\nor grant of special privilege, or of the conditions of such franchise or grant or of relevant provisions of this Code, shall\nterminate and end all rights granted such franchise or grant.\n   \nSection 1-2 0 . City seal.  \n \nThe City of Trinidad Municipal Seal shall be:\nImage of City of Trinidad Municipal Seal\nSection 1-20-1.   Description.  \nThe City of Trinidad Municipal Seal shall be on a navy blue circle with bronze detail. The primary focal point shall be a\nwhite “T” in the middle of the shield in representation of the first letter in Trinidad’s name. Above the shield shall be the\nword Trinidad in white. The shield top shall have the distinct modern variation of the upper most bluff of Fisher’s Peak\nand a small bronze circle, representing the rising sun over the signature natural landmark near the City of Trinidad; this\nrepresents the new era of prosperity that Trinidad is embarking on. Outward from the shield and T, are the detailed lines\nindicating the Greek Ionic inspiration for the Victorian architecture of our downtown. Below the shield is the word\nColorado in white. (Ord. 2047, Repealed and re-enacted, eff. 12-01-17)\n      \nARTICLE 2. INSPECTIONS.   \nSection 1-21. Inspections; when entry authorized.   \n               The proper City inspection authority or its authorized agent shall have the right to make an inspection of any\npremises in the City in order to determine the existence of violations of any provisions of this Code pertaining to the\nhealth, welfare and safety of the public. Such inspector shall have the right to enter any premises in the City for such\ninspection purposes, without a warrant, if any of the following circumstances exist:    \n(1) Entry with permission. Entry is by permission or at the request of the owner or occupant of the premises; or    \n(2) Imminent danger. Where an imminent danger to health, welfare of safety exists; or    \n   \n(3) Danger from accident. Following an accident where an immediate inspection is required to determine if an imminent\ndanger to health, safety or welfare exists; or  \n \n(4) Any other emergency inspection, or in any other case where warrants are not presently required by law.    \nSection 1-22. Types of inspections authorized.   \nThe following types of inspections may be conducted by the proper City inspection authority or its authorized agent:    \n(1) Routine inspection. The inspection of the designated premises is part of a routine area inspection being conducted.    \n(2) Spot check. The inspection of the designated premises is part of a spot check being conducted within a designated area.\n \n \n(3) Knowledge of violation. The inspector has knowledge of a violation or knowledge of facts which would indicate a\nviolation of any provision of this Code pertaining to health, safety or welfare of the public.    \n(4) Inspection after alteration, remodeling or improvements. The inspection is for the purpose of inspecting, during the\ncourse, or upon completion of alteration, remodeling or improvements in the premises.    \n(5) Checking conditions after accident. The inspection is for the purpose of checking the conditions existing in the\npremises following an accident or casualty therein where an inspection is required to determine if an imminent danger to\nhealth and safety exists.    \n \n(6) Licensing of buildings and structures. The inspection is for the purpose of checking the conditions existing in any\nbuilding or structure requiring a license before occupancy upon application for or renewal of such license.    \nARTICLE 3. SERVICE OF PROCESS.    \nSection 1-23. Personal service.   \nWherever in this Code, service of any notice shall or may be by personal service, such personal service shall be as follows:  \n \n(l) Upon a natural person over the age of eighteen (18) years by delivering a copy thereof to him/her, or by leaving a copy\nat his/her usual place of abode, with some member of his/her family over the age of eighteen (18) years, or by leaving a\ncopy in a conspicuous place at his/her usual place of business, or by delivering a copy to an agent authorized by\nappointment or by law to receive service of process.  \n \n(2) Upon a natural person under the age of eighteen (18) years by delivering a copy thereof to him/her and a copy thereof\nto his/her father, mother or guardian, or if there be none in the City, then by delivering a copy thereof to any person in\nwhose care or control he/she may be, or with whom he/she resides, or in whose service he/she is employed.\n   \n(3) Upon a person from whom a conservator or representative has been appointed, by delivering a copy thereof to such\nconservator or representative.  \n \n(4) Upon a partnership, or other unincorporated association, by delivering a copy thereof to one (1) or more of the partners\nor associates, or a managing or general agent thereof.    \n(5) Upon a private corporation, by delivering a copy thereof to any officer, manager, general agent, or agent for process. If\nno such officer or agent can be found in the City, such copy may be delivered to any stockholder, agent, member or\nprincipal employee found in the City. If such service be upon a person other than an executive officer, the secretary,\ngeneral agent, or agent for process, then the City Clerk shall mail a copy thereof to the corporation at its last known\naddress at least fifteen (15) days before the time stated in the notice on which or within which the corporation to whom it\nis directed shall do or accomplish that which it is the purpose of the notice to command it to do.\n   \n(6) Upon a public corporation or other public agency subject to notice, by delivering a copy thereof to the principal officer,\nchief clerk or other executive employee thereof.    \nSection 1-24. Manner of proof of service.   \n(1) If served by a police officer or City employee, by his/her certificate with a statement as to date, place and manner of\nservice.  \n \n(2) If by any person, by his/her affidavit thereof, with a statement as to date, place and manner of service.    \n(3) If by mail, by the certificate of the City Clerk showing the date of the mailing; and the return receipt, showing the date\nof receiving the notice.  \n \n(4) If by publication, by the affidavit of publication, together with the certificate of the City Clerk as to the mailing of the\nnotice where mailing is required.  \n \n(5) By the written admission or waiver of service by the person to be served, duly signed and acknowledged.\nAcknowledgment of such admission or waiver of service may be taken before a Notary Public.  \n \nSection 1-25. Refusal to accept.  \n \nIf the person to be served refuses to accept a copy of the notice, service shall be sufficient if the person serving it shall state\nthe general nature of the notice and offer to deliver a copy thereof.  \n \nSection 1-26. Service upon attorney representing party to whom notice is addressed.\n     \n      Whenever under any ordinance, order, resolution or directive service of a notice is required or permitted to be made\nupon a party represented by an attorney, the service shall be made upon the attorney unless service upon the party\nhimself/herself is directed by the ordinance, order, resolution or directive or is ordered by the City Council. Service upon\nthe attorney may be made by delivering a copy to him/her personally or by mailing it to him/her at his/her address as\ngiven to the City Clerk or the department charged with giving such notice. Delivery of a copy within this Subsection means\nhanding it to the attorney; or leaving it at his/her office with his/her clerk or other person in charge thereof; or, if there is\nno one in charge, leaving it in a conspicuous place therein; or, if the office is closed or the attorney to be served has no\noffice, leaving it at his/her dwelling, house or usual place of abode with some member of the family over the age of\neighteen (18) years residing therein. Service by mail is complete upon mailing.    \nARTICLE 4. ADOPTION OF CODES BY REFERENCE.  \n \nSection 1-27. Definitions.   \nAs used herein:  \n \n(1)  Primary code  shall mean any code which is directly adopted by reference in whole or in part by any ordinance passed\npursuant to this Article. \n \n(2)  Published  shall mean issued in printed, lithographed, multi graphed, mimeographed or similar form.    \n(3)  Secondary code  shall mean any code which is incorporated by reference, directly or indirectly, in whole or in part, in\nany primary code or in any secondary code.    \nSection 1-28. Adoption of codes by reference; title.\n  \nIf all the procedures and requirements of this Article are complied with, the City is authorized to enact any ordinance\nwhich adopts any code by reference, in whole or in part; and such primary code, thus adopted, may in turn adopt by\nreference, in whole or in part, any secondary codes duly described therein. However, every primary code which is\nincorporated in any such adopting ordinance, shall be specified in the title of the ordinance.    \nSection 1-29. Procedure for adoption.\n  \nThe procedure for adoption of all ordinances adopting codes by reference shall be in accordance with the requirements of\nSection 5.6 of the Charter. In addition to the notice and publication requirements of Section 5.6 (d) of the Charter, the\npublished notice shall also state that copies of the primary code and copies of the secondary code, if any, being considered\nfor adoption, are on file with the City Clerk and are open to public inspection.    \nSection 1-30. Adopting ordinance; adoption of penalty clauses by reference prohibited.   \nAfter the hearing, the Council may amend, adopt or reject the adopting ordinance in the same manner in which it is\nempowered to act in the case of other ordinances; provided, nothing in this Article shall be deemed to permit the adoption\nby reference of any penalty clauses which may appear in any code which is adopted by reference. Any such penalty clauses\nmay be enacted only if set forth in full, and published, in the adopting ordinance. It is further provided that all changes or\nadditions to any code made by the Council shall be published in the manner which is required for ordinance.    \nSection 1-31. Publication of ordinance.  \n  \nNothing contained in this Article shall be deemed to relieve the City from the requirement of publishing in full the\nordinance which adopts any such code, and all provisions applicable to such publication shall be fully carried out. The\nadopting ordinance shall contain the name of the code, the year of the publication and the name and address of the\npublisher, and where copies of the code are kept.    \nSection 1-32. Filing of public record; sale of copies.   \nAt least one copy of each primary code adopted by reference, of each secondary code pertaining thereto, shall be filed in\nthe office of the City Clerk at least seven (7) days prior to the hearing on the adopting ordinance, and shall be kept there for\npublic inspection while the ordinance is in force. \n \nSection 1-33. Amendments.  \n \nIf at any time any code, which the City has previously adopted by reference, shall be amended by the agency or\nmunicipality which originally promulgated, adopted or enacted it, then the Council may adopt such amendment by\nreference through the same procedure as required for the adoption of the original code; or an ordinance may be enacted in\nregular manner, setting forth the entire text of such amendment.    \nSection 1-34. Use as evidence.  \n \nCopies of such codes in published form, duly certified by the Clerk and Mayor shall be received without further proof as\nprima facie evidence of the provisions of such codes or public records in all courts and administrative tribunals of this\nState.  \n \nARTICLE 5. MUNICIPAL LIENS    \n \nSection 1-35. Creation of Municipal Liens. (  Ord. 1883, Sec. 1-35 enacted, eff. 5/15/09)  \n \n(1) Any amount of money owed to the City for services, taxes, or assessments which concern or benefit the real property of\nthe obligor shall automatically become a lien upon such real property. Such automatic liens will not be available where the\npayment obligation to the City is not directly related to the use, maintenance, improvement, or taxation of, or other service\nto, the real property involved. These liens shall become first and prior liens upon the property in question. These liens\nshall be in the nature of a municipal tax, and, as such, shall be perpetual and continuing liens. The procedure contained in\nthis Article shall be followed in enforcing such municipal liens, except in those instances where a different procedure is\nprescribed by another section of this Code.    \n \n(2) If payments due the City have not been otherwise collected, the Director of Finance may certify the amount due to the\ncounty treasurer. The county treasurer, upon receipt of the statement of the Director of Finance establishing the amount\nowed, shall collect the amount owed, together with a ten percent (10%) penalty thereon to defray the cost of collection, in\nthe same manner as municipal taxes are collected; provided, however, that upon notice to the county treasurer by the City\nthat the City intends to pursue judicial foreclosure of the lien so established, the county treasurer shall refrain from\nattempting to collect the amount due.    \n(3) The procedure contained in this Article is not intended to establish an exclusive method for collection of amounts owed\nto the City, and nothing contained herein shall preclude the City from pursuing other methods of collection, including\njudicial foreclosure of municipal liens.  \n \nSection 1-36. Discharge of Municipal Liens   . (  Ord. 1883, Sec. 1-36 enacted, eff. 5/15/09)   \n      Within thirty (30) days of payment of the full amount owed to the City, the Director of Finance shall notify the county\ntreasurer that the amount due the City has been paid, and that any liens resulting from that debt shall be discharged.\n", "Chapter 2 - [Title from PDF Content]": "Chapter 2 - Administration\nARTICLE 1.  GENERAL PROVISIONS.\nSections:\n2-1                      Oath of officers.\n2-2                      Disbursement of money.\n2-3                      Annual audit of accounts.\n2-4                      Public works - Authorization.\n2-5                      Public works - Necessity determined by Council; assessment.\n2-6                      Contracts - Approval by Council; letting.\n2-7                      Venue of action on contract.\n2-8                      Contract modifications - Authorization by City Manager.\n2-9                      Contracts\n2-10                    Interdepartmental services.\nARTICLE 2.  THE MAYOR.\n2-11                 Mayor as Official head of City; duties; civil process.\n2-12                 Mayor - Salary.\nARTICLE 3.  THE CITY COUNCIL.\nDIVISION 1.  COUNCIL MEETINGS.\n2-13                 Council Meetings - Time and place.\n2-14                 Special Council meetings - Notice.\n2-15                 Council meetings - Rules and order of business.\nDIVISION 2.  IN GENERAL.\n2-16                 Council officers.\n2-17                 Council members - Salary\n2-18                 Administrative officers; departmental and personnel charts.\nARTICLE 4.  THE CITY MANAGER.\n2-19                 City Manager - Duties generally.\n2-20                 City Manager - Supervision and approval of public works.\n2-21                 City Manager - Liaison among levels of government.\n2-22                 City Manager - Ex-officio member of all City agencies.\n2-23                 Assistant City Manager; appointment; duties.\n2-24                 City Manager - Director of Budget; procedure for budget adoption.\nARTICLE 5.  THE CITY CLERK.\n2-25                 City Clerk - Duties.\n2-26                 City Clerk to maintain office hours.\nARTICLE 6.  THE CITY ATTORNEY.\n2-27                 City Attorney - Duties; special counsel.\n2-28                 City Attorney - Prosecution of suits and execution of judgments.\n2-29                 City Attorney - Appeal of cases.\n2-30                 City Attorney - Right to be heard on motions before Council.\nARTICLE 7.  DEPARTMENT OF PARKS, BOULEVARDS AND RECREATION.\n2-31                 Department of Parks, Boulevards and Recreation - Superintendent in charge\nARTICLE 8.  LIBRARY DEPARTMENT.\n2-32                 Library Department.\n\nARTICLE 9.  DEPARTMENT OF PUBLIC SAFETY.\n2-33                 Department of Public Safety - Director in charge.\nDIVISION 1.  POLICE DEPARTMENT.\n2-34                 Creation; composition.\n2-35                 Departmental rules and regulations.\n2-36                 Appointment, powers, and duties of Chief.\n2-37                 Duties of Police Officers.\n2-38                 Oath.\n2-39                 Uniforms.\n2-40                 Duty of citizens to aid.\n2-41                 Extraterritorial duty.\n2-42                 Reserve Police; appointment; powers.\nDIVISION 2.  FIRE DEPARTMENT.\n2-43                 Fire Department - Chief in charge.\n2-43.1              Firemen’s pension.\n2-43.2              Additional benefits for firemen.\nARTICLE 10.  MUNICIPAL UTILITY DEPARTMENTS.\n2-44                 Utility Departments.\n2-45                 Power and Light Department.\n2-46                 Water and Sewer Departments.\nARTICLE 11.  DEPARTMENT OF PUBLIC WORKS.\n2-47                 Department of Public Works - City Engineer as director.\nDIVISION 1.  STREET AND BRIDGE DIVISION.\n2-48                 Street and Bridge Division - Supervisor in charge.\nDIVISION 2.  INSPECTION DIVISION.\n2-49                 Inspection Division - Building Inspector in charge.\nDIVISION 3.  GENERAL MAINTENANCE DIVISION.\n2-50                 General Maintenance Division - Supervisor in charge.\nARTICLE 12.  DEPARTMENT OF FINANCE AND ACCOUNTING.\n2-51                 Department of Finance and Accounting - Finance Director in charge.\n2-52                 Duties of Finance Director.\n2-53                 Finance Director's report to Council\n2-54                 Description of bills and payroll; authorization by City Council; action; utilization of  signature facsimile.\n2-55                 Purchasing Agent - Duties.\n2-56                 Withdrawal of supplies from City storerooms.\nARTICLE 13.  AGENCIES, BOARDS, BUREAUS AND COMMISSIONS.\n2-57                 Library Advisory Board.\n2-58                 Establishment of a Park and Recreation Advisory Board.\n2-59                 Other agencies may be created by Council.\n2-59.1              Arts and Culture Advisory Commission.\n2-60                Corazon de Trinidad Historic Main Street Board established.\n2-60.1              Space to Create Commons Oversight Board established.\nARTICLE 14.  RETIREMENT AND PENSIONS.\n2-61                 Repealed\nARTICLE 15.  CONFISCATED, STOLEN, LOST AND ABANDONED PROPERTY.\n2-62                 Definitions.\n2-63                 Director deemed custodian.\n2-64                 Property held as evidence.\n2-65                 Notification of owner.\n2-66                 Disposal of unclaimed property when.\n2-67                 Reclaiming property.\n2-68                 Failure to claim property.\n2-69                 Advertisement.\nARTICLE 16. OTHER PERSONNEL REGULATIONS\n2-70                 Repealed\nARTICLE 17. CODE OF CONDUCT AND CODE OF ETHICS\n2-71                 City of Trinidad Code of Conduct and Code of Ethics\nARTICLE 18. COLLECTIVE BARGAINING\n2-74                 Procedure of Bargaining Units – elections and recognition\nCHAPTER 2.  ADMINISTRATION.\nARTICLE 1.  GENERAL PROVISIONS.\nSection 2-1. Oath and bond of officers.\nBefore entering upon the duties of their respective offices, the City Manager, City Attorney, Municipal Judge, and such\nother officers and employees as the Council may require, shall each take and subscribe to the oath of office to support the\nConstitution of the United States and the Constitution of the State of Colorado, and to faithfully discharge the duties of\ntheir offices to the best of their skill and ability.\nSection 2-2. Disbursement of money.\n(1) All claims and demands against the City, together with all supporting documentation, shall be submitted to and audited\nby the Finance Director.  No money shall be drawn on any City Account except upon warrant checks signed by the City\nManager and the City Clerk and countersigned by the Mayor.  Every warrant check shall specify the fund from which it is\npayable and the bank account on which it is drawn.  No warrant check shall be drawn which will overdraw the cash balance\nof the fund from which it should be paid.\n(2) REPEALED (Ord. 1684, eff. 3/29/02)\nSection 2-3. Annual audit of accounts.\nNot later than thirty (30) days after the close of each fiscal year, the City Council shall cause an annual audit to be made of\nthe accounts of all funds of the City by certified public accountants.  Such audit shall be conducted in accordance with\nprocedures and guidelines set by the State.\nSection 2-4. Public works - Authorization.\nThe Council may authorize any public work or public improvement by the employment of the necessary labor and the\npurchase of the necessary supplies and materials with separate accounting as to each improvement so made, or to do such\nwork by contract duly let after competitive bidding.  The Council may also authorize any public work or any public\nimprovement to be done under any legally constituted plan in which the labor is furnished by any other governmental unit,\ndepartment or agency of the United States or the State of Colorado, and the necessary supplies and materials therefor\nprovided by the City.\nSection 2-5. Public works - Necessity determined by Council; assessment.\nWhen the Council shall so direct by resolution upon its own initiative or when an advisory petition shall be presented to it\nrequesting the making of any local or public improvement, it shall be referred to the City Manager, who shall report\nthereon to the Council, which shall determine by resolution the necessity of doing such work or making such\nimprovement.  If the Council determines in favor of the work or any part thereof, it may fix the limits of the special\nassessment and the district or districts therefor which shall include all the lots and premises fronting, touching, or\nabutting thereon and in case of sidewalks, pavement or other improvements, such as parking lots, shall include such lots,\nblocks or premises lying contiguous to each other as will, in the opinion of the Council, be benefitted thereby.\nSection 2-6. Contracts - Approval by Council; letting.\nWhenever it becomes desirable for the City to enter into a contract for public improvement with a second party, such\ninstrument shall be drawn and approved as to form and content by the City Attorney.  Each contract shall provide for\npublic liability and property damage insurance; and worker's compensation insurance required by the laws of the State of\nColorado; and performance and payment bonds.  The letting and making of such contracts is hereby vested in the Council.\n The Council, in its discretion, shall have the power to reject any or all bids, provided, that except in the case of emergency,\nall contracts calling for an expenditure of more than Five Thousand Dollars ($5,000.00), for public improvement, shall be\nby bid only.  Copies of all contracts shall be filed in the Office of the City Clerk.\nSection 2-7. Venue of action on contract.\n(1) Any contract entered into by the City and a second party shall contain the clause:  \"Venue of any action in law or equity\nbrought under the terms of this contract shall be in the District Court sitting in and for the County of Las Animas, State of\nColorado, and by the signing of this agreement, the parties consent hereto that the said venue shall be Las Animas County,\nColorado.\"\n(2) Any contract which does not contain the clause described in subsection (1) above shall nevertheless be a valid\nobligation of the City, even though said clause was otherwise required and regardless of the date upon which said contract\nwas entered into. (Ord. 1211, Sec. 2-7 (2), enacted eff. 8/18/81)\nSection 2-8. Contract modifications - Authorization by City Manager.\nWhen it becomes necessary, in the prosecution of any work or improvement done under contract, to make alterations or\nmodifications to such contract, such alterations or modifications shall be made only upon authorization of the City\nManager.  No such alteration or modification shall be effective until the price to be paid for the material and/or work\nunder the altered or modified contract shall have been agreed upon in writing and signed by the contractor and the City\nManager.  A copy thereof shall be attached by the City Clerk to the original contract on file in his/her office.\nSection 2-9. Contracts.\nThe City shall not make any contract with any person who is in default to the City. (Ord. 1797, Sec. 2-9 repealed and\nreenacted eff. 8/26/05)\nSection 2-10. Interdepartmental services.\nEach department of the City shall be charged with providing service to other City departments in like manner as the same\nis being rendered to the general public.\nARTICLE 2.  THE MAYOR.\nSection 2-11. Mayor as Official head of City; duties; civil process.\n(1)  The Mayor shall serve as official head of the City and shall serve as Chairperson of the City Council.\n(2)  The Mayor shall perform all the ceremonial duties as official head of the City.\n(3)  The Mayor may accept service of civil process on behalf of the City.\nSection 2-12. Mayor - Salary.\nBeginning on January 2, 2008, the salary of the Mayor shall be Eight Hundred Fifty Dollars ($850.00) per month as and\nfor full compensation for services rendered as Mayor of the City. (Ord. 1832, Sec. 2-12, enacted eff. 7/3/07)\nState law references :  As to power of Council to establish salaries, see C.R.S. 1973 Section 31-3-218.\nARTICLE 3.  THE CITY COUNCIL.\nDIVISION 1.  COUNCIL MEETINGS.\nSection 2-13. Council meetings - Time and place.\nThe City Council shall hold its regular meetings on the first and third Tuesdays of each month at 6:00 p.m. The regular\nplace of meetings shall be the Council Chambers in the City Hall. However, when any such meeting might fall upon any\nlegal holiday or on the date of the State general election, the Primary election, or the City's regular election, the meeting\nshall be held on the following evening at the same hour.  This section shall not preclude the City Council from re-\nscheduling a regular meeting due to other reasonable circumstances that merit the change. (Ord. 1999, Sec. 2-13 repealed\nand reenacted, eff. 3-15-16)\nSection 2-14. Special Council meetings - Notice.\nWhenever a special meeting of the City Council of the City of Trinidad is called, a written notice shall be given to each\nmember of the Council by the City Clerk, of the time and place of such special meeting.  The notice shall be served at least\ntwenty-four (24) hours prior to the time when such special meeting shall be held.  The notice may be served personally or\nleft at the Council member's usual place of residence.  Notice of such meeting shall be posted in two (2) public places.\n(Ord. 1462, Sec. 2-14 enacted eff. 3/1/94)\nSection 2-15. Council meetings - Rules and order of business.\nThe following rules and order of business shall govern at Council meetings:\n(1) Meeting nights. The City Council shall hold its regular meetings on the first and third Tuesdays\nof each and every month at 6:00 p.m., except as set forth in Section 2-13;\n(2) Rules of procedure. The rules of procedure and order of business shall be strictly adhered to by the City Council, unless\nthey shall be temporarily suspended by a vote of the majority of the members present;\n(3) Special meetings. The City Clerk shall call special meetings of the Council upon written request of the Mayor or any two\n(2) members of the Council, as provided by the Home Rule Charter;\n(4) Mayor as Mayor of the Council. The Mayor shall preside at all meetings of the City Council and shall be entitled to a\nvote as other members of the Council. In the case of the absence of the Mayor, the Mayor Pro Tem shall preside, and have\nthe same power as the Mayor;\n(5)  What constitutes a quorum. At any regular or special meeting of the City Council a majority of the entire membership\nshall constitute a quorum to do business, but a minority may adjourn from day to day. A member of the City Council may\nparticipate in regular and special meetings by telephone or other electronic means subject to the following limitations:\na) Non-Emergency Situations. A member of City Council may listen by telephone or other electronic means to any\nCouncil meeting. Such Council member listening via telephone shall be deemed present for purposes of determining\na quorum, but only for meetings during which no quasi-judicial matters will be heard or considered. The member of\nCity Council may not participate nor vote in a quasi-judicial public hearing; however, the Council member may\nmaintain the electronic connection and monitor and listen to the hearing. The member of City Council may\nparticipate and vote in legislative matters. Members of Council may participate electronically during an executive\nsession. Non-emergent electronic participation shall be limited to no more than two (2) consecutive meetings and no\nmore than four (4) posted City Council meetings per calendar year. This limitation may be waived in the event of\nunforeseen circumstances at City Council’s sole discretion.\nb) Emergency Situations. In the event a quorum is unable to meet at the day, hour, and place fixed by the rules and\nprocedures of the City Council because meeting in-person is not practical or prudent due to an emergency affecting\nthe City, meetings may be conducted by telephone, electronically, or by other means of communication so as to\nprovide maximum practical notice. To the extent possible, full and timely notice must be given to the public setting\nforth the time of the meeting.\nc) Council members shall endeavor to advise the City of their intent to participate electronically at the earliest\npossible time prior to the meeting.\nd) The City Council may discontinue the use of electronic participation by one or more members during a meeting\nwhere the participation results in delays or interference in the meeting process; e.g., where the telephone connection\nor connection by other electronic means is repeatedly lost, the quality of the connection is unduly noisy or otherwise\nproblematic to the conduct of the meeting, or the listening member is unable to hear speakers using a normal\nspeaking voice amplified to a level suitable for the meeting audience in attendance. (Ord. 3000, Sec. 2-15(5) repealed\nand re-enacted, eff. 6-12-20)\n(6) Order of business. At the hour appointed for the meeting, the members shall be called to order by the Mayor. The City\nClerk shall proceed to call the roll. Upon determining the presence of a quorum, the Council shall then proceed to the\nbusiness before it, which shall be conducted in the following order:\n(a) First – Policy Items.\n(b) Second - Presentation of petitions, written and oral; communications to the City Council.\n(c) Third - Consent Agenda approval.  Consent agenda items are those that are mundane and non-controversial\naction items requiring formal approval but no discussion.  Items may be on a consent agenda only if all Council\nmembers agree; if even one member considers a specific item to need discussion, it shall be removed and placed on\nthe regular agenda for separate consideration.\n(d) Fourth – Public hearings.\n(e) Fifth - Unfinished business.\n(f) Sixth – Miscellaneous business. Any items removed from the consent agenda for separate consideration shall be\nconsidered under Miscellaneous Business.\n(g) Seventh – Council Reports.\n(h) Eighth – Reports by City Manager and City Attorney.\n(i) Ninth - Adjournment.\n(7) Mayor to decide questions of order. The Mayor shall preserve order and decorum, and shall decide all questions of\norder;\n(8) No member may leave. While the Mayor is putting the question, no member may leave the Council meeting;\n(9) Manner of addressing Mayor. Every member, previous to his/her speaking, shall address himself/herself to the Mayor,\nand say \"Mr. Mayor,\" but shall not proceed with his/her remarks until recognized and named by the Mayor;\n(10) Duties and privileges of members. No member shall speak more than twice to the general question, nor more than\nonce on a previous question, without leave of two-thirds (2/3) of the members of the Council, nor more than once in any\ncase until every member choosing to speak shall have spoken, and no member shall be permitted to leave the chambers\nwhile the Council is in session, except by permission of the Mayor;\n(11) Private discourse prohibited. While any member is speaking, no member shall entertain private discourse;\n(12) Suspension of remarks. A member called to order shall immediately suspend his/her remarks, unless permitted to\nexplain. If there is no appeal, the decision of the Mayor shall be conclusive, but if the member appeals to the Council from\nthe decision of the Mayor, the Council shall decide on the case without debate;\n(13) Order of motions. Motions upon the subject under discussion shall have precedence in the following order: First, to\nlay on the table; second, to postpone; third, to commit; fourth, to amend;\n(14) Motions reduced to writing. All motions or resolutions shall be reduced to writing if required by the Mayor or a\nmember, and, when seconded and stated by the Mayor, shall be open for consideration, and no motion or resolution can\nbe withdrawn after it shall have been amended or decided;\n(15) Adjournment. A motion to adjourn shall be in order and shall have precedence over all others, and shall be decided\nwithout debate;\n(16) Yeas and nays. Every member who is present when a question is called for by the Mayor, shall vote thereon, unless\nexcused by the Council or unless he/she is directly or indirectly interested in the question, in which case he/she shall not\nvote. The yeas and the nays may be called for by any member, in which case the names of the members voting shall be\nrecorded in the minutes.\n(17) Division of question. If the question in debate contains several distinct propositions any member may have the same\ndivided;\n(18) When amendment and debate not in order. A motion for a previous question, to lay the previous question on the\ntable, or to commit until it is decided, shall preclude all amendments and debates on the main question, and a motion to\npostpone a question indefinitely or adjourn it to a certain day shall, until it is decided, preclude all amendments to the first\nquestion;\n(19) Previous question. The previous question shall be as follows: \"Shall the main question now be put?\"\n(20) Journal. The Council shall cause a journal of its proceedings to be kept and maintained by the City Clerk, which shall\nbe available at all reasonable times for public inspection;\n(21) Amendment of rules. These rules may be amended at any meeting of the City Council, by consent of two-thirds (2/3)\nof the members present; provided, however, any rule or rules amended shall not take effect as amended until the next\nregular meeting.  (Ord. 1999, Sec. 2-15 repealed and reenacted, eff. 3-15-16)\nDIVISION 2.  IN GENERAL.\nSection 2-16. Council officers.\nThe Council officers shall consist of the City Manager, City Attorney and Municipal Judge, who shall be appointed and\nserve in accordance with the provisions of the Home Rule Charter. (Ord. 1463, Sec 2-16 eff. 3/1/94)\nSection 2-17. Councilmen - Salary. (Ord. 1832, Sec. 2-17 repealed and reenacted eff. 7/13/07)\n(1) The salary of those Council members elected to terms commencing on January 2, 2008, shall be Five Hundred Fifty\nDollars ($550.00) per month as compensation for services beginning on January 2, 2008.\n(2) The salary of those Council members elected to terms commencing January 5, 2010, shall be Five Hundred Fifty\nDollars ($550.00) per month as compensation for services, beginning on January 5, 2010.\nSection 2-18.   Administrative officers; departmental and personnel charts. (Ord. 1597, Sec. 2-18 repealed and\nreenacted eff. 12/12/98)\n(1) The administrative officers of the City shall consist of the City Manager, the Assistant City Manager, if so appointed,\nCity Clerk, Finance Director, Director of Public Works, Police Chief, Fire Chief, Superintendent of Parks, Boulevards and\nRecreation, and the Superintendents of City Utilities.  Additional administrative officers may be designated or existing\nadministrative officers may be deleted pursuant to Subsection (2) of this Section.  The administrative officers in the\nperformance of their respective duties shall be subordinate to and under the sole direction of the City Manager and shall\nbe appointed by him/her.\n(2) Notwithstanding the other provisions in Chapter 2 of this Code, the City Manager with the consent of the City Council\nshall have the authority to reorganize the administration of the City or any portion thereof, changing the responsibilities\nand functions of any administrative department or administrative officer, eliminating or adding any administrative\nposition or department to adapt to the changing needs of the City and its citizens, and changing financial circumstance of\nthe City, and to provide for a more effective and efficient City government without the necessity of an ordinance, provided\nsuch administrative reorganization does not violate the City Charter or other applicable law.  This subsection and any\nadministrative reorganization lawfully adopted pursuant to it shall supercede any provision of this Code in conflict with it.\n(3) The department chart, as updated to reflect changes made to the administrative organization, shall be on file in the\noffice of the City Clerk, and shall indicate the major services to be supplied by the City and the administrative and\nsupervisory personnel required to administer the same.\nARTICLE 4.  THE CITY MANAGER.\nSection 2-19. City Manager - Duties generally.\nThe duties of the City Manager shall be as set forth in the Home Rule Charter. (Ord. 1463, Sec. 2-19 eff 3/1/94)\nSection 2-20. City Manager - Supervision and approval of public works.\nThe City Manager shall have the responsibility for the preparation of plans and specifications, estimating cost, advertising\nfor bids, supervision and approval of any public work or special improvement.\nSection 2-21. City Manager - Liaison among levels of government.\nIt shall be the duty of the City Manager to establish and maintain proper relationships with other levels of government and\npublic service agencies and conduct all business negotiations between them and the City, the nature of which does not\nrequire the personal attention of the elective officers of the City.\nSection 2-22. City Manager ex-officio member of all City agencies.\nThere shall be created, established and maintained the agencies, boards, commissions and bureaus set forth in this\nChapter, exercising the duties and functions as more particularly set forth in the respective laws and ordinances\nconstituting such agencies.  The City Manager shall be ex-officio member of all agencies, boards, commissions and\nbureaus.\nSection 2-23. Assistant City Manager; appointment; duties.\nThe City Manager may appoint an Assistant City Manager who shall perform such functions and duties as shall be\nassigned to him/her and who shall perform the duties of City Manager in the absence or disability of the City Manager.\nSection 2-24. City Manager Director of Budget; procedure for budget adoption. (Ord. 1474, Sec. 2-24 eff.\n6/21/94)\n(1)  The City Manager shall be the Director of the Budget.  He/she shall submit to the Council the proposed budget, and an\nexplanatory budget message in the form and with the contents hereinafter provided.  For such purpose, not later than\nAugust 1 of each year, he/she, or an officer designated by him/her, shall obtain from the head of each office, department or\nagency, detailed by organization units and character and object of expenditures, and such other supporting data as he/she\nmay request, together with an estimate of all capital projects pending or which such department head believes should be\nundertaken within the budget year, and, within the four (4) fiscal years thereafter.  In preparing the budget, the City\nManager shall review the estimates, and may revise such estimates as he/she may deem advisable.  He/she shall submit\nhis/her budget and budget message to the City Council on or before the first Tuesday in October of each budget year.  The\nbudget estimates as submitted by the City Manager shall contain the following:\n(a)  A brief and concise budget summary showing the estimated receipts of each fund and the total for all funds.\n(b)  A statement of the detailed estimates of all proposed expenditures for each fund, itemized for each department\nand activity by objects of expenditures showing parallel columns, the expenditures for the preceding year, the\nappropriation and expenditures for the current year and the recommendations of the City Manager as to the\nappropriations to be made for the ensuing year, including an appropriation for contingencies, and showing the\nincreases or decreases in the recommended appropriations from the expenditures for the current year.  Expenditures\nfor the current year shall be computed as the actual expenditures to and including the eighth (8th) month of the\ncurrent fiscal year, plus the estimated expenditures for the next four (4) months.\n(c)  Detailed statements of estimates of all anticipated income of the City from sources other than current taxes and\nborrowing, compared with the amounts received by the City from each of the same sources for the preceding year.\n Receipts for the current year shall be computed as the actual receipts to and including the eighth (8th) month of the\nannual fiscal year plus the estimated receipts for the next four (4) months.\n(d)  A statement of the estimated financial condition of each City fund reflecting the estimated surplus or deficit in\neach such fund, which shall also show the actual or estimated surpluses or deficits from prior years.\n(e)  A statement of the bonded and other indebtedness of the City showing the amount required in the ensuing year\nfor retirement of principal and interest on the debt, and for a sinking fund or funds for term bonds if such a fund or\nfunds be required, and showing all proposed expenditures or capital projects to be undertaken or executed during\nthe budget year.\n(f)  A statement of outstanding delinquent taxes and special assessments which have been levied during the current\nand preceding fiscal years of the City and an estimate of the amount thereof which may reasonably be expected to be\ncollected or realized during the next fiscal year.\n(g)  An estimate of the amount of money proposed to be raised by taxation and the amount to be raised from bond\nissues which, together with the estimated income from other sources, will be necessary to meet the proposed\nexpenditures.\n(h)  Such other information as may be required by the council.\n(2)  As a part of the budget message or as a separate report attached thereto, the City Manager shall also present a program\nof proposed capital projects for the ensuing year and the four (4) fiscal years thereafter.  Estimates of the cost of such\nprojects shall be submitted together with suggested methods of financing the same.  In order to facilitate the carrying out\nof the capital budget plan, the City shall maintain a capital reserve fund to pay for capital projects.\n(3)  The budget and budget message and all supporting schedules shall be a public record in the office of the City Clerk,\nopen to public inspection by anyone.  The City Manager shall cause sufficient copies of the budget message to be prepared\nfor distribution to interested persons.  The Council, shall within fourteen (14) days after the submission of the budget\nestimates, set a time for public hearings on the annual budget and capital budget estimates.  These hearings may be held\non the same day.  Council shall cause notice of such public hearings to be given by publication at least seven (7) days prior\nto the dates on which hearings are to be held.\n(4)  At the times so advertised, the Council shall hold public hearings on the annual budget and capital budget as\nsubmitted, at which all interested persons shall be given an opportunity to be heard on any or all items and estimates in\nthe proposed budgets.  After such hearings, the Council may insert any additional item or items, and make any increases or\ndecreases, but where it shall increase the total proposed expenditures, it shall also increase the total anticipated revenue to\nat least equal such total proposed expenditures.\n(5)  The budget shall be adopted by ordinance by the favorable votes of at least a majority of the entire Council.  The\nbudget shall be finally adopted by the last day of December of each year.  Should the budget ordinance not be finally\nadopted prior to the end of the fiscal year, ninety percent (90%) of the several amounts of the appropriation ordinance of\nthe last previous year shall be deemed to be reappropriated for the several objects and purposes specified in the last\nappropriation ordinance.\n(6)  Upon final adoption, the budget shall be in effect for the budget year.  A copy of the budget, as formally adopted, shall\nbe certified by the City Manager and City Clerk and filed in the office of the Director of Finance.  The budget, so certified,\nshall be printed, photocopied or otherwise reproduced, and sufficient copies thereof shall be made available for the use of\nall offices, departments and agencies and the use of interested persons and civic organizations.  From the effective date of\nthe budget, the several amounts stated therein as proposed expenditures shall be and become appropriated to the several\nobjects and purposes therein named.\nCross reference :  As to provisions pertaining to disbursement of money, see Sec. 2-2; as to department of Finance and\nAccounting, see Article 12 of this Chapter.\nState law reference :  As to local government budget law, see C.R.S. 1973, Secs. 29-1-101 et seq.\nARTICLE 5.  THE CITY CLERK.\nSection 2-25. City Clerk – Duties.\nThe City Clerk shall be the custodian of the City archives and records and shall be clerk of the Council.  He/she shall attend\nall meetings of the City Council and keep the minutes of all the proceedings and record the same in the journal to be kept\nin his/her office.  He/she shall keep a record of all ordinances, resolutions and regulations of the Council.  He/she shall be\ncustodian of the City seal and shall affix it to all documents and instruments requiring the seal, and shall attest the same.\n He/she shall also be custodian of all papers, titles, documents, contracts and agreements pertaining to the City, the\ncustody of which is not otherwise provided for.  He/she shall certify by his/her signature all ordinances and resolutions\nenacted or passed by the Council, and perform such other duties as may be required of him/her by the City Manager.\nSection 2-26. City Clerk to maintain office hours.\nThe City Clerk shall keep an office in City Hall and maintain and keep office hours therein from 8:00 a.m. to 5:00 p.m. of\neach day, Saturdays, Sundays and legal holidays excepted.\nARTICLE 6.  THE CITY ATTORNEY.\nSection 2-27. City Attorney – Duties; special counsel.\n(1)  The City Attorney shall act as legal advisor to and attorney for the City Council and all its members in matters relating\nto their official duties.  He/she shall give legal advice to any official or department of the City when requested by the\nCouncil or the City Manager, and shall file a copy of any written opinion so provided, with the City Clerk.  He/she shall\nrepresent the City in all cases in all courts, and before all legally constituted tribunals whenever the City is a party thereto,\nexcept as set forth in paragraph (2) of this Section. He/she shall prepare, or officially pass upon, all contracts, bonds, and\nother instruments in writing, in which the City is concerned, and shall certify, before execution, as to their legality and\ncorrectness of form.  He/she shall file in the office of the City Clerk the original copy of all franchises granted by the City,\nall contracts and agreements entered into by or on behalf of the City, and all contracts and agreements entered into by or\nin behalf of the City, and all papers constituting a part of the proceedings in all courts or legally constituted tribunals to\nwhich the City is a party, together with the proper data and information concerning the same.  He/she shall be charged\nwith the responsibility of calling to the attention of the Council and the City Manager all matters of law and changes or\ndevelopments therein affecting the City.  He/she shall perform such other duties as may be prescribed by this Code or by\nthe Council.\n(2)  Upon recommendation of the City Attorney, or upon its own motion, Council may retain special counsel to handle any\nmatter to which the City is a party or in which the City has an interest, or to assist as co-counsel with the City Attorney\nherein.\nSection 2-28. City Attorney - Prosecution of suits and execution of judgments.\nIt shall be the duty of the City Attorney to prosecute for the City all suits for the recovery of fines and penalties which may\nbe brought in any court and to cause executions to be issued on judgments which may be recovered and attend to their\nprompt collection.  All money which may be received by him/her on account of the City shall be paid into the City treasury.\nSection 2-29. City Attorney - Appeal of cases.\nThe City Attorney is authorized and empowered to take appeals in all cases, where, in his/her opinion, the interests of the\nCity require it, and to prosecute and defend the same in all courts, and for the purpose of carrying into effect the provisions\nof this Section, he/she is authorized to make the necessary affidavits and to make and execute, in the name of the City, the\nnecessary appeal or other bonds, signing the same as Attorney for the City.\nSection 2-30. City Attorney - Right to be heard on motions before Council.\nThe City Attorney shall have the right to be heard on all questions of motion before the City Council amending, repealing\nor in any manner affecting any ordinance in force or to be enacted by the City Council.\nARTICLE 7.  DEPARTMENT OF PARKS, BOULEVARDS AND RECREATION.\nSection 2-31. Department of Parks, Boulevards and Recreation - Superintendent in charge. (Ord. 1548, Sec.\n2-31 repealed and reenacted eff. 12/27/96)\n(1)  There is established a Department of Parks, Boulevards and Recreation under the direction of a Parks, Boulevards and\nRecreation Superintendent Who shall have the following duties:\n(a) Conditioning, maintaining and caring for all City parks, playgrounds, swimming pools, youth centers and other\nrecreational facilities, and all boulevards in the City, including landscaping, planting and care of all lawns, shrubbery,\ntrees and flowers and other measures to enhance the scenic beauty and aesthetic values of the City;\n(b) Organize and direct a recreational program for all age groups, and initiate and maintain a program for use of all\nCity recreational facilities;\n(c) Prepare a departmental budget and reports, and perform such other duties as may be assigned by the City\nManager or prescribed by ordinance adopted by the City Council\n(2)  The City Council in its discretion or the City Manager with the approval of City Council may divide the Department of\nParks, Boulevards and Recreation into separate Department of Parks and Boulevards, and Sports and Recreation, each\nwith a superintendent or director in charge, with the Department of Sports and Recreation performing those duties set\nforth in Subsection (1)(b) above, without the necessity of adopting an ordinance, if it is deemed to be in the best interest of\nthe citizens of the City of Trinidad, and if adequate funds are available to do so.\nARTICLE 8. LIBRARY DEPARTMENT.\nSection 2-32. Library Department\nThere is established a Library Department within the City of Trinidad for purposes of administering and operating the\nCity’s public library, with such administration and operation to be with the advice and recommendations of the Library\nAdvisory Board.  Through the creation of a separate Library Department within the City of Trinidad, it is the express desire\nand intent of the City Council that the library remain, at all times, an independent learning facility available for the\neducational benefit of the public at large.  All personnel of the Library Department shall be personnel subject to the terms\nand provisions of personnel policies adopted and/or amended from time to time by the City Council.  The City Manager\nshall have sole and exclusive authority over all Library Department personnel. (Ord. 1548, Sec. 2-32, repealed and\nreenacted eff. 12/27/96)\nARTICLE 9.  DEPARTMENT OF PUBLIC SAFETY.\nSection 2-33.   Department of Public Safety - Director in charge.\nThe City Manager may in his/her discretion establish a Department of Public Safety under the direction of a Safety\nDirector.  Such department would consist of the Police Division and Fire Division.\nDIVISION 1.  POLICE DIVISION.\nSection 2-34.  Creation; composition.\nThere is hereby created a Police Department for the City of Trinidad which shall consist of one Chief of Police and as many\npolice personnel as may from time to time be deemed necessary for the safety and good order of the City.\nSection 2-35.  Departmental rules and regulations.\nThe Police Department shall be operated and managed in accordance with such departmental rules and regulations as may\nfrom time to time be established by the Department.\nSection 2-36.  Appointment, powers and duties of the chief .\nThe City Manager shall appoint a Chief of Police who shall be the head of the Police Department.  It shall be the duty of the\nChief of Police to:\n(1)   See that the ordinances of the City are duly enforced and the rules and regulations of the Police Department\nobeyed, and to perform such duties as may be required by the City Manager.\n(2)  Direct the operations of the Police Department, subject to the rules and regulations thereof.\n(3)  Render such accounts of the Police Department, his/her duties, and receipts as may be required by the City\nManager and keep the records of his/her office open to inspection by the City Manager at any time.\n(4)  Before entering upon the duties of such office, the Chief of Police shall take and subscribe to an oath that he/she\nwill support the Constitution and laws of the State of Colorado, Constitution of the United States and ordinances of\nthe City of Trinidad, and that he/she will faithfully perform the duties of the office upon which he/she is about to\nenter.\nSection 2-37.  Duties of Police Officers.\nAll members of the police department shall have power and duties as follows:\n(1)  They shall perform all duties required of police officers.\n(2)  They shall suppress all riots, disturbances and breaches of the peace, apprehend all disorderly persons in the\nCity, and shall pursue and arrest any person fleeing from justice in any part of the state.\n(3)  They shall be the enforcement officers of the City and shall see that the provisions of this Code and the laws of\nthe State of Colorado are complied with.  They shall arrest without process all persons engaged in the violation in\ntheir presence of any provision of this Code or the law of the State.  Upon such arrest they shall forthwith convey\nsuch offenders before the proper office to be dealt with according to law; provided, that they may incarcerate any\nperson whom they shall arrest at a late and unusual hour of the night until the following morning, and provided\nfurther that in the special cases relating to traffic offenses they may release an arrested person upon his/her written\npromise to appear in court.\n(4)  They shall observe the condition of the streets, sidewalks and alleys of the City, and of any obstruction, nuisance,\nor impediments therein, and shall take necessary measures to cause the removal or the abatement of the same.\nSection 2-38.  Oath.\nBefore entering upon the duties of his/her office, each police officer shall take and subscribe to an oath that he/she will\nsupport the Constitution and laws of the State of Colorado, the Constitution of the United States, and the ordinances of the\nCity of Trinidad, and that he/she will faithfully perform the duties of the office upon which he/she is about to enter.\nSection 2-39.  Uniforms.\nEvery police officer shall wear at all times while on duty, a uniform of the type and quality prescribed by the Department.\nSection 2-40.  Duty of citizens to aid.\nIt shall be the duty of all persons, when called upon by any police officer, to promptly aid and assist such officer in the\ndischarge of his/her duties.\nSection 2-41.  Extraterritorial duty.\nThe Chief of Police may in his/her discretion, upon request of the County Sheriff, Colorado State Patrol or the Chief of\nPolice or person exercising the functions thereof in any other jurisdiction, assign police officers under his/her control\ntogether with such equipment as he/she shall deem to be proper, to perform temporary duty in the requesting jurisdiction.\nSection 2-42.  Reserve Police; appointment; powers.\nThe Police Chief may upon any emergency, riot, pestilence, invasion or at any time he/she shall deem it necessary for the\npeace, good order or health of the City, appoint Reserve Policemen for a specified time, not exceeding two (2) days,\nwithout the approval of the City Council.  He/she may also, with the approval of a majority of the City Council, appoint\nsuch number of Reserve Policemen as may be agreed upon by the City Council, to serve upon days of election, public\ncelebration and holidays, and said Reserve Policemen shall have and possess all the powers and privileges of regular\npolicemen during the time for which they may be appointed.\nDIVISION 2.  FIRE DIVISION.\nSection 2-43.  Fire Department - Chief in charge.\nThere shall be a Chief of the Fire Department who shall be charged with the responsibility of inaugurating a fire\nprevention, detection and extinguishing program which will use all possible means to guard against the occurrence of fire,\nand to protect the property and persons of the inhabitants of the City against damages and accidents resulting therefrom,\nand to furnish information to the public relative to fire hazards, illegal practices and dangerous situations, and to perform\nsuch other duties as will promote the public safety and welfare.\nSection 2-43.1.  Firemen's pension.\nEvery officer, member or employee of the paid Fire Department of the City, retired under the laws of the State, shall be\nentitled to receive monthly pension plus such additional benefits as provided in Section 139-50-8, Chapter 364, 1969\nSession Laws of Colorado, such benefits being one-half (1/2) of any increase in salary and additional pay based on length\nof service granted by the City during the period of retirement to the rank occupied by said officer, member or employee.\n(Ord. 1748, Sec. 2-43.1 eff. 4/16/04)\nSection 2-43.2.  Additional benefits for firemen.\nThe City Council authorizes such additional benefits as provided in Section 139-50-8, Chapter 364 of the 1969 Session\nLaws of Colorado, and incorporates herein by reference the provision of said Section. (Ord. 1748, Sec. 2-43.2 eff. 4/16/04)\nARTICLE 10.  MUNICIPAL UTILITY DEPARTMENT.\nSection 2-44. Utility Departments.\nThe Municipal Utility Departments shall consist of the Power and Light Department, the Natural Gas Department, the\nSewer Department and the Water Department.  The Power and Light Superintendent shall be in charge of the Power and\nLight Department.  The Gas Superintendent shall be in charge of the Natural Gas Department.  The Wastewater\nSuperintendent shall be in charge of the Sewer Department.  The Water Superintendent shall be in charge of the Water\nDepartment.  One person may be superintendent of two or more utility departments, in the discretion of the City Manager,\nwho shall appoint the utility superintendents.\nSection 2-45.  Power and Light Department.\nThe Superintendent of the Power and Light Department shall be charged with the responsibility for the production,\ntransmission and distribution of electric light and power requirements of the homes, businesses and industries of the City,\nand such other responsibilities as may be required in connection therewith.\nSection 2-46.  Water and Sewer Departments.\nThe Superintendent(s) of the Water and Sewer Departments shall be charged with the responsibility of supplying and\nmaintaining a safe and adequate water supply for the homes, businesses and industries of the City, and for the proper and\nsafe disposal of the sewage therefrom, and such other responsibilities as may be required in connection therewith.\nARTICLE 11.  DEPARTMENT OF PUBLIC WORKS.\nSection 2-47.   Department of Public Works - City Engineer as Director.\n(1)  There is established a Department of Public Works, under the direction of the City Engineer.  The Department shall\nconsist of the Street and Bridge Division, Inspection Division, General Maintenance Division and Engineer's Office.\n(2)  It shall be the duty of the City Engineer to organize and direct a public works program; prepare departmental budgets\nand reports; plan and lay out work schedules; initiate and maintain a street maintenance, refuse disposal, and general\nmaintenance program; establish equipment requirements and aid in its purchase; aid in preparing specifications for public\nworks supplies and material; lay out the plans for the construction or repair of pavements, curbs, sidewalks, culverts,\nbridges, water mains, sanitary and storm sewers; propose detailed costs estimates of new projects; keep a record of\ndepartmental activities and perform such other functions as may be prescribed by the City Council and City Manager.\n (Ord. 1958, Sec. 2-48.)\nState law references: As to public works contractor's bond, see C.R.S. 1973 Secs. 38-26-105 et seq.; as to public works\nlabor, see Secs. 8-17-101 et seq.\nDIVISION 1.  STREET AND BRIDGE DIVISION.\nSection 2-48.   Street and Bridge Division - Supervisor in charge.\nThere shall be a Supervisor of the Street and Bridge Division who shall be charged with the responsibility of keeping the\nstreets, sidewalks and bridges in a safe and traversable condition at all times.  In pursuance of these duties, he/she shall\ncarry on operations in repairs, grading, graveling, flushing, sweeping, snow removal and other measures in proper season\nto insure adequate year round traffic conditions.  He/she shall also prepare, install and maintain all traffic signs, markers\nand safety devices for the instruction and protection of those who use the public thoroughfares.\nDIVISION 2.  INSPECTION DIVISION.\nSection 2-49.  Inspection Division - Building Inspector in charge.\nThere shall be a Building Inspector who shall be charged with the responsibility of inaugurating a program to inspect plans\nand specifications of buildings for compliance with structural, electrical and plumbing regulations, to inspect buildings\nduring the process of construction and upon completion, to inspect premises for garbage and rubbish violations, to inspect\nsewer and septic tanks, to inspect and condemn unsafe and unsanitary buildings and to issue various permits.  The\nInspector shall make necessary reports and furnish information to the public relative to building practices and regulations\ncontained in the zoning ordinances, Building Code and State laws, and perform such other duties as will promote the\npublic safety and welfare.\nDIVISION 3.  GENERAL MAINTENANCE DIVISION.\nSection 2-50.   General Maintenance Division - Supervisor in charge.\nThere shall be a Supervisor of the General Maintenance Division who shall be charged with the responsibility of\nmaintaining all the City buildings, lands, and other properties in a clean sightly condition, including the heating, lighting,\nplumbing and ventilation of the buildings in use.  He/she shall also be charged with the operations of the City garage and\nfor maintaining, lubricating, fueling, protecting and repairing all the City machinery, tools and automotive equipment.\n (Ord. 1958, Sec. 2-51.)\nARTICLE 12.  DEPARTMENT OF FINANCE AND ACCOUNTING.\nSection 2-51.  Department of Finance and Accounting - Finance Director in charge.\n(1)  There is created a Department of Finance and Accounting under the direction of the Finance Director.\n(2)  The functions of the department shall consist of Finance and Accounting, Purchases and Supplies, and Utility Billing\nand Receipts.\nSection 2-52.  Duties of the Finance Director.\n(1)  He/she shall be the custodian of all evidences of value belonging to or held in trust by the City.\nHe/she shall collect and receive all moneys belonging to and receivable by the City, including license fees, taxes,\nassessments and other charges belonging and payable to the City, and shall in all cases give a receipt therefor.  He/she\nshall keep and deposit all moneys or funds in such manner and only in such places as the Council may determine.  He/she\nshall report the same in detail to the City Manager.  He/she shall apportion and collect special assessments, as are\nauthorized and levied by the Council.\n(2)  He/she shall keep books of account of the receipts and expenditures of the City.\n(3)  He/she shall keep accurate detailed accounts of:\n(a)  All taxes assessed by the City and all moneys due the City from any source.\n(b)  Moneys received and the several sources from which received.\n(c)  All funds of the City and disbursements made therefrom.\n(4)  He/she shall examine and audit all accounts and claims against the City except claims for unliquidated damages.\n He/she shall not issue or sign any draft, check or warrant until he/she has verified the correctness of the account from\nwhich the same is issued; neither shall he/she allow the payment of any account unless the money has been appropriated\ntherefor; nor shall he/she issue or sign any draft, check or warrant for any account against the City unless sufficient money\nis in the fund on which it is drawn.  Nothing herein shall be construed to prevent the issuance of registered warrants in\naccordance with law.\n(5)  At the close of the fiscal year, and at any time upon direction of the Council he/she shall examine and audit all books of\naccount kept by any official, board or department; provided, however, that he/she shall examine all books of account of the\nMunicipal Court at least once each month.  All books of accounts of the City shall be balanced at the end of each calendar\nmonth, and a report made thereon by the Finance Director to the City Manager.  The Finance Director, in the performance\nof duties relative to the City accounts, shall perform such other duties as may be required of him/her by the City Manager.\nSection 2-53.  Finance Director's report to Council.\nThe Finance Director shall at the close of each fiscal year, and more often if requested by the City Council, make and\ndeliver to the City Council a full and complete report of his/her transactions during the preceding year, stating the amount\nof moneys received and for what purpose received, and exhibiting all credits allowed by law and the ordinances of the City.\nSection 2-54.  Description of bills and payroll; authorization by City Council action; utilization of\nsignature facsimile.\n(1)  Presentation of bills owing by the City shall be made in summarized form to City Council for consideration at any\nregular or special meeting.  Expenses shall be identified by account type, vendor name, check number, invoice number and\npurchase order number, if any, description of service or product purchased and dollar amount of each payment.  Payroll\nfor City employees shall also be made on a departmental basis reflecting the time period and gross wage amounts and the\nappropriate department and account to what such payroll shall be charged.\n(2)  Authorization of payment of bills or payroll shall require a motion, second and affirmative vote of the majority of the\nquorum present at such meetings of City Council.  Only upon City Council's action authorizing such payments, shall the\nsignature of the Mayor, City Manager and City Clerk be affixed to such payments by check drawn upon the appropriate\nbank and account of the City.  The exceptions to this paragraph are as follows:\n(a) The Finance Director, upon the City Manager’s consent, is authorized to issue payment for the monthly natural\ngas invoices, prior to their approval by City Council, when a savings incentive will be realized by the City of Trinidad.\n Such payments will be identified within the semi-monthly reports for City Council approval; and\n(b) The Finance Director, upon the City Manager’s consent, is authorized to pay invoices or bills prior to City Council\napproval if the approval at the next City Council meeting would result in a finance or late fee charge.  Such payments\nwill be identified within the semi-monthly reports for City Council approval. (Ord. 1819, Sec. 2-54(2), repealed and\nreenacted eff. 9/26/06)\n(3)  In the alternative, a signature facsimile bearing the signatures of the aforesaid City officials may be used in the process\nof endorsement of any check for payment of such bills or payroll so long as such bills or payroll were properly authorized\nfor payment by City Council action.  The City Clerk and City Finance Director shall each have custody of one (1) key of a\ntwo-key system providing access to a security box containing the control key to the signature facsimile machine.  In the\nanticipated absence of either the City Clerk or the City Finance Director, said City Clerk or Finance Director shall\nsurrender his/her key to the Mayor or City Manager for the time period of his/her absence.\n(4)  A complete register shall be maintained reflecting each check endorsed manually or by use of a signature facsimile\nwhich register shall be audited annually or as frequently as determined by City Council, by an independent financial\nauditor.\nSection 2-55.   Purchasing Agent – Duties.\nPursuant to rules and regulations approved by City Council, the Purchasing Agent shall purchase all supplies, materials\nand equipment required by any department, office or agency of the City government.  He/she shall have the following\npowers and duties:\n(1)  To establish and enforce, with the approval of the City Manager and after consultation with the heads of the\ndepartments concerned, standard specifications for all supplies, materials and equipment required by the City\ngovernment\n(2)  To prescribe the time of making requisitions for such supplies, materials and equipment, and the future period\nwhich said requisitions are to cover;\n(3)  To inspect, or cause to be inspected, all deliveries of such supplies, materials and equipment, and to cause tests\nto be made when necessary in order to determine the quality and conformance with specifications;\n(4)  To supervise and control central storerooms to serve the several departments, offices or agencies;\n(5)  To supervise the transfer of materials, supplies and equipment between departments or agencies, as needed,\nafter consultation with the department or agency heads concerned;\n(6)  To sell those surplus materials that are no longer of use to the City before their value is lost through\nobsolescence, deterioration or spoilage, and to sell all scrap metals, materials or equipment.\nSection 2-56.  Withdrawal of supplies from City storerooms.\nWithdrawals of materials and supplies from City storerooms shall be by requisition, which shall be approved by the\ndepartment head and which shall be charged to the proper account, subject to such rules and regulations as may be\nprescribed by the Purchasing Agent.  It shall be the responsibility of the department head approving the withdrawal of the\nmaterial from the City storeroom and the Finance Director to certify that there is to the credit of the office, department or\nagency a sufficient unencumbered appropriation balance to pay for the supplies, materials or equipment which are to be\nwithdrawn from the storeroom.\nARTICLE 13.  AGENCIES, BOARDS, BUREAUS AND COMMISSIONS.\nSection 2-57.  Library Advisory Board. (Ord. 1912, Sec. 2-57 repealed and reenacted eff. 3/11/11)\n(1) Library Advisory Board Created .  There is created an advisory board, to be known as the Library Advisory Board\n(hereinafter, the “Board”), consisting of five (5) members who shall serve in advising the City concerning the operations of\nthe City’s public library.\n(2) Membership .  The City Council shall appoint five (5) members to the Board.  The terms of office of two (2) of the\nmembers so appointed shall expire on the first Monday in January, 2012; the terms of office of two (2) of the members so\nappointed shall expire on the first Monday in January, 2013; and the term of office of the other member so appointed shall\nexpire on the first Monday in January, 2014.  Each year thereafter, there shall be appointed, in a similar fashion, a member\nor members to fill the expiring terms. The new term of each appointee appointed in 2012 and thereafter shall be for a term\nof three (3) years.  Each member shall serve until his or her successor is duly appointed.  The City Council shall appoint a\nsuccessor to fill any vacancy occurring in the Board’s membership and to serve for the balance of the unexpired term.\n(3) Meetings; officers .  The Board shall hold one (1) regular meeting each month at such time and place as it may provide\nby resolution, and such special meetings as it may from time to time determine necessary, provided that all such meetings\nshall comply with the Colorado Sunshine Act as set forth in § 24-6-101 et seq ., C.R.S.  On an annual basis, the Board shall\nelect from its membership a chairperson, vice chairperson, and secretary.  A majority of the Board shall constitute a\nquorum and all action by the Board shall be taken by a majority thereof and not otherwise.\n(4) Powers and duties .  The Board shall have the following powers and duties:\n(a)       In all cases, unless otherwise specifically enumerated in this Subsection, the Board shall act as advisor to the\nLibrary Director, the City Manager, and the City Council on matters associated with the library.\n(b)       In cooperation with the Library Director, the Board shall compile and edit comments, complaints,\nsuggestions, and other information from the users of the library, as concerns the operation, management, and use of\nthe library facility; with that information to be edited and forwarded to the City Manager for consideration.\n(c)       The Board shall establish in writing, subject to approval by City Council, a formal procedure by which\ncomplaints or objections from citizens concerning the type of and/or content of materials available to the public at\nthe library are received, reviewed, and given a fair and impartial hearing.  The Board shall have exclusive authority to\ndetermine whether such materials shall be retained.\n(d)       The Board shall make a written annual report to the City Council, not later than July 31 st of each calendar\nyear, in which the Board shall:\n(i)        Assess the strengths and weaknesses of the library’s service to the community;\n(ii)       Make recommendations on short- and long-term goals that will improve library service;\n(iii)      Make prioritized recommendations on capital improvements needed to improve the library; and\n(iv)      Recommend such other policies, programs, procedures, or guidelines which, if\nadopted, would enhance the operation of the library.\n(e)       If requested by the City Manager or Library Director, the Board may assist in the selection process for\nscreening of applicants for various professional positions within the library staff.\n(f)        If requested by the Library Director, the Board may assist the Library Director in establishing a fine schedule\nfor overdue books and materials.\n(g)       Subject to the approval of the City Manager, the Board may establish the library’s hours of operation.\n(5) Limitations of powers .\n(a)       All budgetary powers, expenditures, and revenues shall be exclusively controlled by the City Council.\n However, it is hereby recognized that the Board may, on a case-by-case basis, exercise control over non-monetary\ndonations to the library and/or charitable organizations associated with the library.\n(b)       All personnel matters shall be exclusively controlled by the City Manager.\n(c)       Except as provided in Subsection (4) herein, all other actions of the Board are restricted to matters of an\nadvisory nature, and in the manner of recommendation.\n(6) Legal advisor .  The City Attorney shall be the legal advisor of the Board and render all legal services required by the\nBoard without additional compensation, unless such additional compensation is first authorized by the City Council.\n(7) Liaison .  The City Council may, at its option, appoint from its membership a liaison to the Board to facilitate\ncommunications between the City Council and the Board.  A liaison shall not have a vote in any matters being considered\nby the Board.\n(8) Library Personnel .  Except as provided in Subsection (4) herein, neither the Board nor any of its members shall direct\nor request that it take part in the employment or removal of library personnel.  Violation of this Subsection by a member of\nthe Board shall constitute misconduct and may subject him or her to removal for just cause by a majority vote of the City\nCouncil. (Ord. 1912, 3/11/11)\nSection 2-58.  Establishment of a Park and Recreation Advisory Board.\n(1)  There is established a Park and Recreation Advisory Board.\n(2) The Park and Recreation Advisory Board shall be comprised of seven (7) members who meet the qualifications as set\nforth in Section 8.3 of the Home Rule Charter of the City of Trinidad, to be appointed by the entire City Council.  The\nterms of the members of the Board shall be for four (4) years and shall be made to ensure the overlapping of terms.  The\nBoard shall elect a Chairperson, Vice-Chairperson, and Recording Secretary. (Ord 1749. Sec. 2-58(2) repealed and\nreenacted eff., 4/16/04)\n(3) The Park and Recreation Advisory Boards shall develop a master plan and overview of all of the parks and recreational\nfacilities owned by the City, and of the recreational programs which use the City’s parks and recreational facilities, and\nsubmit this plan to City Council on an annual basis by August 1 st of each year. (Ord. 1586, Sec. 2-58(3) repealed and\nreenacted eff. 5/2/98)\n(4) The Park and Recreation Advisory Board shall hold at least one meeting every three months.  The calling and holding\nof all meetings of the Board shall be in accordance with the Colorado Open Meetings Law, as currently set forth in Section\n24-6-402 of the Colorado Revised Statutes as it pertains to local public bodies. (Ord. 1586, Sec. 2-58(4) eff. 5/2/98)\n(5) Vacancies on the Park and Recreation Advisory Board shall be filled by appointment by the Council for the remainder\nof the unexpired term.  In the event that an unexpired term is for a period of less than six (6) months, the Council may\nappoint a replacement for the regular term plus the unexpired portion of the vacated term.  Members of board shall be\nsubject to removal for just cause by a majority vote of the Council.  Just cause shall include but not be limited to\ninefficiency, neglect of duty, acts detrimental to the City’s interests, malfeasance in office, or excessive absences.  Absences\nby members of the board of three consecutive meetings or three meetings in a rolling six month period shall be cause for\nevaluation by City Council for the purpose of consideration of the member’s removal.  The City Clerk shall advertise\nvacancies in a newspaper of general circulation requesting that interested individuals submit a letter so indicating their\ninterest and qualifications for the position advertised. (Ord. 1706, eff., 10-25-02, Ord 1749, Sec. 2-58(5) repealed and\nreenacted eff., 4-16-04)\nSection 2-59.  Other agencies may be created by Council.\nThere shall be created such other agencies, boards, commissions and bureaus as the Council may, from time to time, deem\nnecessary for the proper conduct of City functions.\nSection 2-59.1.  Arts and Culture Advisory Commission. (Ord. 1750, Sec. 2-59.1 eff. 4/16/04)\n(1) There is hereby created an Arts and Culture Advisory Commission to advise City Council on means and methods of\ncoordination of artistic and cultural entities within the community to enhance tourism within the community.\n(2) The Arts and Culture Advisory Commission shall be comprised of seven (7) members who meet the qualifications as set\nforth in Section 8.3 of the Home Rule Charter of the City of Trinidad, to be appointed by the entire City Council.  The\nterms of the members of the Board shall be for a duration of four (4) years and shall be made to ensure the overlapping of\nterms.  The Commission shall choose a chair person and shall periodically meet for the purpose of developing\nrecommendations to the Trinidad City Council on issues of arts and culture.  The Board shall elect a Chairperson, Vice-\nChairperson, and Recording Secretary.\n(3) Funds can be expended to acquire public art for placement on public property within the City of Trinidad, Colorado.\n(4) Depending on the allocation of funds, the Arts and Culture Advisory Commission may fund a performance by a\nperformer(s) from outside the Trinidad/Las Animas County geographical area.\n(5) No funds shall be expended for a fund-raising event unless the amount of money provided by the Arts and Culture\nAdvisory Commission for fund-raising purposes is refunded in total to the City promptly after the fund-raising event has\ntaken place.  If fund-raising is used to defray the costs of acquiring public art, the funds raised for such purpose shall be\nkept in a separate account for that purpose, and an accounting shall be provided to the City Manager.\n(6) Vacancies on the Arts and Culture Advisory Commission shall be filled by appointment by the Council for the\nremainder of the unexpired term.  In the event that an unexpired term is for a period of less than six (6) months, the\nCouncil may appoint a replacement for the regular term plus the unexpired portion of the vacated term.  Members of\ncommission shall be subject to removal for just cause by a majority vote of the Council.  Just cause shall include but not be\nlimited to inefficiency, neglect of duty, acts detrimental to the City’s interests, malfeasance in office, or excessive absences.\n Absences of three consecutive meetings or three absences in a six-month rolling period shall be cause for evaluation by\nCity Council for the purpose of consideration of the member’s removal.\n(7) The City Clerk shall advertise vacancies in a newspaper of general circulation requesting that interested individuals\nsubmit a letter so indicating their interest and qualifications for the position advertised.\nSection 2-60.  Corazon de Trinidad Historic Main Street Board established. (repealed and re-enacted, Ord.\n2072, eff. 3/1/19)\n(1) There is established a Corazon de Trinidad Historic Main Street Board as an initiative of the Department of Local\nAffairs Colorado Main Street Program.\n(2) The Corazon de Trinidad Historic Main Street Board shall be comprised of seven (7) members who meet the\nqualifications as set forth in Section 8.3 of the Home Rule Charter of the City of Trinidad and who are owners or lessees of\ncommercial property located in the City of Trinidad, or agents or representatives of such owners, to be appointed by the\nentire City Council. The terms of the members of the Board shall be for four (4) years and shall be made to ensure the\noverlapping of terms. The Board shall elect a Chairperson, Vice-Chairperson, and Recording Secretary.\n(3) The function of the Board shall be to advise City Council on matters relevant to the activation and revitalization of the\ndowntown and other commercial areas of the City of Trinidad in accordance with the National and Colorado Main Street\nPrograms.\n(4) The Board shall have the authority to promulgate rules and regulations governing the conduct of its meetings and its\nother operations.\n(5) At its organizational meeting each year, the Board shall select from its members a Chairperson, who shall preside over\nall meetings, a Vice-Chairperson, who shall preside in the absence of the Chairperson, and a Recording Secretary who shall\nbe responsible for taking the minutes of each meeting and presenting them to the Board for adoption. Officer terms shall\nbe for a period of one year.\n(6) The City shall furnish administrative and legal services to the Board for the purpose of meeting all requirements to\nqualify for inclusion into the National and Colorado Main Street Programs. City staff shall be available to assist the Board\nin carrying out its duties.\n(7) The Board shall meet on a monthly basis and shall report to the City Council at least once a year on its activities,\naccomplishments and recommendations.\n(8) The Board shall have the authority to apply for and receive grants for the purpose of directly or indirectly revitalizing\nthe downtown area or other commercial areas of the City.\n(9) Vacancies of the Corazon de Trinidad Historic Main Street Board shall be filled by appointment by the Council for the\nremainder of the unexpired term. In the event that an unexpired term is for a period of less than six (6) months, the\nCouncil may appoint a replacement for the regular term plus the unexpired portion of the vacated term. Members of Board\nshall be subject to removal for just cause by a majority vote of the Council. Just cause shall include but not be limited to\ninefficiency, neglect of duty, acts detrimental to the City’s interests, malfeasance in office, or excessive unexcused\nabsences. Unexcused absences by members of the board of three consecutive meetings or three absences in a six-month\nrolling period shall be cause for evaluation by City Council for the purpose of consideration of the member’s removal. The\nCity Clerk shall advertise vacancies in a newspaper of general circulation requesting that interested individuals submit a\ncitizen interest form so indicating their interest and qualifications for the position advertised. \nSection 2-60.1. Space to Create Commons Oversight Board established.\n(1) There is established a Space to Create Commons Oversight Board for the purpose of overseeing the planning,\ndevelopment and operation of the approximately 20,000 square foot Community Space in the Space to Create Block on\nMain Street in Trinidad.\n(2) The Space to Create Commons Oversight Board (Board) shall be comprised of seven (7) to nine\n(9) members who meet the qualifications as set forth in Section 8.3 of the Home Rule Charter of the City of Trinidad. All\nmembers will be appointed by the entire City Council. The initial board shall be the members of the Corazon de Trinidad\nCreative District Board. The terms of the members of the Board shall be for four (4) years with the exception of the initial\nboard which will have staggered terms as defined in this paragraph. The Board shall elect a Chairperson, Vice-\nChairperson, and Recording Secretary. The first order of business during the first meeting of the board will be dedicated to\nmembers selecting terms by lot with two members receiving one year terms, two members receiving two year terms, one or\ntwo members receiving three year terms, and one or two members receiving four year terms.\n(3) The Board shall work with City staff to select and recommend contracting an architect for the renovation project, plan\nthe renovation of the Community Space, work with City Staff to bid and select the contractor for the renovation project,\noversee renovation activities, and when complete, oversee the management of Community Space including, but not limited\nto leases, events, and other activities. Oversee the City staff member’s activities as they relate to the Community Space.\n(4) Work with Artspace and its onsite manager to ensure the Community Space is designed and operated to complement\nthe live/work spaces and creatives in the building.\n(5) The Board shall have the authority to promulgate bylaws governing the conduct of its meetings and its other\noperations.\n(6) The City shall furnish administrative, staffing and legal services to assist the Board in carrying out its duties. City staff\nassigned to this project will serve as the primary point of contact with Artspace and its partners, the primary point of\ncontact for commercial tenants, the primary point of contact with the local community and the media, and the\ndevelopment of a business plan for the operation of the Commercial Space under the direction of the Board.\n(7) The Board shall meet on a regular basis and shall report to the City Council from time to time regarding its\naccomplishments and activities.\n(8) Vacancies of the Space to Create Community Space Oversight Board shall be filled by appointment by the City Council\nfor the remainder of the unexpired term. In the event that an unexpired term is for a period of less than six (6) months, the\nCouncil may appoint a replacement for the regular term plus the unexpired portion of the vacated term. Members of Board\nshall be subject to removal for just cause by a majority vote of the City Council. Just cause shall include but not be limited\nto inefficiency, neglect of duty, acts detrimental to the City’s interests, malfeasance in office, or excessive unexcused\nabsences. Unexcused absences by members of the board of three consecutive meetings or three absences in a six-month\nrolling period shall be cause for evaluation by City Council for the purpose of consideration of the member’s removal. The\nCity Clerk shall advertise vacancies in a newspaper of general circulation requesting that interested individuals submit a\ncitizen interest form so indicating their interest and qualifications for the position advertised. (Ord. 2082, Sec. 2-60.1, eff.\n8/30/19)\nARTICLE 14.  RETIREMENT AND PENSIONS.\nSection 2-61. Repealed – (Ord. 1748,  Sec. 2-61 amended by being renumbered as follows 60 is now 2-43.1 Firemen’s\npension and 61 is now 2-43.2 Additional benefits for firemen. eff. 4/16/04)\nARTICLE 15.  CONFISCATED, STOLEN, LOST AND ABANDONED PROPERTY.\nSection 2-62.  Definitions.\nThe following words have the meanings hereinafter set forth:\n(1) Custodian shall mean the Chief of Police, or his/her successor in office, or his/her designee, and his/her successor in\noffice;\n(2) Director shall mean the Chief of Police of the City.\n(3) Owner shall mean a person or entity, including a corporation, partnership, association, governmental entity other than\nthe City of Trinidad, or a duly authorized legal representative or successor in interest of same, which owns unclaimed\nproperty held by the City;\n(4) Unclaimed property shall mean any tangible or intangible property, other than a motor vehicle, including any income\nor increment derived therefrom less any lawful charges, that is held by or under the control of the City and which has not\nbeen claimed by its owner for a period of more than sixty (60) days after it became payable or distributable.  (Ord. 1424,\nSec. 1, 06/23/92.)\nSection 2-63.  Director deemed custodian.\nDirector, (Chief of Police) of the City is designated the official custodian of each and every article or object of personal\nproperty lost, stolen, confiscated, or abandoned within the City, which property is not in the lawful custody of any other\nperson or Court.\nSection 2-64.  Property held as evidence.\nThe custodian shall keep in his/her custody all articles of personal property seized or held as evidence for use in any\npending or prospective trial, unless otherwise ordered by the Court, until final disposition of any pending charges,\nincluding appeals or the lapse of time for final appeal. Thereafter, unless ordered by the Court to the contrary, the\ncustodian shall make disposition of such property in accordance with the provisions of this chapter hereinafter set forth.\nSection 2-65.  Notification of owner.\nThe custodian shall examine any such property, and if the identity of the owner appears from such examination, or if the\nidentity of the owner is readily available to the custodian from public records available to him/her, or otherwise known to\nhim/her, the custodian shall notify the apparent owner by postcard, mailed by first class United States mail, postage\nprepaid, to the last known address of such apparent owner, describing the property and stating that the same is held by the\ncustodian and may be sold or otherwise disposed of unless claimed within thirty days of mailing such notice.\nSection 2-66.  Disposal of unclaimed property when.\nIf any such property remains unclaimed sixty days after the same is no longer required to be held in evidence pursuant to\n2-64 above or sixty (60) days after the same has come into the possession of the custodian, or thirty (30) days after the\nmailing of any postcard notice provided for in 2-65 above whichever is the longer time, such property may be disposed of\nfrom time to time by the Director or his/her designee as hereinafter set forth:\n(1)  Bicycles, tricycles or other articles made for use by children may be sold as hereinafter provided, or may, in the\nalternative, be given to poor or needy or institutionalized children as the Director may order, either directly or by making\nthe same available for distribution through religious, charitable, civic or other organizations, or institutions; provided,\nhowever, that at least ten days prior to any such disposition, in a newspaper of general circulation in the City, together with\na description thereof, and the rightful owner may claim any such article within the period between final publication and\ndonation, upon satisfactory proof of identity and ownership.\n(2)  Any such property may be sold at public sale, provided that the custodian shall cause to be published in a newspaper of\ngeneral circulation in the City not less than ten days before such sale, a Notice setting forth a description of each article to\nbe sold, the time, date and place of sale, and that any person who claims to be the owner of or claims any interest in any\narticle so described may appear at the Police Department before the time and date set for sale, to reclaim the same upon\npresentation of satisfactory proof of identity and ownership of such article.\n(3)  Such property which consists of jewelry, gems, watches, precious metals, or other property having a unique value,\nincluding firearms, or which in the judgment of the Director may bring a higher price if sold on sealed bids, may, in the\ndiscretion of the Director, be sold either at public sale as heretofore provided, or to the highest bidder, after solicitation of\nsealed bids from at least three regular dealers in the particular type of property.  No such sale shall be conducted until\nthere shall have been published in a newspaper of general circulation, published in the City, a Notice setting forth a\ndescription of each article to be sold, the time, date and place of bid opening, and that any person who claims to be the\nowner of or claims any interest in any article so described may appear at the Police Department before the time and date\nset for the opening of such bids, to reclaim the same upon presentation of satisfactory proof of identity and ownership.\n Any person desiring to submit a sealed bid may do so, and such bids and all bids may be rejected if deemed too low, or for\nany other reason.  Sales of firearms shall be made only to properly licensed dealers.\n(4)  Intangible property shall become the sole property of the City and shall be credited to the City's General Fund to be\nused in the same manner as other funds in the General Fund.  (Ord. 1424, Sec. 2, 06/23/92.)\nSection 2-67.  Reclaiming property.\nAll such property may be reclaimed by the lawful owner, upon proof of identity and ownership satisfactory to the Director,\nif claimed before donation or sale thereof.\nSection 2-68.  Failure to claim property.\nFailure to make claim of ownership within the time limits prescribed in this Ordinance, and before sale or donation of any\narticle, shall forever bar the owner or any person claiming ownership by, through or under the owner from making\nsubsequent claim of ownership.\nSection 2-69.  Advertisement.\nIf any property is advertised for sale or donation, the same may be destroyed, abandoned, donated, kept or used by the\nCity, without further Notice, if claim of ownership is not made within the time limit prescribed in the second such Notice;\nand the owner or any person claiming ownership by, through or under the owner shall thereafter be barred from making\nany claim of ownership to such property.\nARTICLE 16. OTHER PERSONNEL REGULATIONS\nSection 2-70    Repealed (Ord. 3030, effective 1/14/22)\nARTICLE 17. CODE OF CONDUCT AND CODE OF ETHICS\nSection 2-71. Code of Conduct and Code of Ethics\n(1)       Introduction, Scope and Framework.\nThis code is implemented to help ensure the highest levels of civility, transparency, integrity and ethical behavior in the\nconduct of governmental affairs and decision making by Trinidad board and commissions, and Trinidad board and\ncommission members.   This is done not only to maintain the highest level of ethical standards amongst Trinidad Board\nand Commission members, but also to instill confidence in the public at large as to the deliberative processes and decision\nmaking associated with Trinidad Municipal affairs.      \nThis code shall apply to municipal board and commission members, in their official capacity as such, in their individual\ndealings and affairs having to do with their serving as a board or commission member, and in their own individual affairs\nand dealings, insofar as those dealings impact or effect their serving or being able to serve honorably and ethically as a\nboard and/or a commission member.    \n        \n(2)       Definitions.\nAs used in this Code of Ethics and Code of Conduct, the following words, terms and phrases shall have the following\nmeaning:\n(a)  Board or Commission:  means any appointive board, commission, committee or other appointed body\nestablished pursuant to State law, City ordinance, popular initiative, or a combination of any of the above.  This\nincludes City Council.  This shall include all City boards or commissions entrusted with or empowered to carry out or\nconduct the business of the City of Trinidad.\n(b)  Board or Commission Member:  a current voting or ex officio member, of an existing municipal board or\ncommission, including City Council.   \n(c)  Board of Ethics:  the Board of Ethics shall be made up of the Mayor and the then sitting members of City Council,\nbut shall exist as the Board of Ethics after having been so convened.  The Board of Ethics shall conduct hearings,\nadvisements, reading of charges, and imposition of punitive sanctions pertaining to matters associated with the filing\nof an ethics complaint. \n(d)  City Council:  the duly elected, then sitting and governing board for the City of Trinidad.  Members of the City\nCouncil, including the Mayor, shall comprise the Board of Ethics, and the Board of Ethics in this code may be used\ninterchangeably with the term Trinidad City Council as the ethics board and the board entrusted with enforcing and\ncarrying out the provisions of this code.  The sole distinction being that the Board of Ethics is the Trinidad City\nCouncil convened as the Board of Ethics.     \n(e)  Complaint in Ethics:  a complaint against the Mayor or a member of City Council, or a board or commission\nmember, alleging a violation of the Code of Conduct or the Ethics Code which shall, if not undertaken for the\npurposes of harassment, intimidation, or is not otherwise baseless or groundless, initiate a proceeding in ethics.\n(f)  Criminal conviction:  a judgment, jury verdict, guilty plea, or other adjudication or determination of guilt in a\ncourt of law, which shall include all U.S. and Colorado District and County Courts, as well as Trinidad Municipal\nCourt, or other Colorado municipal courts. \n(g)  Petitioner:  the person filing a complaint in ethics.\n(h)  Respondent:  the person complained against in an ethics proceeding.    \n(3)       Advisory Opinions. \nA member of City Council, or a board or commission member, or a board or commission collectively, may submit a request\nfor an advisory opinion per this Ethics Code, the Code of Conduct, or any other legal question or matter to the City\nAttorney.  Likewise, any board or commission member, or board or commission collectively, can always ask a policy\nquestion of the City Manager, the Assistant City Manager or the City Attorney.  It should be made clear that legal advice\ncan only be obtained from the City Attorney, but advice with respect to policy matters can and generally should be\nobtained from the other offices specified herein.  Advisory opinions with respect to legal or policy matters are encouraged,\nas it is far better to seek advice on such matters in advance of acting on a matter than to be wrong.  When seeking advice\nfrom the City Attorney, one should be mindful of the fact that legal advice cannot be given to a board or commission or a\nboard or commission member that would in any way be adverse, against, or detrimental to the City as a whole.   \nAdvisory opinions from the City Attorney can and shall remain confidential provided that a request for an advisory opinion\ndoes not present a conflict with the City Attorney’s role as the legal advisor for the City.  Further, if the City Attorney\ncannot assure confidentiality of a matter, the board or commission member may withdraw their request for an advisory\nopinion and have the matter remain confidential.    \n    \n(4)       Initiating a Proceeding in Ethics:  The Complaint.\nAn ethics proceeding shall be initiated by the filing of a verified complaint, filed only by a person with firsthand knowledge\nof the event or events complained of.  Said complaint must be predicated on conduct alleged to have arisen during the\npreceding 90-day period prior to the complaint having been filed.  A complaint in ethics must be based on an allegation of\na violation of one or more provisions of this code.  A verified complaint initiating an ethics proceeding shall be filed with\neither the office of the City Clerk or the City Attorney.  If the ethics complaint is filed with the City Clerk’s Office, the City\nClerk shall provide the City Attorney with a copy of the complaint as soon as practicable.  The City Attorney will likewise\nprovide the City Clerk with a copy should the City Attorney be the one served.  City Council shall be notified within 72\nbusiness hours of the filing of a complaint in ethics against one or more of its members, but only after the Council person\nor persons complained against are first notified of the complaint having been filed against them. \nThe board or commission member or members complained against shall thereafter be referred to in this Code as the\nRespondent(s).\n(A)  Review for Factual and/or Legal Sufficiency of the Complaint by the City Attorney:\nWhen a complaint has been filed against a member of City Council, or a member of a City board or commission, and prior\nto the complaint having been made public, the city attorney shall review the complaint for factual and/or legal sufficiency.\n If it appears that the complaint is groundless, baseless, or undertaken for purposes of harassment, vindictiveness or other\nimproper purpose, the city attorney may elect to dismiss the complaint. The city attorney will only dismiss a complaint if it\nmeets the above criteria, and only after having notified the complaining party, the complained against board or\ncommission member, the board or commission that the member sits on, City Council, and after notifying the city clerk and\ncity manager of the existence of the complaint.  Further, a complaint shall not be dismissed by the city attorney if it is\noriginated by a City Council member, or a member of a City board or commission, so as to avoid allegations of the city\nattorney taking sides in a dispute between Council or   commission members.  When dismissing a complaint, the city\nattorney will give the reasons for doing so, and provide the complaining party, the relevant board and commission\nmembers, City Council, and the City Clerk and City Manager a copy of the dismissal and the reasons therefore.    \nAfter the Respondent and City Council have been apprised of the filing of a complaint in ethics, the City Council shall, at its\nnext regularly scheduled meeting greater than seven working days after the complaint in ethics is filed, convene as the\nBoard of Ethics.  After the Board of Ethics has so convened, the Respondent shall be advised with respect to the complaint\nin ethics, and the complaint shall be formally presented to the Respondent and read by the presiding officer should the\nRespondent so desire.  The Respondent may waive reading of the complaint against him or her. \nAfter the complaint is read or said reading of the complaint is waived, the Respondent shall admit or deny, in whole or in\npart, the allegations in the Complaint.  If the allegations are denied, in whole or in part, the matter shall be set for hearing,\noutside of thirty days from the date the complaint is first read and/or presented to the Respondent.  The Respondent may,\nhowever, waive said time period, and have the matter set earlier than thirty days, on a regularly schedule City Council\n meeting date, should scheduling so permit and should the Respondent so request.  \n         \n(B)  Rights of the Respondent at a Hearing Upon an Ethics Complaint Having Been Filed:\n Respondent shall have the following rights at the hearing on the complaint in ethics:\n(i)  that he/she has the right to a public hearing before the Board of Ethics, and to be presumed free from\nwrongdoing unless the complaint is proven by a preponderance of the evidence against them.\n(ii)  that he/she has the right to be represented by counsel.\n(iii)  that he/she has the right to confront and cross examine the witnesses called against him or her.\n(iv)  that he/she has the right to has the right to present evidence on their own behalf, including calling witnesses to\ntestify on their behalf, and to compel the attendance of witnesses to testify on their behalf.\n(v)  that he/she will have the right to a fair and impartial hearing on the ethics complaint, and that any members of\nthe Board of Ethics that may have a conflict of interest or are a material fact witness or a complaining party shall\nrecuse themselves from consideration of the ethics complaint at the hearing and from all other proceedings\nassociated with the Complaint proceedings.\n(C)  Conducting the Hearing:\nThe hearing will be presided over by the Mayor, or if the Mayor is a witness or a Respondent, the Mayor pro tem, or if the\nMayor pro tem must also be recused, next most senior presiding Council Member remaining on the Board of Ethics, that\nhasn’t otherwise been disqualified or recused.   This shall be per the rules of succession for presiding officers for City\nCouncil.  If there is a tie with respect to seniority amongst the remaining Council Members, the presiding officer shall be\ndetermined alphabetically, that is, the person whose last name begins with a letter closest to the beginning of the alphabet.\n The presiding officer shall conduct the hearing, rule on objections, admit exhibits, and otherwise preside over the hearing\nand all matters that arise during the hearing.  The members of the Board of Ethics shall be allowed to ask questions of the\nwitnesses and the parties that give testimony. \nThe Petitioner shall have the burden of proof by a preponderance of the evidence, in attempting to prove the Complaint\nagainst the Respondent.  The Petitioner shall proceed first in presenting his or her case in chief, consisting of testimony,\nexhibits and other relevant, admissible evidence, followed by the Respondent and his/her case in chief and evidence of the\nsame relevant nature.  The Petitioner shall be given a chance to rebut, with surrebutal being reserved for the Respondent. \nThe Rules of Evidence shall be persuasive authority for the conduct of the hearing for the complaint in ethics.\n \n(D)  Subordinate Boards and Commissions: \nAs of the date this Code of Ethics and Code of Conduct are being written and considered for adoption, there are nine\nboards and commissions associated with the City of Trinidad, excluding the Trinidad City Council.  This Code of Conduct\nand Code of Ethics shall apply to all boards and commissions of the City of Trinidad, and shall apply to the individual\nmembers making up those boards and commissions as well.  City Council shall have sole jurisdiction and authority for\nenforcing this Code with respect to alleged violations of this Code made against members of subordinate City boards or\ncommissions.\nA complaint against a board or commission member shall be initiated in the same manner set forth in this Code, and\nmembers of a board or commission shall be afforded the same due process rights and protections provided herein, should\na complaint be filed against a board or commission member and not be dismissed by the City Attorney.  However, City\nCouncil, upon an affirmative vote by a majority of its sitting members, may summarily issue a letter of warning or\nreprimand against a board or commission member for a violation of this Code.\nShould the member of the board or commission that received the summary warning or reprimand issued against them\ndispute said warning or reprimand, that member shall be afforded the opportunity to be heard by City Council in response.\nMembers of boards or commissions should be mindful of the fact that they are participating in the business of the City,\nand as such, are representing the City in their capacity as a board or commission member.  Members of said boards or\ncommissions should refrain from untoward and excessive criticism of the City of Trinidad, City Council, City employees, or\nCity management. Members of subordinate City boards and commissions serve at the pleasure of City Council, and may be\nremoved from their position for cause by a majority vote of City Council.     \nSection 2-71.1 Rules of Ethics.  \n(1)      Confidentiality.\nIt is of the utmost importance that board and commission members keep confidential matters confidential, and hold\ninviolate information that is entrusted to them as part of their official duties. While many matters will be entrusted to\nboard and commission members with the expectation and belief that the commission member will keep the matter\nconfidential, there are certain matters that are, and must be, kept confidential under all circumstances.  Such confidential\ninformation includes, but is not limited to:\n(a)  Executive Sessions:  it is required that all matters imparted or discussed during an executive session be kept\nconfidential.  This requirement applies to all participants/attendees of an executive session, but especially so for the\nboard and commission members present at the executive session.  Everything that is discussed, the viewpoints\nexpressed, or the leanings of individual members all must be kept confidential.   This is especially so for legal advice\ngiven during executive sessions.  In such matters, the confidentiality considerations are heightened by\nattorney/client principles, as well as the requirements of the confidentiality of executive sessions.     The content of\nsuch executive session shall be kept confidential unless it is decided by a majority of City Council to make the matter\npublic.  Board or commission members may lose insurance coverage for revealing matters that are discussed in\nexecutive session.\n(b)  Legal Advice Given Outside of Executive Session: a member of a board or commission may receive legal advice in\ntheir capacity as a municipal official in several ways.  Legal advice given publicly or during a meeting clearly does not\ncarry with it the need for confidentiality, nor can it be expected to be kept confidential.  A board or commission\nmember must differentiate, however, between legal advice given previously in a confidential session/discussion and\nwhat has been discussed or revealed publicly.  \n(c)  Quasi-Judicial Matters:  matters shared with board or commission members during, before, or after a quasi-\njudicial matter must absolutely remain confidential, so as to not jeopardize the integrity of the decision making\nprocess. \n(d)  Other Confidential Matters: There will be other matters entrusted to board and commission members in their\nofficial capacities as well, where the board member will be asked, or expected, to keep a matter or matters\nconfidential.  Usually the person imparting the confidential information will declare the information confidential\nbefore the discussion regarding the information, but in some instances it should be a matter of common sense as to\ninformation that should be kept confidential.  \n(2)       Lawful Compliance.\nBoard or commission members shall be expected and required to be law abiding during their tenure in office. Law abiding\nshall mean free of criminal convictions consisting of:  felonies, misdemeanors, class one traffic offenses, or criminal\nviolations of the Trinidad municipal code. Criminal convictions shall not be taken to mean convictions for traffic offenses,\nlower than a class one traffic offense.    A conviction of a crime under state statute, federal statute, or the Trinidad\nMunicipal Code or other municipal codes may result in the recommendation of the resignation of a member of City\nCouncil or a member of a subordinate board or commission, a vote of no confidence by a majority vote of City Council, or\nthe removal of a member of a subordinate board or commission by a majority vote of City Council.\nBoard or commission members must also abide by and adhere to the Trinidad Municipal Charter, and adhere to the\nrequirements and legal standards set forth therein.  Repeated violations of the Trinidad Municipal Charter by an\nindividual City Council or board or commission member shall be treated as a violation of any other portion of the Code of\nEthics or Code of Conduct.  If City Council, or a subordinate board or commission, shall inadvertently violate the Trinidad\nCity Charter, it shall not be deemed a violation by any individual member or all of the Council or a subordinate board or\ncommission.        \n    \n(3)       Conflicts of Interest.\nBoard and commission members have a fiduciary responsibility to their constituents and to the people that transact\nbusiness and come before them to ensure that their decision making is independent, unbiased, and free from\ninappropriate outside influences.  Stated conversely, it is of paramount importance that board and commission members\nmake decisions in the best interests of Trinidad, and not themselves, their friends or family members.  Conflicts of interest\ncan and will arise for board and commission members in many ways.  It is vital to the decision making process that board\nand commission members exercise independent judgment free of conflicts of interest.  As always, if a board or commission\nmember believes he or she has a conflict of interest, the best course of action is to err on the side of disclosure in revealing\nthe potential or actual conflict, and seek the advice of staff, and the legal advice of the city attorney, in such a situation.\nThe standard that shall be adopted for purposes of this Code is that if there is a substantial appearance of impropriety, the\nappearance of self-dealing, or the likelihood of an impossibility or improbability of being able to exercise independent\njudgment, as determined by a reasonable person standard.  That is, would a reasonable person in the board or commission\nmember’s position have their ability to fairly decide a matter compromised, impaired by, or would there be the appearance\nof impropriety, with respect to an outside matter that would make it less likely to render an impartial decision based\nentirely on the matter presented to the board or commission member?     \n(a)  A direct conflict of interest:  \nA direct conflict of interest shall involve or deal with any decision a board or commission member would be required\nto make that would affect said member’s business or financial interests; the business or financial interests of a\ncompetitor business; any matter that a board or commission member has a direct financial interest in; any matter\nthat would similarly benefit a board or commission member’s family or family member, or their financial interests.\n A direct conflict of interest reflects directly on one’s ability to fairly judge or consider a matter, and shall always be\ndisqualifying for a board or commission member.   \n(b)  An indirect or potential conflict of interest:\nThere will be times when a board or commission member will have a conflict of interest that is not a direct conflict,\nbut could or would rise to the level of a conflict of interest nonetheless.  The appearance of impropriety standard\nwould apply to such situations, and if it does appear that the board or commission member would have their ability\nto exercise independent and impartial judgment reasonably questioned, the member should move to recuse or\ndisqualify him or herself.  \nIf a board or commission member suspects that they may have a conflict of interest, the member should not take any\naction with respect to the matter until the question of the conflict of interest can be resolved.  A board or commission\nmember should raise or discuss the possibility of a conflict of interest as soon as they suspect that they may have a\nconflict.  Also, one should not attempt to influence one’s fellow members of a board or commission, or members of\nsubordinate boards or commissions, on any matter within which they may have a conflict of interest.  This is\nespecially true of matters of a quasi- judicial nature. \n(4)       Communications.    \nBoard or Commission members must not run afoul of the Colorado Open Meetings Law, and discuss city business with\nmore than one of their fellow board or commission members.  Communications between three board or commission\nmembers or more without a meeting having been properly noticed is a violation of the Colorado Open Meetings Law.  A\nboard or commission member shall not initiate, encourage, or participate in or continue a meeting that one knows or\nreasonably should have known is in violation of the Colorado Open Meetings Law.  This shall include communication by\nway of email or text messaging, as a group email or group text to two or more members of a board or commission would\nconstitute a meeting in contravention of the Colorado Open Meetings Law.  \n(5)       Nepotism.\nA board or commission member shall not attempt to benefit a family member by obtaining employment for them, having a\ncity contract awarded to a family member, or otherwise acting in one’s official capacity to benefit, promote or elevate a\nfamily member.  These rules should apply to a board or commission member’s close friends as well, and again, the\nappearance of impropriety standard should apply to this situation as well.  All rules with respect to conflicts of interest\napply to matters of nepotism, and it is a clear conflict and/or misuse of office to try to benefit or advance a family member\nin one’s capacity as a board or commission member. \nNepotism rules and considerations should be applied and construed strictly to personnel matters, and a board or\ncommission member should not try to interfere with or influence City management regarding the hiring/firing of a family\nmember or friend, or if already part of the City work force, their work performance, disciplinary matters, or any\ninvestigative or disciplinary matter undertaken by the City regarding that friend or family member.\n(6)       Emoluments/Gifts.\nA board or commission member should not accept a gift with more than $50.00 in value.  A board or commission member\nshould never accept services in lieu of or as a gift, if it relates to their being a board or commission member.    \nSection 2-71.2 Violations / Sanctions.\nIf a violation of this Ethics Code or the Code of Conduct is proven, the Ethics Board shall elect from the following options\nthe punitive sanction to be imposed:\n---to issue a public warning, verbal or written;\n---to issue a public reprimand or censure, verbal or written;\n---to issue a written public admonishment;\nA public warning shall be the least severe form of punishment, followed by a public reprimand/censure, with the most\nsevere form of punishment being a public admonishment.\nAs part of an adjudication of wrongdoing and the imposition of a punitive sanction being imposed per the above, the Board\nof Ethics may also recommend or strongly encourage the Respondent to attend remedial education or training given by an\norganization such as CIRSA or the Colorado Municipal League regarding the issues that gave rise to the complaint.   \n    \n In considering what punishment to impose, the Board of Ethics shall consider:\n---the severity of the misconduct;\n---whether the member has been the subject of an ethics proceeding before,  especially as it concerns the conduct\ncomplained of, and whether the present proceeding is of the same subject matter as prior ethics complaints/proceedings;\n---the facts giving rise to the complaint, the mitigation or aggravation of the alleged misconduct, and;\n---whether the Council or board or commission member is likely to repeat the conduct that gave rise to the complaint. \nThe Ethics Board does not have the authority to remove a member of City Council, but does have that authority with a\nmember of a subordinate board or commission.  The Ethics Board shall not have the authority to levy a fine or impose\nother sanctions not specified by this Code.    \nSection 2-71.3 Code of Conduct.\nThis Code of Conduct is designed to set forth and memorialize tenants of good conduct for board and commission\nmembers, in facilitating how such members deal with and interact with each other, the public, and staff in their municipal\ncapacities.  This Code of Conduct should be used in conjunction with each individual board and commission member’s\nsense of decency, respect, kindness to others and desire to pursue excellence in municipal affairs.  By getting along with\neach other, members of boards or commissions are better able to focus on the business at hand, rather than focusing on\nindividual personalities or issues with each other.  \n              \nBoard and Commission members shall:\n(a)  While serving a term as an elected or appointed member of a Trinidad board or commission, be mindful that you\nare always representing the City of Trinidad, even when not conducting official business. \n(b)  Be respectful of everyone and everyone’s viewpoints, including your peers on your particular board or\ncommission.  Treat them as you yourself would and do want to be treated;\n(c)  Don’t scold, admonish, belittle or diminish others in meetings, especially for taking a position you don’t agree\nwith.  If you have a personal issue with one of your colleagues, address it respectfully after the meeting.  This applies\nto members of the public addressing or being involved in any proceeding with a board or commission;\n(d)  Similarly, don’t scold, berate, belittle, admonish, or publicly criticize staff during meetings.  Should you have an\nissue with a staff member during a meeting, feel free to talk to them after the meeting, or direct criticisms about staff\nto the City Manager if necessary; \n(e)  Outside of meetings, act in furtherance of the stated policies or decisions of the City in general and your board or\ncommission in particular, not in defiance of them.  Carry out the will of your particular board or commission if\nknown, not your own individual agenda; \n(f)   Honor and respect settled law and or policies of the City of Trinidad.  One can disagree with those laws and or\npolicies personally, but shouldn’t criticize them or the policy makers for deciding what or how they decided;                \n(g)   Adhere to the Trinidad Code of Ethics;\n(h)  Recognize the presiding officer and his or her authority while conducting the meeting;   \n(i)  Remember that one of the most important reflections of a City, and a City’s reputation, is how well meetings are\nconducted, especially that of City Council.  The better all of the constituent parts function, the better members get\nalong, the more that gets accomplished in an efficient, expeditious yet thorough manner, the better the City looks to\nthe outside world.  Respecting each other, the public and staff, being prepared, setting aside petty personal agendas,\nand focusing on the business at hand are all the hallmarks of a City board or commission to be proud of, and;.\n(j)  Recognize the presiding officer as such, and “points of order” and “points of personal privilege” notwithstanding,\nrespecting his or her authority while conducting the meeting.    One can always address a matter with the presiding\nofficer after the meeting, and express concerns or issues then.  The more a board or commission member maintains\ntheir composure and professionalism during something the individual board or commission member doesn’t agree\nwith, the greater the likelihood of a rational result. \nThis Code of Conduct, while setting forth standards of positive and favorable conduct, are primarily aspirational, and\ntherefore recommendations, rather that mandatory principles as set forth in the Code of Ethics.  However, repeated\nviolations of this Code of Conduct may, and shall be, enforceable as would an alleged violation of the Code of Ethics.  (Ord.\n2075, Sec 2-71 repealed and re-enacted, eff. 5-17-19)\nARTICLE 18. COLLECTIVE BARGAINING\nSection 2-74.   Procedure of Bargaining Units – Elections and Recognition\n1)  Definitions. (Ord. 2056, Sec 2-74 (1), amended, eff. 12-15-17)\nAs used in this Section, unless the context otherwise requires:\n“Bargaining Unit”  means each of the three separate Bargaining Units recognized by the City and specified as follows:\nFire Department.\nIncludes all fire department positions excluding all administrative positions.\nTrinidad Police Department.\nIncludes all police department positions excluding all administrative positions.\nGeneral Government.\nIncludes all general government positions not within the fire or police department, excluding all\nadministrative positions.\n“Exclusive Bargaining Agent” means the employee organization recognized by the City as the exclusive bargaining\nagent in accordance with this Section.\n“Majority” means fifty-one percent (51%) of the entire bargaining unit.\n2) Recognition.\nThe City recognizes as the exclusive bargaining agent for each Bargaining Unit the employee organization which is a\nparty to the Collective Bargaining Agreement with the City for that bargaining unit at the time of the adoption of this\nOrdinance.\nPetition for De-Certification .  The Petition form for de-certification must be signed by thirty percent (30%) of all\nmembers of the bargaining unit and an election shall be held within thirty (30) days of the filing of the Petition to\ndetermine whether a majority desire to continue to be represented by the current exclusive bargaining agent or by a\nnew exclusive bargaining agent.  Petition forms may be obtained from the City Clerk and no more than one petition\nmay be filed in each separate bargaining unit to decertify the exclusive bargaining agent for that bargaining unit in\nany Council-approved Agreement term.\nThe ballot question to decertify shall be:\n“Should [insert name of bargaining agent] continue as the exclusive bargaining agent for [insert said bargaining\nunit]?\n___YES\n___NO”\nPetition for Certification. The Petition form for certification of an exclusive bargaining agent must be signed by thirty\npercent (30%) of all members of the bargaining unit and an election shall be held within thirty (30) days of the filing\nof the Petition to determine whether a majority desire to be represented by the proposed exclusive bargaining agent,\nto not be represented by the proposed exclusive bargaining agent, or to have no representation. If no choice receives\na majority of the votes cast, there will be a run-off election between the two choices receiving the greatest number of\nvotes. Petition forms may be obtained from the City Clerk.\nThe ballot question to certify shall be:\n“Should [insert proposed bargaining agent] become the exclusive bargaining agent for [insert said bargaining unit]?\n___YES\n___NO\n___I elect to have no representation.”\nElection Procedure. Any election for de-certification or certification of an exclusive bargaining unit shall be conducted by\nthe City Clerk’s office. The election shall take place over the time span of one full business week (Monday through Friday,\n8:00 am to 5:00 pm daily).\nNotice.\nNotice for de-certification shall be given and ballots shall be returned to the City Clerk and counted by individuals\nappointed by the Council. If a majority of the membership of the bargaining unit vote to support the de-certification\npetition, the council shall decertify the exclusive bargaining agent.\nNotice for certification shall be given and ballots shall be returned to the City Clerk and counted by individuals\nappointed by the Council. If a majority of the membership of the bargaining unit vote to support the certification, the\ncouncil shall certify the exclusive bargaining unit.\nAppeal of Election. Should any member of the bargaining unit desire to appeal to the City Clerk the result of the election as\nto the validity of the ballots, such appeal shall be filed within ten (10) days of the vote. Any resulting recount of ballots and\nthe decision of whether to accept or deny the disputed ballots by the City Clerk shall be final.\n6)  The City Manager in consultation with the City Clerk may adopt procedures to implement this Ordinance.   (Ord. 2011,\nArticle 18 enacted, eff. 7-19-16)\n", "Chapter 3 - [Title from PDF Content]": "Chapter 3 - Alcoholic Beverages\nSections:\n3-1                   License required.\n3-2                   Application for new license - Contents. \n3-3                   Notice of hearing - Posting and publication. \n3-4                   Applicant's initial appearance before Council. \n3-5                   Investigation; report. \n3-6                   Decision of Council. \n3-7                   License renewal procedure. \n3-8                   Changes in ownership of outlet - Application.\n3-9                   Transfer of location of license - Application.\n3-10                 500-foot Requirement for hotel and restaurant licenses eliminated.\n3-11                 Sale to certain persons prohibited. \n3-12                 Minors on licensed premises prohibited. \n3-13                 Hours of operation\n3-14                 Unlawful conduct - Licensee.\n3-15                 Suspension and revocation proceedings.\n3-16                 Fine in lieu of suspension.\n3-17                 Penalty for violations. \n3-18                 Prohibited acts; penalty. \n3-19                 Liquor license application fees.\n3-20                 Fees for Special Events Permits. \n3-21                 Optional premises standards.\n3-22                 Liquor Tasting Permits.\n3-23                 Alcohol beverage festival permit standards.\nCHAPTER 3.  ALCOHOLIC BEVERAGES.\nSection 3-1.    License required.\nThis Chapter shall be deemed to exercise the police powers of the City for the protection of the economic and social\nwelfare, health and peace and morals of the people of this City. This Chapter is further intended to augment the\nrequirements provided for in Article 3, Title 44, C.R.S. It shall further be deemed to impose other reasonable restrictions,\nterms and conditions which are placed upon licenses for the sale or dispensing of alcoholic beverages which may be\ngranted by the Trinidad City Council as the Local Licensing Authority for the City as provided in Articles 46 and 47 of Title\n12, C.R.S.\nIt shall be unlawful for any person to sell, or offer to sell, to dispense, or offer to dispense,\nany malt, vinous or spirituous liquors, as defined by the Article 3, Title 44, C.R.S. (Ord. 2071, Sec 3-1, amended eff.\n1/12/19.)\nSection 3-2.    Application for new license - Contents.\nAn application for a new alcoholic liquor or fermented malt beverage license shall be filed with the City Clerk on forms\nprovided by the State Liquor Licensing Authority. The application shall be complete in every material detail and shall be\naccompanied by the documents required to illustrate ownership interests, possession, the proposed licensed premises in\ndetail, and moral character. Where a petition in support of a new license being issued has been circulated, said petition\nmust be filed with the City Clerk no later than one calendar week preceding the public hearing date. The applicant is\nrequired to submit any other such information and documents as may be required by the City Clerk. (Ord. 2071, Sec. 3-2,\namended eff. 1/12/19.)\n\nSection 3-3.    Notice of hearing - Posting and publication.\nUpon receipt of an application, except an application for renewal or for transfer of ownership, the local licensing authority\nshall schedule a public hearing upon the application not less than thirty (30) days from the date of the application and\nshall post and publish the public notice in conformance with §44-3-311, C.R.S. (Ord. 2071, Sec. 3-3, amended eff. 1/12/19.)\nSection 3-4.    Applicant's initial appearance before Council.\n(1)  The City Clerk shall cause the application to be placed on the agenda of the Council meeting to be held no less than\nfour (4) nor more than thirty (30) days after the Clerk has received the application.\n(2)  The applicant shall be in attendance at the Council meeting at which his/her application is presented to the Council.\n This date of presentation to the Council shall be deemed the date of filing of the application for the purposes set forth in\nthe statutes.\n(3)  The Council shall tentatively set the boundaries of the neighborhood considered affected by the proposed location.\n Until the Council sets the tentative boundaries, the neighborhood shall be deemed to be that area within a radius of one\nhalf (½) mile in all directions from the proposed outlet.\n(4)  The applicant shall be instructed to, and shall cause to be prepared and shall furnish the Clerk at least fifteen (15) days\nprior to the public hearing an official area map showing the location of the proposed outlet and the location and nature of\nall other licensed premises located therein.\n(5)  The Council shall also set a date for public hearing which date shall not be less than thirty (30) days from the date of\nthe Council meeting at which the application is presented.\nSection 3-5.    Investigation; report.\n(1)  After the initial appearance of the applicant before the Council, the Clerk shall commence the investigation of the\napplicant and the premises.  Such investigation shall include the following:\n            (a)  Obtaining from the appropriate law enforcement agencies a criminal record on the applicant, including all\npartners, principals or stockholders holding over ten percent (10%) of the outstanding and issued capital stock, if\napplicable.\n            (b)  Letters of reference shall be verified with the person or persons signing the letters, if the references are local.  If\nthe references are not local, a letter from the Clerk shall be sent to the person or persons signing the reference letters\nrequesting verification.\n            (c) A report shall be prepared by the City Building Inspector identifying satisfaction of City\nBuilding Codes at the proposed licensed location or a recitation of any deficiencies and the steps\nrequired to correct such deficiencies.\n            (d)  The maps and information submitted concerning the general character of the neighborhood and of the residents\nand working population of the neighborhood shall be verified.\n            (e)  The premises proposed for a license shall be inspected to ensure that the plans and specifications submitted\nwith the application are true representations of the premises.\n(2)  All departments and administrative officials of the City shall cooperate fully with the Clerk in his/her investigation.\n These departments and officials shall include, but are not limited to, the Planning and Zoning Department, the Fire\nDepartment, the Building Inspector, the Police Department, the City Attorney, and all other City departments and officials.\n(3)  Any reports of the results of this investigation shall be delivered by the respective departments or officials to the City\nClerk at least ten (10) days prior to the date of hearing on the application.\n(4)  Not less than five (5) days prior to the date of hearing on the application, the Clerk shall make known the findings\nbased on the investigation in a written report to the applicant or principals of the organization applying for the license, and\nupon request to other interested parties, by mailing a copy thereof by certified mail.  (Ord. 1269, Sec. 2, 7/2/85.)\nSection 3-6.    Decision of Council.\n(1)  The decision of the City Council shall be rendered not more than thirty (30) days following the conclusion of the\nhearing.\n(2)  In formulating a decision, the City Council shall consider all of the facts and evidence adduced as a result of the\ninvestigation and hearing, including the reasonable requirements and desires of the inhabitants of the neighborhood\naffected; the number, type and availability of outlets located in or near the neighborhood under consideration; all other\nrestrictions applicable to the area under consideration; whether the City, State or Federal Building Codes, Fire Codes or\nElectrical Codes are  being satisfied at the proposed licensed location; and any other pertinent matters affecting the\n qualifications of the applicant to conduct the type of business proposed. (Ord. 1316, Sec. 1, 4/7/87.)\nSection 3-7.    License renewal procedure. \n(1) A renewal application for a liquor or fermented malt beverage license shall be filed with the City Clerk on a form\nprovided by the State Liquor Licensing Authority, no later than forty five (45) days before expiration of the existing license,\ntogether with the required fees.\n(2) The City Clerk is authorized to administratively process and approve, conditionally approve or deny renewal\napplications, or refer the license renewal to the City Council who shall approve, conditionally approve, or deny renewal\napplications. At the time of submission, the Clerk shall be furnished with all items consistent with section 3-7(1) of this\nArticle. The City Clerk shall not approve a renewal application unless credible evidence of good cause is presented.  The\nCity Clerk may impose reasonable terms and conditions on a license as may be necessary to protect the public health,\nsafety and welfare or to obtain or ensure compliance with this Article, this Code and applicable state law.  The City Clerk\nshall provide written notice of his or her decision, including the reason(s) therefor, by first-class, postage-prepaid U.S.\nmail to the Applicant at the address shown in the application.  An Applicant whose renewal application is denied or\nconditionally approved may appeal the Clerk’s decision to the Authority by filing written notice of appeal with the City\nClerk within ten (10) days of the date of mailing of the decision.  The Authority shall conduct a hearing on such appeal in\naccordance with Section 3-7(10) & 3-7(11) of this Article.\n(3) If the City Clerk has referred the license renewal to City Council, the City Clerk shall cause the renewal application to be\nplaced on the agenda of the Council meeting to be held no less than four (4) nor more than thirty (30) days after the Clerk\nhas received the application.\n(4) The applicant shall be in attendance at the Council meeting at which his/her renewal application is presented to the\nCouncil.\n(5) At the time of presentation of the renewal application, the Council shall be furnished with the following:\n            (a) A summary report submitted by the Police Department of the City of Trinidad identifying all calls responded to\nby the Police Department to the licensed location. Such summary report shall be accompanied by necessary subordinate\ninformation to provide a clear explanation of calls identified within the report.\n            (b) Copies of all incident reports of police responses to incidents which are identified as having originated at or\nwithin the licensed establishment during the previous license period.\n            (c) A report prepared by the City Building Inspector identifying satisfaction of City Building Codes or a recitation of\ndeficiencies and the steps required to correct such deficiencies.\n            (d) A report prepared by the Fire Department identifying satisfaction of City Fire Codes or a recitation of\ndeficiencies and the steps required to correct such deficiencies.\n(6) At the time the renewal application is presented to the City Council, the Council may approve the renewal application\nor postpone action on the application to a later date. In the event of a postponement, the Council shall not be required to\nhold a hearing on the application, except that no renewal application may be denied unless a renewal hearing has been\nheld.\n(7) The motion to set a hearing on the application must set forth the reason or reasons for holding a hearing. Notice of the\nhearing shall be posted in a conspicuous place on the licensed premises for a period of ten (10) days, and notice of the\nhearing shall be provided to the applicant at least ten (10) days prior to the hearing. Notice shall be by mail or personal\nservice.\n(8) The renewal hearing shall be conducted in the manner provided for hearings on applications for new liquor and\nfermented malt beverage licenses. At the hearing, evidence shall be taken to determine whether good cause exists to refuse\nto approve the renewal application. At the close of the hearing, the City Council may vote to approve or deny the renewal\napplication, or may adjourn the hearing to a later date before rendering its decision. Where timely application for renewal\nhas been made, the decision must be rendered prior to the date of expiration of the existing license, and in no event shall\nthe hearing be adjourned for a period exceeding thirty (30) days.\n(9) The City Council may refuse to renew a license for any of the following reasons: Failure to comply with City, State or\nFederal Building Codes, Fire Codes or Electrical Codes; any other reasons set forth under State law; and any other good\ncause reasons. (Ord. 2031, Sec. 3-7 repealed and reenacted, eff. 6/16/17)\nSection 3-8.    Changes in ownership of outlet - Application.\n(1)  All applicants for the issuance of a license by reason of transfer of possession of the licensing premises by operation of\nlaw or by the purchase and sale of the premises shall file an application on forms provided by the State Licensing Authority\nin duplicate with the City Clerk.\n(2)  All such applications shall be subject to the provisions of this Chapter.\n(3)  Notwithstanding Subsection (2) of this Section, the Council shall consider only the character of the applicant, and the\napplicant shall not be required to submit any other information except as it concerns his/her character and ability to\nconduct the business according to law.  (Ord. 973, Sec. 3.8 (c).)\n(4)  All applications for change of ownership shall be set for hearing.  Notice of the hearing must be conspicuously posted\non the licensed premises for a period of ten (10) days, and notice must be provided to the applicant at least ten (10) days\nprior to the hearing. The applicant shall be required to be in attendance at the hearing. (Ord. 1269, Sec. 9, 7/2/85.)\n(5)  Where the licensee is a corporation any transfer of ten (10%) percent or more of the capital stock of the corporation\nshall be reported to the City Clerk on forms provided by the State Licensing Authority not less than ten (10) days prior to\nsuch transfer.  (Ord. 973, Sec. 3.8(c).)\nSection 3-9.    Transfer of location of license - Application.\n(1)  Before the location of a license is changed, the licensee shall submit an application on forms provided by the State\nLicensing Authority in duplicate to the City Clerk for such change.  (Ord. 973, Sec. 3-8. (b).)\n(2)  All applications for a change in the location of a license shall be filed with the Clerk and shall be subject to the\nprovisions of this Chapter.  (Ord. 973, Sec. 3-8. (b).)\n(3)  Notwithstanding Subsection (2) of this Section, the Council, when considering an application for a change in location\nof a license, shall only consider the reasonable requirements of the neighborhood to which the applicant seeks to change\nhis/her location, and the desire of the adult inhabitants as evidenced by petitions, remonstrances or otherwise.  (Ord.\n1269, Sec. 10, 7/2/85)\n(4)  Notwithstanding Subsection (2) of this Section, all applications for change of location of a license shall be set for\nhearing.  The public hearing and notice requirements are the same as for a new license application.  The applicant shall be\nrequired to be in attendance at the hearing.  (Ord. 1269, Sec. 10, 7/2/85.)\n(5)  The City Council shall not transfer such license in less than twenty (20) days after the application has been made and\nthen only after no less than ten (10) days notice of the hearing has been given. (Ord. #973, Sec. 3-8.(b).)\nSection 3-10.  500-foot requirement for hotel and restaurant licenses eliminated.\nPursuant to Section 12-47-138 (1) (d) (IV), Colorado Revised Statutes, the distance restriction imposed by Section 12-47-\n138 (1) (d) (I), Colorado Revised Statutes is eliminated for hotel and restaurant licenses only. (Ord. 1383, 08/07/90.) \nSection 3-11.  Sale to certain persons prohibited.\nIt shall be unlawful for any person to sell or offer to sell, to dispense or offer to dispense, or to deliver or offer to deliver,\nany malt, vinous spirituous liquors to any person who is an habitual drunkard, or to any person who is under twenty-one\n(21) years of age or to an intoxicated person.  (Ord. 1958, Sec. 3-9.)\nSection 3-12.  Minors on licensed premises prohibited.\n(1) It shall be unlawful for any person under twenty-one (21) years of age to be in, or remain on any premises for which a\ntavern license has been issued, during those hours in which alcoholic beverages are sold or served, except in those areas of\nthe licensed premises in which the serving of alcoholic beverages is merely incidental to the serving of food, or other\nregular business of the establishment.\n(2) Any person who violates Subsection (1) of this Section shall be guilty of a misdemeanor and, upon conviction, shall be\nsubject to a fine of not more than Three Hundred Dollars ($300.00).\n(3) It shall be unlawful for any licensee, his/her agents, or employees to permit any person under the age of twenty-one\n(21) years to be in or remain on any premises for which a tavern license has been issued, during those hours in which\nalcoholic beverages are sold or served, except in those areas in which the serving of alcoholic beverages is merely\nincidental to the serving of food, or other regular business of the establishment.\n(4) Any person who violates Subsection (3) of this Section shall be guilty of a misdemeanor and, upon conviction, shall be\nsubject to imprisonment of not more than ninety (90) days, or a fine of not more than Three Hundred Dollars ($300.00),\nor both. (, Ord. 2071, Sec. 3-12, amended eff. 1/12/19)\nSection 3-13.  Hours of operation\nHours of operation for all types of licenses granted shall be those allowed pursuant to C.R.S., Article 3, Title 44, revised\nOctober 1, 2018 and as may be amended thereafter. (Ord. 2071, Sec. 3-13, repealed and re-enacted, eff. 1/12/19)\nSection 3-14.  Unlawful conduct - Licensee.\n(1)  It shall be unlawful for any licensee having authority to sell alcoholic beverages on his/her premises to permit any\ndisturbances or disorderly acts or conduct to be committed by any person or group of persons on his/her premises.\n(2)  It shall be unlawful for a licensee having authority to sell alcoholic beverages on his/her premises to in any manner\nencourage or participate in any disturbance or unlawful or disorderly act or conduct upon his/her premises, provided,\nhowever, such licensee may use such lawful means as may be proper to protect his/her person or property from damage or\ninjury.\n(3)  A licensee having authority to sell alcoholic beverages upon his/her premises shall immediately report to the police\ndepartment any unlawful or disorderly act or conduct or any disturbance committed on his/her premises.\n(4)  It shall not be a defense that the licensee was not personally present on his/her premises at the time such unlawful or\ndisorderly act, conduct or disturbance took place.  However, an agent, servant or employee of the licensee shall not be\nliable hereunder when absent from the premises and not on duty.\n(5)  It shall be unlawful for individuals employed as bartenders to consume alcoholic beverages during those times in\nwhich they are actually engaged in the serving of alcoholic beverages to customers on a licensed premises or for such\nindividuals to engage in the serving of alcoholic beverages to customers on the licensed premises while in an intoxicated\ncondition; or for a licensee having authority to sell alcoholic beverages on his/her premises to permit such conduct by\nhis/her bartenders.  Nothing in this Section shall be construed to prohibit the consumption of alcoholic beverages on a\nlicensed premises by a licensee, his/her agents or employees during such times in which they are not engaged in the\nserving of alcoholic beverages.\n(6)  Any licensee, agent, servant or employee of a licensee who shall violate any of the provisions of this Section shall be\nsubject to the penalty provided for in Section 1-8 of this Code. (Ord. 1269, Sec. 11, 7/2/85.)\nSection 3-15.  Suspension and revocation proceedings.\n(1)  The City Council shall have the power, upon its own motion or upon complaint to:\n            (a)  Summarily suspend any license for a period not to exceed fifteen (15) days, or\n(b)  Upon notice to the licensee and hearing to suspend any license for a period not to exceed six (6) months or to\nrevoke such license.\n(2)  Suspension and revocation proceedings shall be commenced by the Council by issuing and causing to be served upon\nthe licensee a notice of hearing and an order to show cause why his/her license should not be suspended or revoked\nwhenever it shall appear to the Council that there is probable cause to believe that the licensee has violated any law, any\nrule or regulation of the State Licensing Authority, or any of the terms, conditions or provisions of the license issued by the\nLiquor Authority Board.\n(3)  A hearing shall be held at a place and time designated by the Council on the day stated in the notice, or upon such\nother day as may be set for good cause shown.  Evidence in support of the charges shall be given first, followed by cross-\nexamination of those testifying thereto.  The licensee, in person or by counsel, shall then be permitted to give evidence in\ndefense, and in explanation and shall be allowed to give evidence and statements in mitigation of the charges, followed by\ncross-examination of those testifying thereto.  In the event the licensee is found to have committed the violation charged,\nor any other violation, evidence and statements in aggravation of the offense shall also be permitted, followed by cross-\nexamination of those testifying thereto.\n(4)  If the evidence presented at the hearing does not support the charges stated in the notice and order served upon the\nlicensee, but standing alone establishes the guilt of the licensee of a violation of some other law, rule or regulation, the\nlicensee shall be permitted to give evidence and statements in defense, explanation and mitigation if then prepared to do\nso.  If such evidence is not then available, but can be obtained by the licensee, the licensee shall state the substance thereof\nand upon his/her request the hearing may be recessed for not more than ten (10) days, and shall then continue under the\nsame procedure as though no recess has occurred.\n(5)  In the event the licensee is found not to have violated any law, rule or regulation, the charges against him/her shall be\ndismissed. If the licensee is found to have violated some law, rule or regulation, his/her license may be suspended or\nrevoked.\n(6)  Every licensee whose license has been suspended by the City Council shall, if ordered by the Council, post two (2)\nnotices in conspicuous places, one (1) on the exterior and one (1) on the interior of his/her premises, for the duration of the\nsuspension.  The notices shall be twenty-four inches (24\") in length and fourteen inches (14\") in width, and shall be in the\nfollowing form:\nNOTICE OF SUSPENSION\nALCOHOLIC BEVERAGE LICENSES ISSUED\nFor These Premises Have Been\nSuspended by Order Of The\nLOCAL LICENSING AUTHORITY\nFor Violation Of The\nCOLORADO BEER CODE - COLORADO LIQUOR CODE\n(7)  The temporary suspension of a license without notice pending any prosecution, investigation or public hearing as\nprovided for by the provisions of C.R.S. 12-47-110 and 12-46-107, 1973, shall be for a period not to exceed fifteen (15) days.\n (Ord. 973, Sec. 3.8(d).)\nSection 3-16.  Fine in lieu of suspension.\n(1)  (a)  Whenever a decision of the City Council suspending a retail license for fourteen days or less becomes final, whether\nby failure of the retail licensee to appeal the decision or by exhaustion of all appeals and judicial review, the retail licensee\nmay, before the operative date of the suspension, petition the City Council for permission to pay a fine in lieu of having\nhis/her retail license suspended for all or part of the suspension period.  Upon receipt of the petition, the City Council may,\nin its sole discretion, stay the proposed suspension and cause any investigation to be made which it deems desirable and\nmay, in its sole discretion, grant the petition if it is satisfied:\n(I)    That the public welfare and morals would not be impaired by permitting the retail licensee to operate during the\nperiod set for suspension and that payment of the fine will achieve the desired disciplinary purposes;\n(II)   That the books and records of the retail licensee are kept in such a manner that the loss of sales of malt\nbeverages which the retail licensee would have suffered had the suspension gone into effect can be determined with\nreasonable accuracy therefrom; and \n(III)  That the retail licensee has not had his/her license suspended or revoked, nor had any suspension stayed by\npayment of a fine, during the two years immediately preceding the date of a motion or complaint which has resulted\nin a final decision to suspend the retail license.\n            (b)  The fine shall be equivalent to twenty percent (20%) of the retail licensee's estimated gross revenues from sales\nof malt, vinous and spirituous liquors or fermented malt beverages during the period of the proposed suspension; except\nthat the fine shall not be less than Two Hundred Dollars ($200.00) nor more than Five Thousand Dollars ($5,000.00).      \n  \n            (c)  Payment of any fine pursuant to this section shall be in the form of cash or in the form of a certified check or\ncashier's check payable to the City.\n(2)  Upon payment of the fine pursuant to this section, the City Council shall enter its further order permanently staying\nthe imposition of the suspension.  The City Council shall cause such monies to be paid into the City's general fund.\n(3)  In connection with any petition pursuant to this Section, the authority of the City Council is limited to the granting of\nsuch stays as are necessary for it to complete its investigation and make its findings and if it makes such findings, to the\ngranting of an order permanently staying the imposition of the entire suspension or that portion of the suspension not\notherwise conditionally stayed.\n(4)  If the City Council does not make the findings required in paragraph (a) of Subsection (1) of this section and does not\norder the suspension permanently stayed, the suspension shall go into effect on the operative date finally set by the City\nCouncil. (Ord. 1359, 7/18/89)\nSection 3-17.  Penalty for violations.\nThe holder of any license for the sale of malt, vinous or spirituous liquors dispensing establishments found guilty of\nviolating any of the ordinances of the City relating to the conduct of his/her place of business shall be subject to the penalty\nin Section 1-8 of this Code.  (Ord. 2071, Sec. 3-17, amended, eff. 1/12/19)\nSection 3-18.  Prohibited acts; penalty. (Ord. 1678, Sec. 3-18, repealed and reenacted, eff. 12/28/01)\n(1) Except as may be authorized through approval of a Fermented Malt Beverage license, Special Event Permit or\nEntertainment District Event Permit, no person shall carry or have in his/her possession any open bottles or containers\ncontaining fermented malt beverages, or malt, vinous or spirituous liquors, nor shall any person consume any fermented\nmalt beverages, or malt, vinous or spirituous liquors on any street, sidewalk, parking lot, alley or any public school or\npublic park in the City, or in any automobile or other vehicle on a public way or public parking lot in the City, or as\notherwise authorized in this Chapter. (Ord. 2071, Sec 3-18(1), repealed and re-enacted eff. 1/12/19)\n(2) No person shall carry or have in his/her possession any open bottles or containers containing malt, vinous or\nspirituous liquors, nor shall any person drink any malt, vinous or spirituous liquor at the Trinidad Municipal Golf Course\nunless a valid liquor license that would allow for open consumption is in effect, and alcohol beverages are obtained solely\nfrom that licensee. (Ord. 2012, Sec 3-18(2), repealed and reenacted, eff. 7-29-16)\n(3)  Nothing in this section shall prohibit the POSSESSION OR consumption of fermented malt beverages at the UPPER\nFIELD BASEBALL FACILITY OF CENTRAL PARK DURING, OR IN ASSOCIATION WITH, NON-YOUTH BASEBALL\nGAMES, SUBJECT TO THE RESTRICTIONS SET FORTH IN § 12-47-901(1)(h)(I), C.R.S. (Ord. 1926, Secs 3 and 4, eff.\n3/6/12)\n(4) Every person convicted of any violation of this Section shall be punished by a fine of not more than Three Hundred\nDollars ($300.00) or by imprisonment of not more than ninety (90) days, or by both such fine and imprisonment.  (Ord.\n1926, Secs 3 and 4, eff. 3/6/12)\nSection 3-19.  Liquor license application fees. (Ord. 3062, Sec. 3-19 repealed and reenacted, eff. 2/17/23)\nThe application fees for license applications to cover actual and necessary expenses shall be as follows: \n   \n(1)          New license - One Thousand Dollars ($1,000.00)\n(2)         Transfer of ownership - Seven Hundred Fifty Dollars ($750.00)\n(3)         Renewal of license - One Hundred Dollars ($100.00)\n(4)         Renewal of expired license – Five Hundred Dollars ($500.00)\n(5)         Annual Art Gallery Fee, One Hundred Dollars ($100.00)\n(6)         Late Renewal, not more than 90-days of license expiration date – Five Hundred Dollars ($500.00)\n(7)         Reissue Fee, more than 90-days but less than 180-days of license expiration date – Five Hundred Dollars\n($500.00)\n(8)         Reissue Fine, more than 90-days but less than 180-days of license expiration date – Twenty-Five Dollars ($25.00)\na day beyond 90-day expiration date\nThe additional allowable fees to cover actual and necessary expenses shall be as follows: \n(1)          Change of location – Seven Hundred Fifty Dollars ($750.00)\n(2)         Corporate/LLC Change Per Person – One Hundred Dollars ($100.00)\n(3)         Manager Registration (Hotel & Restaurant; Tavern; Lodging & Entertainment;   Campus Liquor Complex – Thirty\nDollars ($30.00)\nSection 3-20.  Fees for Special Events Permits. (Ord. 3062, Sec. 3-20 repealed and reenacted, eff. 2/17/23)\nSpecial events permit fees for organizations and political candidates qualifying under state law for the sale, by the drink\nonly, of fermented malt, or malt, spirituous and vinous liquors shall be as follows, to cover the expenses of investigation\nand issuance of the permit:\n(a)         Malt, Vinous and Spirituous – Seventy-Five Dollars ($75.00) per day\n(b)         Fermented Malt Beverage – Seventy-Five Dollars ($75.00) per day\nSection 3-21.  Optional premises standards. (Ord. 1638, Sec. 3-21, eff. 8/11/00)\nThe following standards for the issuance of optional premises licenses and for optional premises for a hotel and restaurant\nlicense are hereby adopted:  \n(1) The standards adopted herein shall be considered in addition to all other standards applicable to the issuance of\nlicenses under the Colorado Liquor Code for an optional premises license and for optional premises for a hotel and\nrestaurant license.  These two types of licenses for optional premises shall be collectively referred to as “optional premises”\nin these standards unless otherwise provided.  \n(2) Outdoor sports and recreational facility shall mean a golf course.  \n(3) An optional premises may only be approved when that premises is located on or adjacent to an outdoor sports and\nrecreational facility.  \n(4) When submitting a request for the approval of an optional premises an applicant shall submit the following\ninformation in addition to information required by the State licensing authority and this\nChapter of this Code:  \n(a) A detailed diagram of the outdoor sports and recreational facility showing:  \n(I)        The location of the outdoor sports and recreational facility;  \n                        (II)       The location of all proposed optional premises;    \n                               \n(III)      The proposed locations of any permanent, temporary or movable structure or vehicle located on an\noptional premises and used to dispense alcoholic beverages;  \n                        (IV)     The seating, if any;  \n                        (V)      Restroom facilities, if any;  \n                        (VI)     Restrictions, if any, to access to the optional premises;  \n                        (VII)    Location of secured area or areas for use in storing malt, vinous and spirituous liquors for future use\non the optional premises.  \n(b) A written statement setting forth what will be done to secure the optional premises and\nstorage area or areas and the reason why the license should be granted; and  \n            (c) Such other information as reasonably may be required to satisfy the City that control of the optional premises\nwill be assured, and that the health, safety and welfare of the neighborhood and outdoor sports and recreational users will\nnot be adversely affected should the license be issued.  \n(5) If the applicant does not own the proposed optional premises, he/she shall submit to the City Clerk a written statement\nby the owner of the premises approving the application sought.  \n(6) The applicant shall provide the City Clerk with evidence that the State Licensing Authority has approved the location\nproposed to be optional premises, as required by the Colorado Liquor Code.  \n(7) An application for a new hotel and restaurant license with optional premises shall be processed in the same manner as\nany other hotel and restaurant license application.  If an application to use optional premises is filed in connection with an\nexisting hotel and restaurant license, then the application shall be processed in the same manner as an application to\nmodify or expand licensed premises.  No fee shall be required in connection with an application for an optional premises\nrelating to an existing hotel and restaurant license.  \n(8) No one licensee shall have more than four (4) optional premises within an outdoor sports and recreational facility.  \n(9) No alcoholic beverages may be served on the optional premises until the licensee has provided notice to State and Local\nLiquor Licensing Authorities forty-eight (48) hours prior to serving alcoholic beverages on the optional premises.  Such\nnotice must contain the specific day and hours on which the optional premises are to be used.  In this regard, there is no\nlimitations on the number of days which a licensee may specify in each notice.  However, no notice may specify any date of\nuse which is more than 180 days from the notice date.  \nSection 3-22.            Liquor Tasting Permits. (Ord. 1911, Sec. 3-22 eff. 1/28/11)\n(1)  Authorization.  The City Council is authorized to issue permits for alcoholic beverage tastings, as defined by the\nColorado Liquor Code, § 12-47-101 et seq., C.R.S., to a retail liquor store licensee or liquor-licensed drugstore licensee,\nsubject to the provisions of the Colorado Liquor Code and this Section.  \n(2)  Permit required.  It shall be unlawful for any person to conduct a tasting without first having obtained a valid tastings\npermit as provided in this Section.   \n(3)  Application Requirements.   \n(a)       Application for a tastings permit shall be made to the Office of the City Clerk upon forms provided by the\nOffice of the City Clerk.  Applications shall provide a schedule of dates and times that tastings will be held, and such\nother information as reasonably may be required to satisfy the City Council that tastings will be conducted without\nviolations of the Colorado Liquor Code and without creating a public safety risk to the neighborhood.  Tasting\nschedules shall not exceed one (1) year in duration\n(b)       An application to conduct a tasting or tastings must be submitted to the Office of the City Clerk no later than\nthirty (30) days prior to the date of the first tasting included in the permit.  At the time of permit application, the\nOffice of the City Clerk shall collect a permit application fee in the amount of Fifty Dollars ($50.00) to cover\nexpenses associated with investigation and issuance of the permit.  \n(c)       Any additions or changes to a schedule submitted with an application must be submitted in writing to the\nOffice of the City Clerk no later than thirty (30) days prior to the date(s) to be added or changed.  \n(d)       No application for a tasting permit shall be approved if the licensee has had his or her license suspended or\nrevoked, or had any suspension held in abeyance or stayed by payment of fine, during the six (6) month period\nimmediately preceding the date of the application.  (Ord. 1911, Eff. 1-28-11)\n(e)       Any of the disciplinary actions detailed in paragraph (d) of this subsection shall result in the cancellation of\nany scheduled tasting dates pending the City Council’s approval of a new application\n(4)       Limitations on Tastings.  Tastings shall be conducted in conformance with §44-3-301 (10), C.R.S. (Ord. 2071, Sec 3-\n22 (4), amended eff. 1/12/19)\nSection 3-23.            Alcohol beverage festival permit standards. (Ord. 3037, Sec. 3-23, eff. 5/13/22)\nThe following standards for the approval of an alcohol beverage festival permit are hereby adopted:\n(1) The standards adopted herein shall be considered in addition to all other standards applicable to the issuance of\nlicenses under the Colorado Liquor Code for an alcohol beverage festival permit and a City of Trinidad Special Events\nPermit pursuant to Chapter 21 and Chapter 3, Alcoholic Beverages, of the Trinidad Municipal Code.\n(2) Permit required. It shall be unlawful for any licensee to conduct a festival without having first obtained a valid alcohol\nbeverage festival permit as provided by this Section.\n(3) Application requirements.\n(a) A copy of the complete Alcohol Beverage Festival Permit Application with all required attachments for every\nfestival to be held within the City’s corporate limits shall be filed with the City Clerk on the form provided by the\nState Liquor Licensing Authority, no later than thirty (30) days before the proposed festival if it is to be held on\nprivate property. (Ord. 3093, Sec. 3-23(3)(a) amended, eff. 5/17/24)\n(b) If an alcohol beverage festival is proposed to be held on public property necessitating the permission of the City\nof Trinidad, a copy of the complete Alcohol Beverage Festival Permit Application with all required attachments for\nevery alcohol beverage festival to be held within the City’s corporate limits shall be filed with the City Clerk on the\nform provided by the State Liquor Licensing Authority, no later than forty-five (45) days before the proposed festival.\nShould the proposed alcohol beverage festival be sought on City property, the applicant shall be required to conform\nto the requirements set forth in Chapter 21, Special Events, of the Trinidad Municipal Code.\n(4) Limitations on alcohol beverage festivals. The following limitations for alcohol beverage festival permits are hereby\nadopted (the limitation of which only applies to alcohol beverage festivals without consideration to other Special Event\npermitted functions):\n(a) Alcohol beverage festivals on main throughfare public rights-of-way will be limited to four (4) per calendar year.\n(i) Main throughfares include Main Street, Commercial Street, Santa Fe Trail, Nevada Avenue, and Animas\nStreet\n(b) Alcohol beverage festivals on non-main throughfare public rights-of-way will be limited to eight (8) per calendar\nyear.\n(c) Alcohol beverage festivals in public parks will be limited to eight (8) per calendar year.\n(d) Where an alcohol beverage festival occurs on a throughfare and also encompasses a park, the alcohol beverage\nfestival shall be counted against the total number of allowable events on the throughfare.\n(e) Alcohol beverage festivals on private property shall not be limited except as otherwise limited pursuant to C.R.S.\n§44-3-404.\n(f) Due to the limitations in number of alcohol beverage festivals on public property and the draw on public\nresources, alcohol beverage festivals should be coordinated so as to be inclusive with other allowable licensees.\n(g) Due to the limitation of City resources, particularly with respect to public safety, consideration will be given by\nthe City in all instances in its approval or disapproval of applications. Except under exceptional circumstances, only\none alcohol beverage festival permit shall be granted per weekend.\n(h) Applicants must provide security by a private source, with full coordination and cooperation with the Trinidad\nPolice Department.\n(i) Use of public property is subject to a refundable deposit of $3,000, should there be no damage to the public\nproperty or neighboring private property.\n(j) Insurance will be required for Alcohol Beverage Festivals on all public property in accordance with Trinidad\nMunicipal Code, Chapter 21, Special Events.\n(k) Notification to businesses within the alcohol beverage festival area, when held on public property, must be\naccomplished by the applicant no less than 20 days prior to the alcohol beverage festival. The applicant is required to\nprovide written proof of notification to those businesses to the City Clerk no less than 10 days prior to the event.\nAlcohol beverage festival area is defined as that area abutting the outside perimeter of and all of that area within the\nsecured perimeter of the alcohol beverage festival, which may be affected by reduced and/or increased motorist\nand/or pedestrian traffic due to the event.\n(l) A safety and security plan for each alcohol beverage festival must be submitted with the application.\n(m) In accordance with C.R.S. §44-3-404, if a violation of the Colorado Liquor Code or Trinidad Municipal Code,\nAlcohol Beverages, occurs during an alcohol beverage festival and the licensee responsible for the violation can be\nidentified, the state or local licensing authority may charge and impose appropriate penalties on the licensee.\n(n) Alcohol beverage festivals may only be held on property zoned as Community Commercial, Historic Preservation\nand in Commercial property of a PUD.\n(o) Licensees participating in an alcohol beverage festival are obligated at all times to immediately report to the\npolice department any unlawful or disorderly act or conduct or any disturbance committed upon the alcohol\nbeverage festival premises.\n(5) Decision by City Clerk. The City Clerk in coordination with all pertinent municipal departments shall administratively\nprocess and approve, conditionally approve or deny alcohol beverage festival permit applications, or may refer the\napplication to the City Council who shall approve, conditionally approve, or deny alcohol beverage festival applications.\nThe City Clerk may impose reasonable terms and conditions on a licensee seeking an alcohol beverage festival permit as\nmay be necessary to protect the public health, safety and welfare or to obtain or ensure compliance with this Article, this\nCode and applicable state law. The City Clerk shall provide written notice of his or her decision, including the reason(s)\ntherefor, by first-class, postage-prepaid U.S. mail and/or by email to the Applicant at the address shown in the application.\nAn Applicant whose alcohol beverage festival application is denied or conditionally approved may appeal the Clerk’s\ndecision to the Authority by filing written notice of appeal with the City Clerk within five (5) days of the date of issuance of\nthe decision. The City Clerk shall cause the appeal to be placed on the next regular City Council meeting for consideration\nof the same.\n(6) Decision by Authority. If the City Clerk refers an alcohol beverage festival permit to City Council as the local licensing\nauthority, the Clerk shall cause the alcohol beverage festival application to be placed on the next regular meeting agenda of\nthe Council following receipt by the Clerk. The applicant shall be in attendance at the Council meeting at which his/her\nalcohol beverage festival application is presented to the Council. At the time of presentation of the alcohol beverage festival\napplication, the Council shall be furnished with all pertinent information to assist in rendering their decision.\n(7) Denial. The City Clerk and/or the Authority may refuse to approve an alcohol beverage festival permit for any of the\nfollowing reasons: Failure to comply with City, State or Federal Building Codes, Fire Codes or Electrical Codes; a history of\nviolations of the Colorado liquor code or Trinidad Municipal Code, or liquor rules; any other reasons set forth under State\nor local law; and any other good cause reasons.\n(8) Prevailing Code. If any language herein is contrary to or in conflict with that contained in Chapter 21, Special Events,\nthe provisions and requirements of this section shall prevail. This Section 3-23 is intended to supplement the\nrequirements contained in Chapter 21 and mesh harmoniously with the same.\n"}