{"Chapter 21 - [Title from PDF Content]": "Chapter 21 - Special Events\nARTICLE 1. IN GENERAL.\nSections:\n1-1. Short Title\n1-2. Purpose.\n1-3. Findings.\n1-4. Definitions\n1-5. Permit Required.\n1-6. Exemptions.\nARTICLE 2. APPLICATION.\n2-1.                  Application for Permit.\n2-2.                  Fees.\n2-3.                  Investigation of Application.\n2-4.                  Permit.\n2-5.                  Relationship to Other City Ordinances\n2-6.                  Denial of Permit.\n2-7.                  Authority to Impose Conditions on Permit.\n2-8.                  Non-Discrimination and Content Policy\n2-9.                  Decision by City Manager or their designee.\n2-10.                Notice of Decision.\n2-11.                Appeal, Denial, or Conditional Approval of Permit.\n2-12.                Contents of Permit.\n2-13.                Permit Not Transferable.\n2-14.                Notice of Issuance of Permit.\n2-15.                Insurance Requirement\n2-16.                Duties of Permittee.\n2-17.                Posting of Permit.\n2-18.                Suspension or Revocation of Permit.\n2-19.                Penalties, Injunctive Relief.\n2-20.                Rules and Regulations.\nCHAPTER 21. SPECIAL EVENTS\nARTICLE 1. IN GENERAL.\nSection 1-1. Short Title\nThis chapter shall be known and may be cited as the City of Trinidad Special Events Ordinance.\nSection 1-2. Purpose.\nThe purpose of this chapter is to establish a procedure for permitting and regulating special events, as that term is defined\nin this chapter. The permitting process established by this chapter is intended to be content-neutral and not subject -\nmatter based. This chapter is intended merely to establish a nondiscriminatory mechanism by which the City can control,\nthrough appropriate regulation, the holding of special events.\nSection 1-3. Findings.\n\nThe City Council hereby finds and determines as follows:\nA. The City of Trinidad is authorized to regulate businesses operating within the City pursuant to Chapter 9 of the\nCity of Trinidad Municipal Code and Section 31-15-501, Colorado Revised Statutes.\nB. The City of Trinidad also may issue temporary permits for any public space or property within the City of Trinidad\npursuant to 11.14 of the City of Trinidad Charter.\nC. Special events, as defined in this chapter, contribute to the economic, cultural, social, and environmental health\nand well - being of the community.\nD. Special events, however, create special regulatory concerns, including, but not limited to, the need for crowd\ncontrol, sanitation, security, traffic management, parking, infrastructure, and desire to balance the quality and\nquantity of events.\nE. In enacting this chapter the City council is exercising its police power as granted by the City's Charter, and the\nConstitution and Statutes of the State of Colorado, as well as its power to license and regulate business activities.\nDEFINITIONS:\nSection 1-4. Definitions\nAs used in this chapter the following words have the following meanings, unless the context clearly requires otherwise:\n(1) APPLICANT: A person or entity who has submitted an application for permit pursuant to this chapter.\n(2) APPLICATION:  An application for permit submitted pursuant to this chapter.\n(3) DAY: A calendar day, unless otherwise indicated.\n(4) ENTERTAINMENT: Includes, but is not limited to, touring exhibitions, concerts, performances of dance, music,\ndrama, art and comedy, parades, sporting exhibitions or contests, festivals, fairs, automotive displays, and\nperformances of skill.\n(5) FILMING: The taking of motion pictures, the taking of still photography or the use and operation of television\ncameras or transmitting television equipment, including radio remotes and any preparatory activity associated\ntherewith, and shall include events that include, but are not limited to, the making of feature or documentary films,\ntelevision serials, webcasts, simulcasts or specials. The City Manager or their designee has discretion to set\nadministrative rules and regulations adopted pursuant to Section 2-20 of this chapter appropriate exemptions from\nthe permitting requirements of this chapter for filming and photography activities not significantly affecting City\nproperty and not requiring substantial City services .\n(6) PERMIT: A permit issued by the City pursuant to this chapter.\n(7) PERMITTEE: The applicant to whom a permit has been issued pursuant to this chapter.\n(8) PERSON: Has the meaning provided in Section 1-4(1) of this code.\n(9) SPECIAL EVENT OR EVENT: A planned or organized occurrence that:\nA. Includes an expected gathering if:\ni.) the primary purpose of the occurrence is entertainment;\nii.) the public or a substantial portion of the public is invited to the occurrence, either by express invitation or\nby implication; and,\niii.) the occurrence is expected to have a visual, sound, or environmental impact, or to cause disruption of the\nnormal routine of the community or the affected neighborhood; or i nvolves filming .\nSection 1-5. Permit Required.\nNo person shall stage, hold, present, or conduct a special event within the City without a valid permit issued in accordance\nwith this chapter.\nSection 1-6. Exemptions.\nThe requirements of this chapter shall not apply to:\n(1) A special event  held by the  City;\n(2) An event held at Central Park, or the City's multipurpose fields contracted through the Parks and Recreation\nDepartment and constituting \"normal or regular\" use of those City facilities.\nARTICLE 2. APPLICATION\nSection 2-1. Application for Permit.\nA person seeking to obtain a permit shall file an application with the City Manager or their designee. The form of the\napplication shall be established by the City Manager or their designee in the administrative rules and regulations adopted\npursuant to Section 2-20 of this chapter.\n(1) An application for a special event permit shall be filed with the City Manager or their designee not less than forty-five\n(45) days no more than three hundred sixty five (365) days before the special event is proposed to begin. The City Manager\nor their designee may waive the minimum forty-five (45) day filing period and accept an application filed within a shorter\ntime period if, after due consideration of the date, time, place, and nature of the special event, number of events on the\nproposed date, the anticipated number of participants, and the City services required in connection with the special event,\nthe City Manager or their designee determines that sufficient time exists for the proper investigation and review of the\napplication; that the waiver will not present a hazard to public health, safety or welfare; and that the waiver will not create\na substantial burden on the City's staff or financial  resources.\n(2) An applicant may be required to obtain a building permit depending on the size and scale of any temporary structures\nproposed to be used in connection with the special event. The need for a building permit will be determined by the City\nManager or their designee once the application has been received and reviewed.\n(3) An application for a special event permit shall contain such information as shall be established in administrative rules\nand regulations adopted pursuant to Section 2-20 of this chapter.\n(4) Applications shall be processed by the City Manager or their designee in order of receipt.\nSection 2-2. Fees.\n(1) When an application is filed, an applicant shall pay to the City a nonrefundable application fee in such amount as shall\nbe established by the City Manager or their designee in the administrative rules and regulations adopted pursuant to\nSection 2-20 of this chapter.\n(2) If  the application includes a request to use any City property or any City service in connection with the special event,\nthen before the permit is issued the applicant shall pay to the City any required charges, fees, or deposits required by the\nCity in connection with the use of the requested City property or the provision of the requested City service.\nSection 2-3.  Investigation of Application.\n(1) Upon receipt of a properly completed application, together with all information required in connection therewith, and\nthe payment of the application fee as required by Section 2-2 of this chapter, the City Manager or their designee or their\ndesignee shall transmit copies of the application to such persons, agencies, or departments as identified in the\nadministrative rules and regulations adopted pursuant to Section 2-20 of this chapter.\n(2) Within fourteen (14) days of receipt of a completed application those City Departments and other referral agencies\nshall provide with comments concerning the application. If an application is accepted less than forty-five (45) days before\nthe proposed special event is to be held, the City Departments and other referral agencies shall use their best efforts to\nprovide their comments in a timely manner so that the City Manager or their designee will have the comments before\nmaking a decision on the application.\nSection 2-4. Permit.\nThe City Manager or their designee shall issue a permit when, from a consideration of the application and from such other\ninformation as may otherwise be obtained, the City manager or their designee determines that:\n(1) The application (including any required attachments and submissions) is complete and sign by the applicant;\n(2) The applicant has paid the application fee and any other fees required by Section 2-2 of this chapter;\n(3) The application does not contain a material falsehood or misrepresentation;\n(4) The application complies with all of the requirements of this chapter;\n(5) The applicant is legally competent to contract under Colorado law;\n(6) The applicant or the person on whose behalf the application is made has not previously damaged City property and\nfailed to pay in full for such damage, and the applicant does not have other outstanding and unpaid debts to the City;\n(7) The duration of the event will not be longer than three (3) consecutive days, unless the City Manager or their designee\nafter taking into account all relevant factors related to the event, determines that the proposed event may be longer;\n(8) The proposed special event will not conflict with:\na. A special event for which a permit has previously been issued; if concurrent events are scheduled to occur, it shall\nbe determined by the City Manager or their designee, if one or both are allowed to occur.\nb. A City-sponsored event;\nc. An annual special event which is reasonably expected to be held again, but for which an application has yet to be\nsubmitted.\n(9) The holding of the proposed special event will not cause significant disruption in the ability of the City to deliver or\nprovide essential governmental services;\n(10) Adequate sanitation and other required health facilities are or will be made available at or sufficiently near to the\nproposed special event area(s);\n(11) Sufficient parking is available near the site of the proposed special event to accommodate the number of vehicles\nreasonably expected for the event, or an acceptable transportation and  parking plan to provide adequate  parking for the\nproposed  special event has been submitted and approved  by the City Manager;\n(12) The proposed special event will not pose a danger to the public health, safety or welfare;\n(13) The proposed special event will positively impact the City culturally, economically, environmentally or socially.\nSection 2-5. Relationship to Other City Ordinances\nNotwithstanding anything contained in this code to the contrary :\n(1) A permit issued under this chapter is not a special-events liquor license. If alcoholic beverages are to be served at the\nspecial event, the permittee must obtain the  required  permit or approval from the City clerk or the City of Trinidad  liquor\nlicensing    authority.\n(2) Except as specifically provided in this section, in addition to a permit a permittee must obtain all other required City\npermits and approvals before holding the special event authorized by the permit.\nSection 2-6. Denial of Permit.\nA. The City Manager or their designee shall deny an application for a special event permit if the City Manager or their\ndesignee determines that:\n(1) The application conflicts with another event as described in subsection Section 2-4(8)(a) of this chapter;\n(2) Information contained in the application, or supplemental information requested from the applicant,  is found to be\nfalse  in any material  respect;\n(3) The application fails to meet any of the standards  set forth in Section 2-4 of this chapter;\n(4) The time, route, or size of the event will substantially interrupt the safe and orderly movement of traffic on or\ncontiguous to the event site or route or will disrupt the use of a street or highway at a time when  it is usually subject to\nheavy traffic   congestion;\n(5) The location of the event will substantially interfere with any construction or maintenance work scheduled  to take\n place upon or along the City streets  or  property;\n(6) The applicant has failed to pay costs, fees, or deposits for a previous special event permit within the preceding five (5)\nyears; or the applicant has failed to pay the City for damages arising from a previous special event held by the applicant ,\nregardless of when such event was held; or\n(7) The applicant has failed to abide by the requirements or conditions of previous special event permits within the\npreceding five (5) years.\nSection 2-7. Authority to Impose Conditions on Permit.\n(1) The City Manager or their designee shall have the authority to impose such reasonable terms and conditions on a\npermit as may be necessary to protect the public health, safety, and welfare; to promote economic success, and to obtain\ncompliance with the requirements of this chapter and applicable law.\n(2) The City of Trinidad has the authority based on the Municipal Charter and Code to impose a change of venue to any\nand all events if it has determined that the proposed area limits total economic viability of the City of Trinidad.\n(3) The City Manager or their designee shall have the authority to ensure that all permit applications conform to the\nColorado Non-Discrimination Statutes.\nSection 2-8. Non-Discrimination and Content Policy\nThe City Manager or their designee shall uniformly consider each application for a permit upon its merits, and shall not\ndiscriminate in granting or denying a permit under this chapter based upon race, creed, color, religion, national origin,\nancestry, sex , age, veteran status, sexual orientation, or physical or mental disability. Further, the City Manager or their\ndesignee shall be content neutral in reviewing an application, and shall not consider the subject matter of any type of\nspeech proposed as part of the application.\nSection 2-9. Decision by City Manager or their designee.\nThe City Manager or their designee shall approve, deny or conditionally approve an application within thirty  (30) days of\nthe receipt of the completed application unless, by written notice to the applicant, the decision  period is extended for an\nadditional ten (10) days; provided, however, the City Manager or their designee shall  render a decision on an application\n not less than seventy two (72) hours prior to the  scheduled  commencement of the special event which  is the subject of\nthe application.\nIn the event an application is conditionally approved, the City Manager or their designee shall clearly set forth in writing\nthe conditions of approval.\nSection 2-10. Notice of Decision.\nThe City Manager or their designee shall notify the applicant of the decision on the application within three (3) business\ndays of rendering the decision. Notice shall be given by mailing a copy of the City Manager or their designee's decision to\nthe applicant by regular mail, postage prepaid, at the address shown in the application. Notice is deemed to have been\nproperly given upon mailing.\nSection 2-11. Appeal, Denial, or Conditional Approval of Permit.\n(1) An applicant has the right to appeal directly to the City Manager in regards to a denial or conditional approval of an\napplication to the City council.\n(2) An applicant does not have the right to appeal a change of venue or location.\n(3) The burden of proof in an appeal filed under this section shall be on the applicant.\n(4)  If there is any conflict between the provisions and requirements of this section and the provisions and requirements of\nthis code, the provisions and requirements of this section shall control\nSection 2-12. Contents of Permit.\nThe required contents of a permit shall be established by the City Manager or their designee in administrative rules and\nregulations adopted pursuant to Section 2-20 of this chapter .\nSection 2-13. Permit Not Transferable.\nA permit is nontransferable and non-assignable. Any attempt to transfer or assign such permit voids the permit.\nSection 2-14. Notice of Issuance of Permit.\nImmediately upon the issuance of a permit, the City Manager or their designee shall send a copy of the permit to such\npersons, agencies, or departments as the City Manager or their designee shall identify in administrative rules and\nregulations adopted pursuant to Section 2-20 of this chapter.\nSection 2-15. Insurance Requirement\n(1) E ach permit shall require the permittee to file prior to commencement of the setup of the special event a certificate of\ninsurance demonstrating that the permittee has in effect a policy or policies of general liability insurance covering the\nspecial event with minimum combined single limits of not less than one million dollars ($1,000,000.00).\n(2) Such insurance shall remain in full force throughout the entirety of the special event for which the permit is issued.\n(3) The City shall be named as an additional insured und er such insurance policy. If alcoholic beverages will be served at\nthe special event, the permittee must also provide proof of liquor liability insurance.\nSection 2-16. Duties of Permittee.\nIn connection with the holding of the event for which a permit is issued, a permittee shall:\n(1) Comply with all of the terms  and conditions of the permit;\n(2) Comply with all applicable City Ordinances and state and federal laws; and\n(3) Permit inspection of its records and special event facilities by the City Manager or their designee for the purpose of\ndetermining the permittee's compliance with the terms and conditions of the permit. special event facilities by the City\nManager or their designee for the purpose of determining the permittee's compliance with the terms and conditions of the\npermit. ???\nSection 2-17. Posting of Permit.\nA permit shall be continuously posted in a conspicuous location at the site of the special event throughout the duration of\nthe special event.\nSection 2-18. Suspension or Revocation of Permit.\nA. A permit issued pursuant to this chapter may be suspended or revoked by the City Manager or their designee after\nhearing for the following reasons:\n(1) Fraud, misrepresentation or a false statement of material fact contained in the permit application;\n(2) A violation  of any city, state, or federal  law or  regulation;\n(3) A violation  of any of the terms and conditions of the permit;\n(4) A  violation  of any of the provisions of this  chapter;\n(5) Any outside factor that may or indeed poses a risk to public health, safety, or welfare\nB. In connection with the suspension of a permit, the City Manager or their designee may impose reasonable conditions.\nC. In deciding whether a permit should be suspended or revoked, and in deciding what conditions to impose in the event\nof a suspension,  if any, the City Manager shall   consider:\n(1) The nature and seriousness  of the violation;\n(2) Corrective action, if any , taken by the permittee;\n(3) Prior violation(s), if any , by the permittee;\nThe likelihood of recurrence;\n(4) All circumstances surrounding the violation;\n(5) Whether the violation was willful;\n(6) The number of previous special events held by the permittee;\n(7) The number of previous violations by the permittee; and\n(8) Previous sanctions, if any, imposed against the permittee.\nE. The City Manager or their designee shall have the authority to summarily suspend a permit during a special event if it\nappears that a permittee has violated one or more of the terms and   conditions of a permit or any applicable law and,\nbased upon the available information, results in an immediate threat to the public health, safety and welfare. No appeal is\nallowed from a summary suspension of a permit issued by the City Manager or their designee pursuant to this subsection.\nF. No fee previously paid by a permittee in connection with the application shall be refunded if such permit is suspended\nor revoked.\nSection 2-19. Penalties, Injunctive Relief.\nA, It is a misdemeanor offense for any person to violate any provision of this chapter. Any person convicted of having\nviolated any provision of this chapter shall be punished as set forth in Section 1 of this code.\nB. The staging, holding, presenting, or conducting of a special event without a valid permit issued pursuant to this chapter\nmay be enjoined by the City in an action brought in a court of competent jurisdiction, including, but not limited to, the\nCity's Municipal Court pursuant to this code.\nSection 2-20. Rules and Regulations.\nThe City Manager shall have the authority from time to time to adopt, amend, alter, and repeal administrative rules,\nregulations and fees as may be necessary for the proper administration of this chapter .\n"}