{
    "chapter": "Chapter 11 -  Municipal Solid Waste",
    "content": "Chapter 11 - Municipal Solid Waste\nSections:\n11-1                       Title.\n11-2                       Definitions and rules of construction.\n11-3                       Who may collect, transport and dispose of municipal solid waste.\n11-4                       Licensing procedure - Fee.\n11-5                       Vehicles used in transporting municipal solid waste.\n11-6                       Insurance requirements.\n11-7                       Suspension or revocation of license.\n11-8                       Storage and placement of municipal solid waste.\n11-9                       Scattering of municipal solid waste.\n11-10                     Accumulation and use of manure.\n11-11                     Burning of municipal solid waste.\n11-12                     City Landfill fees.\n11-13                     Penalty for violation.\nCHAPTER 11.  MUNICIPAL SOLID WASTE\nSection 11-1.  Title.\nThis article shall be known as and may be cited as the \"Municipal Solid Waste Ordinance of the City of Trinidad,\nColorado.\"\nSection 11-2.  Definitions and rules of construction.\nFor the purposes of this Chapter, the following terms, phrases, words and their derivations shall have the meaning given\nherein.  When not inconsistent with the context, words used in the present tense include the future, words in the plural\nnumber include the singular number and vice versa. The word \" shall \" is mandatory and the word \" may \" is permissive.\n(1) Asbestos material shall mean any material that contains more than one percent (1%) asbestos by weight or volume.\n(2) Hazardous waste shall mean any material, alone or mixed with other materials, which has no commercial use or value,\nor which is discarded or is to be discarded by the possessor thereof, either of which because of its quantity, concentration,\nor physical, or chemical characteristics may cause or significantly contribute to an increase in mortality or an increase in\nserious irreversible or incapacitating reversible illness; or pose a substantial present or potential hazard to human health\nor to the environment when improperly treated, stored, transported, disposed of, or otherwise managed.  The term does\nnot include: discharges which are point sources subject to permits under Section 402 of the \"Federal Water Pollution\nControl Act,\" as amended; source, special nuclear, or byproduct material as defined by the Federal \"Atomic Energy Act of\n1954\", as amended; agricultural waste from the raising of crops or animals, including animal manures, which are returned\nto the soils as fertilizers or soil conditioners; domestic sewage; irrigation return flows; inert materials deposited for\nconstruction for fill or topsoil placement in connection with actual or contemplated construction at such location or for\nchanges in land contour for agricultural and mining purposes, or any waste or other materials exempted or otherwise not\nregulated as hazardous waste under the federal act.\n(3) Municipal solid waste shall mean solid waste from community, commercial and industrial sources that does not\ncontain hazardous wastes as defined in Section 25-15-101 (6) of the Colorado Hazardous Waste Act unless otherwise\nregulated by the Colorado Department of Public Health and Environment.\n(4) Recyclable materials shall mean a type of material that is subject to reuse or recycling.\n(5) Recyclable operation shall mean that part of a solid waste disposal facility, or a part of a general disposal facility at\nwhich recyclable materials may be separated from other materials for further processing.\n\n(6) Sanitary landfill shall mean the final disposal of solid waste on land by a method employing compaction of the waste\nand covering with earth or other suitable material, in compliance with the act and these department regulations.\n(7) Scrap tire shall mean a tire that is no longer used for its original purpose.\n(8) Scrap tire recycling shall mean the sale of scrap tires in the used-tire market, the sale of tire casings or carcasses for\nretreading purposes, or the extraction of useful materials or energy from the tires through thermal, chemical, or physical\nprocessing.\nSection 11-3.  Who may collect, transport and dispose of municipal solid waste.\n(1)  All municipal solid waste generated and/or accumulated within the City shall be collected, conveyed and disposed at a\nsanitary landfill by a licensed contractor or City licensed municipal solid waste collection operator.  No person shall hire\nhimself/herself out to collect, convey over any of the streets or alleys of the City or dispose of any municipal solid waste\nwithout having obtained the required license issued by the City.  The provisions of this Chapter, however, shall not\nprohibit the actual producer or generator at any municipal solid waste or the owner of the premises upon which municipal\nsolid waste has accumulated, from personally collecting, conveying and disposing of such municipal solid waste at a\nsanitary landfill.  Recyclable materials may be accumulated and disposed of separately from other municipal solid waste at\nan approved public or private recycling operation.\n(2)  Scrap tires may be disposed of at a sanitary landfill for scrap tire recycling.\n(3)  No hazardous waste or asbestos material may be accumulated nor disposed of at a sanitary landfill unless such\nsanitary landfill has been authorized by the Colorado Department of Public Health and Environment for such purposes.\nSection 11-4.  Licensing procedure - Fee.\nIt shall be unlawful for any person to hire himself/herself to collect, convey over any of the streets or dispose of any\nmunicipal solid waste without having obtained a license to haul municipal solid waste from the City Clerk.  No license shall\nbe issued until the applicant has paid the annual license fee of One Hundred Dollars ($100.00) and has met the\nrequirements of Sections 11-5 and 11-6 of the Code of Ordinances.  Application shall be made in the manner set forth for\nbusiness licenses in Chapter 9 of the Code of Ordinances.\nSection 11-5.  Vehicles used in transporting municipal solid waste.\n(1)  All vehicles used in the business of transporting municipal solid waste within the City, shall, at a minimum, have the\nfollowing:\n(a)  A permanent cover of canvas or equally suitable or superior material designed to cover the entire open area of\nthe body of such vehicle;\n(b)  A body so constructed as to be permanently leak-proof as to such municipal solid waste;\n(c)  Extensions of sideboards and tailgate, if any, constructed of permanent materials.\n(2)  Prior to the issuance of any license or renewal of the same, the City shall inspect all vehicles\nused in the transporting of solid waste to determine that such vehicles meet the requirements set forth in this Section.  No\nvehicle shall be used in the business of transporting municipal solid waste unless it has been inspected by the City and\nshall have been determined to meet the requirements set forth in this Section.\nSection 11-6.  Insurance requirements.\nAny person in the business of transporting municipal solid waste, within the City, must have, prior to commencing such\noperations, and at all times after commencing such operations, in each motor vehicle used in such business, a motor\nvehicle liability insurance policy or evidence of such policy issued by an insurance carrier or insurer authorized to do\nbusiness in the State of Colorado in the sum of not less than One Hundred Fifty Thousand Dollars ($150,000.00) for\ndamages for or on account of any bodily injury to or the death of each person as the result of any one accident, in the sum\nof not less than One Hundred Fifty Thousand Dollars ($150,000.00) for damages to the property of others as the result of\nany one accident, and in the sum of not less than Four Hundred Thousand Dollars ($400,000.00) for damages for or on\naccount of any bodily injury to or death of all persons and for damages to the property of others.\nSection 11-7.  Suspension or revocation of license.\nIn addition to the penalties set forth in Section 11-13 of the Code of Ordinances, violation of either Section 11-5 or 11-6 shall\nbe grounds for suspension or revocation of the license to transport municipal solid waste.  Any person suspected of such\nviolation shall be provided a written notice of the alleged violation by the City Clerk, which notice shall advise the licensee\nof the date and time of the hearing on said violation.  The City Clerk shall hold a hearing on the alleged violation on the\ndate and time set in the notice, at which the licensee shall be present.  Should the City Clerk find that a violation has\noccurred, she/he shall suspend or revoke the license to transport municipal solid waste.\nSection 11-8.  Storage and placement of municipal solid waste.\n(1)  All municipal solid waste accumulated for collection and disposal shall be placed in a leak proof metal or plastic\ncontainer.  Grass clippings, tree trimmings and other similar vegetative waste shall be likewise kept in a metal or plastic\ncontainer or boxed or bagged except that tree trimmings need not be kept in a container, box or bag, provided they are cut\ninto strips of no greater than three feet in length and piled or stacked neatly.  All municipal solid waste containers shall be\nkept free of rodents, insects, bugs and other vectors.  Placement of all containers for the accumulation of municipal solid\nwaste shall be on private property except that such containers may be placed on public property fronting the residences or\nplace of business where such municipal solid waste is generated or accumulated for convenience on such day that the\nmunicipal solid waste is collected for disposal.  Such placement shall not create an obstruction to the proper passage of\nvehicles or pedestrians. Once such municipal solid waste is collected, such container(s) shall be promptly replaced on\nprivate property.\n(2)  Municipal solid waste accumulated for collection and disposal by a duly licensed contractor or\nmunicipal solid waste collection operator shall be so collected and disposed of no less frequently than once per week.\nSection 11-9.  Scattering of municipal solid waste.\nNo person shall cast, place, sweep, or deposit anywhere within the City any municipal solid waste in any manner, that may\nresult in such municipal solid waste being carried or deposited by the elements upon any street, sidewalk, alley, sewer,\nparkway or other public place or place any solid waste in any trash receptacle either owned by another or provided for use\nand benefit of another by a private hauler of solid waste.\nSection 11-10. Accumulation and use of manure.\nIt shall be unlawful for any owner, occupant or agent of property to keep any manure for any purpose other than to spread\nit lightly on lawns or gardens for fertilizing purposes.\nSection 11-11. Burning of municipal solid waste.\nIt shall be unlawful for any person to set fire to or burn any garbage, rubbish or waste material or any hay, grass clippings\nor any other combustible materials, including waste paper, in any receptacle or upon the ground.\nSection 11-12. City Landfill fees. (Repealed and re-enacted, Ord. 3002, eff. 8-14-20)\n(1)  Fees assessed for the disposal of garbage, trash, and tire carcasses, and all other types of acceptable refuse at the\nTrinidad Landfill shall be at the following rates for each delivery:\n(a) General Customers\n(I) Municipal Solid Waste, $27.00 per ton with a minimum of $10.00\n(II) Construction waste, $31.00 per ton\n(III) Yard waste, $31.00 per ton with a minimum of $10.00\n(IV) Five dollars ($5.00) per container of waste material not to exceed thirty-five (35) gallons in volume\n(b) Licensed Commercial haulers\n(I) Typical Municipal Solid Waste, $22.00 per ton\n(II) Construction waste, $25.00 per ton\n(c) Special waste shall not be subject to the rate set forth in subsection (a) or (b), but instead shall be subject to the\nfollowing rates:\n(I) Special wastes such as contaminated soil,\nsand trap waste, non-friable asbestos, and other\nsimilar wastes which require additional\nhandling by landfill personnel\nDisposal fee\n$35.00 per ton minimum fee, special\nnegotiation may be required\n(II) Passenger car tires and light truck tires up to\nand including a 16 ½” wheel size\n$4.00 per tire\n(III) Medium duty and heavy duty truck tires\nranging in size larger than a 16 ½” wheel up to\nand including a 22 ½” wheel\n$6.00 per tire\n(IV) All tires sizes larger than a 22 ½” wheel up\nto and including heavy equipment tires\n$20.00 per tire\n(V) Upholstered furniture (sofas, loveseats\nchairs, couches, ottomans, mattresses and box\nsprings)\n$5.00 each\n(2) All fees in this ordinance are hereby effective on and after September 1, 2020.\n(3) Such fees shall be in effect and charged at drop off for individual customers to a credit or debit card. However\ncustomers of City utilities who present a current bill will be allowed to charge the amount due to their utility bill. No\nindividual will be allowed to charge amount due to someone else’s utility account unless prior arrangements have been\nmade. Customers may also pre-pay at the City Utility Billing Office on the first floor of City Hall at 135 N. Animas Street.\n(4) All garbage, rubbish, or other municipal waste material under the control of the City at the City landfill, shall be the\nproperty of the City, and it shall be unlawful for any person to enter upon such sites, or carry off, dispose of, burn or in any\nmanner disturb or molest any matter or item deposited or existing upon such sites, except under the direction or authority\nof the Public Works Director or his/her designee.\n(5) All vehicles hauling municipal waste for disposal at the landfill shall be enclosed or tarped. Any person who does not\ncomply with this requirement shall be assessed a double charge for disposal of his/her load. \nSection 11-13.      Penalty for violation.\nAny person convicted of violating any provisions of this Article shall be punished by a fine not to exceed Three Hundred\nDollars ($300.00) or by imprisonment not to exceed ninety (90) days.  (Ord. 1441, 11/17/92.)\n"
}