{
    "chapter": "Chapter 1 - General Provisions",
    "content": "Chapter 1 - General Provisions\nARTICLE 1. IN GENERAL.    \nSection:     \n1-1  Designation and citation of Code.     \n1-2  Definitions.     \n1-3   Rules of construction.     \n1-4  Chapters, Articles, Divisions, Sections, and Subsections; headings and catch lines.     \n1-5  Reference to Sections.     \n1-6  Prospective effect of Code; repealed ordinances not revived.     \n1-7  Territorial applicability.     \n1-8  General penalty; subsequent violation; suspension or revocation of license. \n1-9  Continuing offense.     \n1-10  Same offense punishable by different Sections of Code; City Attorney's option.     \n1-11  Judgments and sentences to run consecutively.     \n1-12  Severability of parts of Code.     \n1-13  Location of Code.     \n1-14  Certified copy of Code admissible into evidence.     \n1-15  Certified copies of documents.     \n1-16  Fees for inspection, copying and photographing of public records.     \n1-17  Altering Code prohibited.     \n1-18  Franchises and special privileges; deposit for costs.     \n1-19  Franchises and special privileges; violations; termination.     \n1-20  City seal.     \n1-20-1 Description.  \n  \nARTICLE 2. INSPECTIONS.  \n1-21  Inspections; when entry authorized.     \n1-22  Types of inspections authorized.    \n \nARTICLE 3. SERVICE OF PROCESS.     \n1-23  Personal service.     \n1-24  Manner of proof of service.     \n1-25  Refusal to accept.     \n1-26  Service upon attorney representing party to whom notice is addressed.      \n \nARTICLE 4. ADOPTION OF CODES BY REFERENCE.\n1-27  Definitions.     \n1-28  Adoption of codes by reference; title.     \n1-29  Procedure for adoption.     \n1-30  Adopting ordinance; adoption of penalty clauses by reference prohibited.    \n1-31  Publication of ordinance.     \n1-32  Filing of public record; sale of copies.     \n1-33  Amendments.     \n1-34  Use as evidence.  \n           \nARTICLE 5. MUNICIPAL LIENS. \n1-35  Creation of Municipal Liens.     \n1-36   Discharge of Municipal Liens.    \n \nCHAPTER 1. GENERAL PROVISIONS.  \n\nARTICLE 1. IN GENERAL.      \n      \nSection 1-1  Designation and citation of Code.  \nThe ordinances of the City of Trinidad, Colorado, embraced in this and the following Chapters shall constitute and be\ndesignated, \"The Code of the City of Trinidad, Colorado,\" and may be so cited. The Code may also be cited as the \"Trinidad\nCity Code\" or, in the provisions which follow, as \"this Code\". (Ord. 1958, Sec. 1-1.)           \nSection 1-2 Definitions. (Ord. 3047, Sec 1-2 amended, eff. 8/26/22)      \n(1)  Alley shall mean a street or highway intended to provide access to the rear or side of lots or buildings in urban areas\nand not intended for the purpose of through vehicular traffic.  \n        \n(2)  Building Inspector(s) shall mean such officers, inspectors, deputies and assistants in the Inspection Division of the\nDepartment of Public Works who may be authorized to enforce specific provisions of this Code.      \n    \n(3)  Charter shall mean the Charter of the City of Trinidad.    \n      \n(4)  City, or this City shall be construed as if \"of Trinidad\" followed them and shall extend to and include the several\nofficers, agents and employees of the City of Trinidad.  \n \n(5)  City Council, Council shall mean the City Council of the City of Trinidad.  \n \n(6)  City Engineer shall mean the Director of Public Works of the City of Trinidad, Colorado.    \n(7)  City Manager or Manager shall mean the City Manager of the City of Trinidad.  \n \n(8)  City Clerk; City Clerk-Treasurer, City Treasurer shall mean the City Clerk-Treasurer of Trinidad.    \n(9)  Code shall mean this Code.  \n \n(10)  County shall mean the County of Las Animas.   \n(11)  C.R.S., appearing in this Code, refer to and designates the Colorado Revised Statutes.  \n        \n(12)  District Court shall mean the District Court sitting in and for the County of Las Animas.\n   \n(13)  Month shall mean a calendar month.    \n      \n(14)  Oath shall include an affirmation in all cases in which, by law, an affirmation may be    \nsubstituted for an oath, and in such cases the words swear and sworn shall be equivalent to the words affirm and affirmed.\n   \n(15)  Owner, applied to a building or land, shall include any part owner, tenant in common, tenant in partnership, joint\ntenant, or tenant by the entirety, of the whole or of a part of such building or land.    \n(16)  Person shall extend and be applied to organizations, associations, clubs, societies, firms, partnerships, copartnerships\nand bodies politic and corporate as well as to individuals, any combination of individuals acting as a unit.    \n(17)  Personal property shall include every species of property except real property.    \n    \n(18)  Preceding; following shall mean next before and next after, respectively.  \n(19)  Property shall include personal, real and fixed property.    \n      \n(20)  Public place shall mean a place to which the public or a substantial number of the public has access, and includes but\nis not limited to highways, transportation facilities, schools, places of amusement, parks, playgrounds and the common\nareas of public and private buildings and facilities.    \n(21)  Real property shall mean land, including land under water, buildings, structures, fixtures and improvements on land;\nany property appurtenant to or used in connection with land; and every estate, interest, privilege, leasehold, easement,\nlicense, franchise, right-of-way, and other right in land, legal or equitable, including, without limiting the generality of the\nforegoing, rights-of-way, terms for years, and liens, charges, or encumbrances by way of judgment, mortgage or otherwise,\nand the indebtedness secured by such liens.    \n   \n(22)  Roadway shall mean those portions of a street or highway improved, designed or ordinarily used for vehicular travel.\n   \n(23)  Sidewalk or sidewalk area shall mean that portion of a street between the curb lines, or the lateral lines of a roadway\nand the adjacent property lines, intended for the use of pedestrians.  \n \n(24)  State or this State shall mean the State of Colorado.       \n(25)  Street shall mean the entire width between the boundary lines of every way publicly maintained when any part\nthereof is open to the use of the public for purposes of vehicular travel.\n  \n(26)  Tenant; occupant, applied to a building or land, shall include any person holding a written or oral lease of or who\noccupies the whole or a part of such building or land, either alone or with others.\n   \n(27)  Year shall mean a calendar year.  \n \n(28) Long-Term Rental shall mean the rental of any residential property by a person to any natural person who resides in\nLas Animas County as that person's primary residence for a term of not less than six (6) months. Where such property is\nvacant for a period of three (3) months or more during such six-month period, such property shall not constitute a long-\nterm rental under this definition. In order to meet the definition of a long-term rental, such property must be actively\noffered for rent, as supported by reasonable evidence of such rental.\n(29) Primary Residence shall mean a residence which is the usual place of return for housing as documented in the vested\ntitle of the property or through a long-term lease. The owner or occupant of said residence shall provide at least two of the\nfollowing: motor vehicle registration, driver’s license, Colorado state identification card, voter registration, or tax\ndocuments to establish their primary residence status. A person can have only one primary residence.\nSection 1-3. Rules of construction.  \nIn the construction of this Code and of all ordinances, the following rules shall be observed, unless inconsistent with the\nCity Council or the context clearly indicates otherwise:\n   \n(1) Common and technical usage. Words and phrases shall be read in context and construed according to the rules of\ngrammar and common usage. Words and phrases that have acquired a technical or particular meaning, whether by\nlegislative definition or otherwise, shall be construed accordingly.    \n(2) Computation of time. Whenever a notice is required to be given or an act to be done a certain length of time before any\nproceedings shall be had, the day on which such notice is given, or such act is done, shall not be counted in computing the\ntime, but the day on which such proceeding is to be had shall be counted. If the last day is a Saturday, Sunday or legal\nholiday, that day shall not be counted in the computation.    \n(3) Conflicting provisions. If a general provision of the Code conflicts with a more specific provision of the Code and such\nconflict is irreconcilable, the more specific provision shall prevail as an exception to the general provision, unless the\ngeneral provision is the later adoption and the manifest intent is that the general provision prevail. If it cannot be\ndetermined which conflicting provision is more specific, the provision most recently adopted shall prevail.  \n \n(4) Definitions. The definitions contained in Section 1-2 of this Code shall apply to those terms whenever they are used in\nthe Code unless otherwise expressly provided. Definitions provided within a given chapter, shall be applicable only within\nsuch chapter, unless otherwise expressly provided.  \n      \n(5) Gender. Words importing the masculine gender shall include the feminine and neuter as well as masculine.    \n      \n(6) Heretofore and hereafter. Whenever the word heretofore appears in any Section, it shall be construed to mean any time\nprevious to the day when that Section shall take effect; whenever the work hereafter appears, it shall be construed to mean\nthe time after the Section takes effect.  \n        \n(7) Number. Words importing a singular shall include the plural and the plural shall include the singular.    \n(8) Or; and. “Or” may be read “and” and “and” may be read “or” if the sense requires it.  \n \n(9) Shall; must; may. The words “shall” and “must” are mandatory and the word “may” is permissive.         \n(10) Tense. Words used in the present or past tense shall include the future as well as the present or past.    \n(11) Writing; written. The words “writing” and “written” shall include printing and any other mode of representing words,\nletters and figures.    \nSection 1-4. Chapters, Articles, Divisions, Sections and Subsections; headings and catch lines.   \nAll headings of Chapters, Articles or Divisions and all catch lines of Sections and Subsections are unofficial and intended\nonly for convenience in arrangement and as mere catchwords to indicate the contents of the Chapters, Articles, Divisions,\nSections and Subsections. They shall not be deemed to be part of the contents of the Chapters, Articles, Divisions, Sections\nor Subsections; nor shall the headings and catch lines alter the otherwise intended meaning of any provision of this Code.  \n \nSection 1-5. Reference to Sections.  \n      \nWherever in this Code or the ordinances of this City a reference is made to several Sections and the Section numbers given\nin the reference are connected by the word \"to\", the reference includes both Sections whose numbers are given and all\nintervening Sections.  \n \nSection 1-6. Prospective effect of Code; repealed ordinances not revived.\n      \nThis Code shall not affect any act done, any right accrued, any penalty incurred, any suit, prosecution or proceeding\npending, or the tenure of office of any person holding office, at the time when it takes effect, nor shall the repeal of any\nordinance have the effect of reviving an ordinance theretofore repealed or superseded, or the effect of preventing any\npunishment or penalty incurred before the repeal took effect, or of interfering with any suit, prosecution or proceeding\npending at the time of repeal, for an offense committed under the ordinance repealed.    \nSection 1-7. Territorial applicability.\n      \nThis Code shall refer only to the omission or commission of acts within the territorial limits of the City and to that territory\noutside this City over which the City has jurisdiction or control by virtue of any Constitutional provision or any law.    \nSection 1-8. General penalty; subsequent violation; suspension or revocation of license. (Ord. 2062,\nrepealed and re-enacted, eff. 7-13-18)\n(1) Whenever, in this Code or in any ordinance of the City, or rule, regulation or order promulgated by any law officer or\nagency of the City under authority duly vested in him/her or it, any act or failure to do a required act is prohibited or is\nmade or declared to be unlawful or an offense or a misdemeanor, and no specific penalty is provided therefore, the\nviolation of any such provision of this Code or any ordinance or any rule, regulation or order as aforesaid shall be punished\nby a fine of not less than Three Hundred Dollars ($300.00) nor to exceed Two Thousand Six Hundred Fifty Dollars\n($2,650.00) or by imprisonment in the City Jail or other place of legal incarceration for not more than ninety (90) days, or\nby both such fine and imprisonment in the discretion of the court.\n(2) If the penalty for a particular offense is limited by State statute, then such limitation shall be applicable\nnotwithstanding the provisions of this section.\n(3) The suspension or revocation of any license, certificate or other privilege conferred by the City shall not be regarded as\na penalty for the purposes of this Code but shall be in addition thereto.\nSection 1-9. Continuing offense.   \nUnless otherwise specifically provided, each day any violation of this Code occurs or continues to exist shall constitute a\nseparate and distinct offense.    \nSection 1-10. Same offense punishable by different Sections of Code; City Attorney’s option.       \nIn all cases where the same offense is made punishable or is created by different Sections of this Code, the City Attorney\nmay elect under which to proceed, but not more than one (1) action shall be taken against the same person for the same\noffense.    \nSection 1-11. Judgments and sentences to run consecutively.   \nAll judgments and sentences imposed and ordered by the Municipal Court of the City shall run consecutively unless\notherwise specifically provided by the Judge of such Court. (Ord. 1958, Sec. 1-10.)    \nSection 1-12. Severability of parts of Code.  \n \nThe Sections, paragraphs, sentences, clauses, and phrases of this Code are severable, and if any phrase, clause, sentence,\nparagraph or Section of this Code shall be declared unconstitutional by the valid judgment or decree of a court of\ncompetent jurisdiction, such unconstitutionality shall not affect any of the remaining phrases, clauses, sentences,\nparagraphs and Sections of this Code.    \nSection 1-13. Location of Code.  \n \nThis Code shall be kept on file in the office of the City Clerk, preserved in loose leaf form, or in such other form as the City\nClerk may consider most expedient. It shall be the express duty of the City Clerk, or someone authorized by him/her to\ninsert in their designated places all amendments or ordinances which indicate the intention of the City Council to make the\nsame a part of this Code when the same has been printed or reprinted in page form, and to extract from the Code all\nprovisions which may from time to time be repealed by the City Council. A copy of the Code shall be available for all\npersons desiring to examine it.    \nSection 1-14. Certified copy of Code admissible into evidence.   \nAny copy of the Trinidad City Code or any copy of any addition, amendment or supplement thereto adopted, published\nand certified according to law shall be received in evidence in any court for the purpose of proving the ordinances therein\ncontained with like force and effect and for the same purpose as the original ordinances would be received.    \nSection 1-15. Certified copies of documents.   \nThe City Clerk is authorized to prepare copies of official records and documents of the City and certify the same as being\ntrue and correct copies of the original from which they were copied, and to furnish the same to the person applying\ntherefor upon presentation of receipt of payment by the Director of Finance showing cost of such service has been paid.    \nSection 1-16. Fees for inspection, copying and photographing of public records.\nIn addition to the twenty-five cents ($.25) per page fee provided for in Title 24, C.R.S., 24-72-205(1), the City Clerk shall\ncharge and collect in advance:\n(1) The sum of Three Dollars and fifty cents ($3.50) for furnishing a certified copy of any document, instrument or paper\non file, in addition to twenty-five cents ($.25) per page, for each document, instrument or paper furnished.\n(2) The sum of Thirty Dollars ($30.00) per hour when it shall be necessary to search for and retrieve any public records in\nresponse to any person’s request for such public records. There shall be no charge for the first hour of time for research\nand retrieval of records. The City may require and collect an advance deposit based on the estimated research and retrieval\nand per page fee for public records requests that will require significant staff time and resources to complete.\n(3) The sum of Twenty Dollars ($20.00) for the reproduction of audio recordings.\n(4) The sum of Fifteen Dollars ($15.00) will be assessed per portable storage device when used to produce documents that\nare voluminous, at the discretion of the records custodian.\n(5) Fees to cover the actual cost of shipping/transmitting records may be imposed. However, no transmission fee may be\ncollected for sending digital records via email, though all other fees will be required to be paid in advance. (Ord. 3019,\namended, eff. 5-14-21)\nSection 1-17. Altering Code prohibited.\n  \nIt shall be unlawful for any person to change or amend by additions or deletions, any part or portion of this Code, or to\ninsert or delete pages, or portions thereof, or to alter or tamper with this Code in any manner whatsoever which will cause\nthe law of the City to be misrepresented thereby.    \nSection 1-18. Franchises and special privileges; deposit for costs.\n  \nAny person requesting any special privileges, grants or franchises from the City, is required to deposit with the City Clerk\nsuch sum of money as the Council may deem sufficient to defray all expenses incident to the procuring of such franchises\nor special privileges; provided, if any money remains after payment of all expenses, it shall be refunded to the party paying\nit to the Clerk.    \nSection 1-19. Franchises and special privileges; violations; termination.  \n \nAny violations of the duties and obligations imposed and prescribed to be done and performed by grantees of any franchise\nor grant of special privilege, or of the conditions of such franchise or grant or of relevant provisions of this Code, shall\nterminate and end all rights granted such franchise or grant.\n   \nSection 1-2 0 . City seal.  \n \nThe City of Trinidad Municipal Seal shall be:\nImage of City of Trinidad Municipal Seal\nSection 1-20-1.   Description.  \nThe City of Trinidad Municipal Seal shall be on a navy blue circle with bronze detail. The primary focal point shall be a\nwhite “T” in the middle of the shield in representation of the first letter in Trinidad’s name. Above the shield shall be the\nword Trinidad in white. The shield top shall have the distinct modern variation of the upper most bluff of Fisher’s Peak\nand a small bronze circle, representing the rising sun over the signature natural landmark near the City of Trinidad; this\nrepresents the new era of prosperity that Trinidad is embarking on. Outward from the shield and T, are the detailed lines\nindicating the Greek Ionic inspiration for the Victorian architecture of our downtown. Below the shield is the word\nColorado in white. (Ord. 2047, Repealed and re-enacted, eff. 12-01-17)\n      \nARTICLE 2. INSPECTIONS.   \nSection 1-21. Inspections; when entry authorized.   \n               The proper City inspection authority or its authorized agent shall have the right to make an inspection of any\npremises in the City in order to determine the existence of violations of any provisions of this Code pertaining to the\nhealth, welfare and safety of the public. Such inspector shall have the right to enter any premises in the City for such\ninspection purposes, without a warrant, if any of the following circumstances exist:    \n(1) Entry with permission. Entry is by permission or at the request of the owner or occupant of the premises; or    \n(2) Imminent danger. Where an imminent danger to health, welfare of safety exists; or    \n   \n(3) Danger from accident. Following an accident where an immediate inspection is required to determine if an imminent\ndanger to health, safety or welfare exists; or  \n \n(4) Any other emergency inspection, or in any other case where warrants are not presently required by law.    \nSection 1-22. Types of inspections authorized.   \nThe following types of inspections may be conducted by the proper City inspection authority or its authorized agent:    \n(1) Routine inspection. The inspection of the designated premises is part of a routine area inspection being conducted.    \n(2) Spot check. The inspection of the designated premises is part of a spot check being conducted within a designated area.\n \n \n(3) Knowledge of violation. The inspector has knowledge of a violation or knowledge of facts which would indicate a\nviolation of any provision of this Code pertaining to health, safety or welfare of the public.    \n(4) Inspection after alteration, remodeling or improvements. The inspection is for the purpose of inspecting, during the\ncourse, or upon completion of alteration, remodeling or improvements in the premises.    \n(5) Checking conditions after accident. The inspection is for the purpose of checking the conditions existing in the\npremises following an accident or casualty therein where an inspection is required to determine if an imminent danger to\nhealth and safety exists.    \n \n(6) Licensing of buildings and structures. The inspection is for the purpose of checking the conditions existing in any\nbuilding or structure requiring a license before occupancy upon application for or renewal of such license.    \nARTICLE 3. SERVICE OF PROCESS.    \nSection 1-23. Personal service.   \nWherever in this Code, service of any notice shall or may be by personal service, such personal service shall be as follows:  \n \n(l) Upon a natural person over the age of eighteen (18) years by delivering a copy thereof to him/her, or by leaving a copy\nat his/her usual place of abode, with some member of his/her family over the age of eighteen (18) years, or by leaving a\ncopy in a conspicuous place at his/her usual place of business, or by delivering a copy to an agent authorized by\nappointment or by law to receive service of process.  \n \n(2) Upon a natural person under the age of eighteen (18) years by delivering a copy thereof to him/her and a copy thereof\nto his/her father, mother or guardian, or if there be none in the City, then by delivering a copy thereof to any person in\nwhose care or control he/she may be, or with whom he/she resides, or in whose service he/she is employed.\n   \n(3) Upon a person from whom a conservator or representative has been appointed, by delivering a copy thereof to such\nconservator or representative.  \n \n(4) Upon a partnership, or other unincorporated association, by delivering a copy thereof to one (1) or more of the partners\nor associates, or a managing or general agent thereof.    \n(5) Upon a private corporation, by delivering a copy thereof to any officer, manager, general agent, or agent for process. If\nno such officer or agent can be found in the City, such copy may be delivered to any stockholder, agent, member or\nprincipal employee found in the City. If such service be upon a person other than an executive officer, the secretary,\ngeneral agent, or agent for process, then the City Clerk shall mail a copy thereof to the corporation at its last known\naddress at least fifteen (15) days before the time stated in the notice on which or within which the corporation to whom it\nis directed shall do or accomplish that which it is the purpose of the notice to command it to do.\n   \n(6) Upon a public corporation or other public agency subject to notice, by delivering a copy thereof to the principal officer,\nchief clerk or other executive employee thereof.    \nSection 1-24. Manner of proof of service.   \n(1) If served by a police officer or City employee, by his/her certificate with a statement as to date, place and manner of\nservice.  \n \n(2) If by any person, by his/her affidavit thereof, with a statement as to date, place and manner of service.    \n(3) If by mail, by the certificate of the City Clerk showing the date of the mailing; and the return receipt, showing the date\nof receiving the notice.  \n \n(4) If by publication, by the affidavit of publication, together with the certificate of the City Clerk as to the mailing of the\nnotice where mailing is required.  \n \n(5) By the written admission or waiver of service by the person to be served, duly signed and acknowledged.\nAcknowledgment of such admission or waiver of service may be taken before a Notary Public.  \n \nSection 1-25. Refusal to accept.  \n \nIf the person to be served refuses to accept a copy of the notice, service shall be sufficient if the person serving it shall state\nthe general nature of the notice and offer to deliver a copy thereof.  \n \nSection 1-26. Service upon attorney representing party to whom notice is addressed.\n     \n      Whenever under any ordinance, order, resolution or directive service of a notice is required or permitted to be made\nupon a party represented by an attorney, the service shall be made upon the attorney unless service upon the party\nhimself/herself is directed by the ordinance, order, resolution or directive or is ordered by the City Council. Service upon\nthe attorney may be made by delivering a copy to him/her personally or by mailing it to him/her at his/her address as\ngiven to the City Clerk or the department charged with giving such notice. Delivery of a copy within this Subsection means\nhanding it to the attorney; or leaving it at his/her office with his/her clerk or other person in charge thereof; or, if there is\nno one in charge, leaving it in a conspicuous place therein; or, if the office is closed or the attorney to be served has no\noffice, leaving it at his/her dwelling, house or usual place of abode with some member of the family over the age of\neighteen (18) years residing therein. Service by mail is complete upon mailing.    \nARTICLE 4. ADOPTION OF CODES BY REFERENCE.  \n \nSection 1-27. Definitions.   \nAs used herein:  \n \n(1)  Primary code  shall mean any code which is directly adopted by reference in whole or in part by any ordinance passed\npursuant to this Article. \n \n(2)  Published  shall mean issued in printed, lithographed, multi graphed, mimeographed or similar form.    \n(3)  Secondary code  shall mean any code which is incorporated by reference, directly or indirectly, in whole or in part, in\nany primary code or in any secondary code.    \nSection 1-28. Adoption of codes by reference; title.\n  \nIf all the procedures and requirements of this Article are complied with, the City is authorized to enact any ordinance\nwhich adopts any code by reference, in whole or in part; and such primary code, thus adopted, may in turn adopt by\nreference, in whole or in part, any secondary codes duly described therein. However, every primary code which is\nincorporated in any such adopting ordinance, shall be specified in the title of the ordinance.    \nSection 1-29. Procedure for adoption.\n  \nThe procedure for adoption of all ordinances adopting codes by reference shall be in accordance with the requirements of\nSection 5.6 of the Charter. In addition to the notice and publication requirements of Section 5.6 (d) of the Charter, the\npublished notice shall also state that copies of the primary code and copies of the secondary code, if any, being considered\nfor adoption, are on file with the City Clerk and are open to public inspection.    \nSection 1-30. Adopting ordinance; adoption of penalty clauses by reference prohibited.   \nAfter the hearing, the Council may amend, adopt or reject the adopting ordinance in the same manner in which it is\nempowered to act in the case of other ordinances; provided, nothing in this Article shall be deemed to permit the adoption\nby reference of any penalty clauses which may appear in any code which is adopted by reference. Any such penalty clauses\nmay be enacted only if set forth in full, and published, in the adopting ordinance. It is further provided that all changes or\nadditions to any code made by the Council shall be published in the manner which is required for ordinance.    \nSection 1-31. Publication of ordinance.  \n  \nNothing contained in this Article shall be deemed to relieve the City from the requirement of publishing in full the\nordinance which adopts any such code, and all provisions applicable to such publication shall be fully carried out. The\nadopting ordinance shall contain the name of the code, the year of the publication and the name and address of the\npublisher, and where copies of the code are kept.    \nSection 1-32. Filing of public record; sale of copies.   \nAt least one copy of each primary code adopted by reference, of each secondary code pertaining thereto, shall be filed in\nthe office of the City Clerk at least seven (7) days prior to the hearing on the adopting ordinance, and shall be kept there for\npublic inspection while the ordinance is in force. \n \nSection 1-33. Amendments.  \n \nIf at any time any code, which the City has previously adopted by reference, shall be amended by the agency or\nmunicipality which originally promulgated, adopted or enacted it, then the Council may adopt such amendment by\nreference through the same procedure as required for the adoption of the original code; or an ordinance may be enacted in\nregular manner, setting forth the entire text of such amendment.    \nSection 1-34. Use as evidence.  \n \nCopies of such codes in published form, duly certified by the Clerk and Mayor shall be received without further proof as\nprima facie evidence of the provisions of such codes or public records in all courts and administrative tribunals of this\nState.  \n \nARTICLE 5. MUNICIPAL LIENS    \n \nSection 1-35. Creation of Municipal Liens. (  Ord. 1883, Sec. 1-35 enacted, eff. 5/15/09)  \n \n(1) Any amount of money owed to the City for services, taxes, or assessments which concern or benefit the real property of\nthe obligor shall automatically become a lien upon such real property. Such automatic liens will not be available where the\npayment obligation to the City is not directly related to the use, maintenance, improvement, or taxation of, or other service\nto, the real property involved. These liens shall become first and prior liens upon the property in question. These liens\nshall be in the nature of a municipal tax, and, as such, shall be perpetual and continuing liens. The procedure contained in\nthis Article shall be followed in enforcing such municipal liens, except in those instances where a different procedure is\nprescribed by another section of this Code.    \n \n(2) If payments due the City have not been otherwise collected, the Director of Finance may certify the amount due to the\ncounty treasurer. The county treasurer, upon receipt of the statement of the Director of Finance establishing the amount\nowed, shall collect the amount owed, together with a ten percent (10%) penalty thereon to defray the cost of collection, in\nthe same manner as municipal taxes are collected; provided, however, that upon notice to the county treasurer by the City\nthat the City intends to pursue judicial foreclosure of the lien so established, the county treasurer shall refrain from\nattempting to collect the amount due.    \n(3) The procedure contained in this Article is not intended to establish an exclusive method for collection of amounts owed\nto the City, and nothing contained herein shall preclude the City from pursuing other methods of collection, including\njudicial foreclosure of municipal liens.  \n \nSection 1-36. Discharge of Municipal Liens   . (  Ord. 1883, Sec. 1-36 enacted, eff. 5/15/09)   \n      Within thirty (30) days of payment of the full amount owed to the City, the Director of Finance shall notify the county\ntreasurer that the amount due the City has been paid, and that any liens resulting from that debt shall be discharged.\n"
}