{"document": "Gas Tariff 2", "content": " \n \n \nCity of Trinidad, Colorado \nTrinidad Municipal Natural Gas Department \n \n \nGas Tariff Volume 2 \n \n \n \n \n \n \n \n \nCommunications regarding this Tariff should be addressed to: \n \n \nCity Manager \nCity of Trinidad, Colorado \n135 N. Animas Street \nP. O. Box 880 \nTrinidad, CO  81082 \n(719) 846-9843 \n \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n1 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nTABLE OF CONTENTS \nI. \nIntroduction ............................................................................................................2 \nII. \nGas Service Classifications ....................................................................................3 \n1.0 Rate Schedule for Residential Sales (“RS”) Service ..................................3 \n2.0 Rate Schedule for Commercial Sales (“CS”) Service ................................4 \n3.0 Rate Schedule for Special Contract (“SC”) Service ..................................5 \nIII. Rates and Service Charges ....................................................................................6 \nIV. Rules and Regulations ...........................................................................................8 \n1.0 Definitions ......................................................................................................8 \n2.0 Meters, Meter Reading, and Billing ..........................................................10 \n3.0 Continuity of Service ..................................................................................11 \n4.0 Requested Alterations to City’s Facilities .................................................12 \n5.0 Customer Use and Facilities .......................................................................13 \n6.0 Definition of a Cubic Foot of Gas ..............................................................16 \n7.0 Meter Testing ..............................................................................................16 \n8.0 Gas Supply Charge .....................................................................................17 \n9.0 Extension Policy ..........................................................................................18 \n10.0 Meter Locations .........................................................................................24 \n11.0 Pipe Material, Pipe Sizes, and Installation of Piping ................................24 \n12.0 Penalty for Violation .................................................................................24 \n13.0 Non-liability of City ...................................................................................24 \n \n \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n2 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nI. INTRODUCTION \n \nThis Tariff governs the provision of natural gas service by the Trinidad Municipal \nNatural Gas Department.  Pursuant to the rates and regulations set forth herein, the \nTrinidad Municipal Gas Department shall provide natural gas service to all customers in \na manner consistent with standards precluding undue discrimination.  A copy of this Tariff \nshall remain on file and available for public inspection at the Office of the City Clerk for \nthe City of Trinidad, Colorado. \nFollowing this Introduction, this Tariff is presented in the following sections: \nII.   Gas Service Classifications.  This section sets forth the customer \nclassifications under which the Trinidad Natural Municipal Natural Gas \nDepartment sells and delivers natural gas to its customers.   \nIII.   Rates and Service Charges.  This section sets forth the Schedule of Rates and \nthe Schedule of Service Charges that apply to customers of the Trinidad \nMunicipal Natural Gas Department. \nIV.   Rules and Regulations.  This section sets forth the conditions, rules, and \nregulations applicable to the Trinidad Municipal Natural Gas Department’s \nprovision of natural gas service. \nThis Gas Tariff Volume 2 shall replace and supersede Gas Tariff Volume 1 effective \non the 1st day of March, 2024, pursuant to Ordinance No. _____ of the City Council for \nthe City of Trinidad, Colorado.   \nThis Tariff may be revised, amended, supplemented, or otherwise changed from time \nto time by ordinance of the City Council for the City of Trinidad, Colorado.  Such changes, \nwhen effective, shall have the same force and effect as the present Tariff. \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n3 \n \n \nSuperseding \nGas Tariff No. 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nII. GAS SERVICE CLASSIFICATIONS \n1.0 Rate Schedule for Residential Sales (“RS”) Service \n1.1 Availability \nAvailable within the entire territory served by the Trinidad Municipal Natural \nGas Department. \n1.2 Applicability \nApplicable to residential sales service where service is for domestic purposes \nonly, in single-family units, duplexes, individually metered multi-family units, \nand multi-family units comprised of no more than three (3) units with a single \nmeter. Residences used for commercial purposes shall be billed at the \nCommercial Sales service rate, unless the residential and commercial services \nare arranged to allow separate metering of the residential and commercial \nportions.  \n1.3 Rates at Billing Pressure Base \nThe charge for service for each month shall be the sum of the following \ncomponents: \nMetering & Billing Charge.  The Metering & Billing Charge shall be the \nMetering & Billing Rate as contained on the Rates and Service Charges on \nSheet No. 6 for each month in which the customer receives service. \nDelivery Charge.  The Delivery Charge shall be obtained by multiplying the \nDelivery Rate as contained on the Rates and Service Charges on Sheet No. 6 \ntimes the CCF of gas used by the customer during the month. \nGas Supply Charge.  The Gas Supply Charge shall be obtained by multiplying \nthe Gas Supply Rate as contained on the Rates and Service Charges on Sheet \nNo. 6 times the CCF of gas used by the customer during the month.  The Gas \nSupply Charge shall be subject to adjustment from time to time as set forth in \nthe Gas Supply Charge Tariff provisions in Section I.1.0 on Sheet No. 17. \n1.4 Taxes \nAll rates are net and subject to all applicable taxes. \n1.5 Rules and Regulations \nAll service under this Rate Schedule shall be subject to the Rules and \nRegulations contained in this Tariff.  \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n4 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nII. GAS SERVICE CLASSIFICATIONS (cont’d) \n2.0 Rate Schedule for Commercial Sales (“CS”) Service \n2.1 Availability \nAvailable within the entire territory served by the Trinidad Municipal Natural \nGas Department. \n2.2 Applicability \nApplicable to commercial sales service where service is taken through one \nmeter for commercial purposes to non-residential customers.  Multi-metering \nof the same service is prohibited unless special conditions exist and approval is \ngranted by the Superintendent, which approval may be conditioned. \n2.3 Rates at Billing Pressure Base \nThe charge for service for each month shall be the sum of the following \ncomponents: \nMetering & Billing Charge.  The Metering & Billing Charge shall be the \nMetering & Billing Rate as contained on the Rates and Service Charges on \nSheet No. 6 for each month in which the customer receives service. \nDelivery Charge.  The Delivery Charge shall be obtained by multiplying the \nDelivery Rate as contained on the Rates and Service Charges on Sheet No. 6 \ntimes the CCF of gas used by the customer during the month. \nGas Supply Charge.  The Gas Supply Charge shall be obtained by multiplying \nthe Gas Supply Rate as contained on the Rates and Service Charges on Sheet \nNo. 6 times the CCF of gas used by the customer during the month.  The Gas \nSupply Charge shall be subject to adjustment from time to time as set forth in \nthe Gas Supply Charge Tariff provisions in Section I.1.0 on Sheet No. 17. \n2.4 Taxes \nAll rates are net and subject to all applicable taxes. \n2.5 Rules and Regulations \nAll service under this Rate Schedule shall be subject to the Rules and \nRegulations contained in this Tariff. \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n5 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nII. GAS SERVICE CLASSIFICATIONS (cont’d) \n3.0 Rate Schedule for Special Contract (“SC”) Service \n3.1 Availability \nApplicable within the entire territory served by the Trinidad Municipal Natural \nGas Department, subject to approval by the City Council. \n3.2 Applicability \nApplicable to all consumers designated by the Trinidad Municipal Natural Gas \nDepartment as not suited to other consumer rate classes when a special contract \ndefining the terms and rates for service has been executed by the City and the \ncustomer. \n3.3 Rate \nThe charges for service for each month shall be as contained in the Special \nContract Service agreement. \n3.4 Taxes \nAll rates are net and subject to all applicable taxes. \n3.5 Rules and Regulations \nAll service under this Rate Schedule shall be subject to the Rules and \nRegulations contained in this Tariff. \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n6 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nIII. RATES AND SERVICE CHARGES \n \nSchedule of Rates \nRate \nSchedule \nSheet \nNo. \nType of Charge \nBilling Units \nRate/Charge \nEFFECTIVE \nMARCH 1, 2024 \n \nRate/Charge \nEFFECTIVE \nNOVEMBER 1, \n2024 \nRS \n3 \nMetering & Billing Charge \nPer Customer \n$11.00 \n$11.00 \n \n \nDelivery Charge \nCCF \n$0.2154 \n$0.2154 \n \n \nGas Supply Charge \nCCF \n See Note (1) \nSee Note (1) \nCS \n4 \nMetering & Billing Charge \nPer Customer \n$22.65 \n$22.65 \n \n \nDelivery Charge \nCCF \n$0.2154 \n$0.2154 \n \n \nGas Supply Charge \nCCF \n See Note (1) \nSee Note (1) \nSC \n5 \nMetering & Billing Charge \nPer Customer \n$22.65 \n$22.65 \n \n \nDelivery Charge \nCCF \n$0.2154 \n$0.2154 \n \n \nGas Supply Charge \nCCF \n See Note (1) \nSee Note (1) \n \nNote 1: The Gas Supply Charge will be as follows: \n For the period March 1, 2024 through October 31, 2024: $0.3333/ccf \n For the period November 1, 2024 through October 31, 2025: $0.4333/ccf \n Effective November 1, 2025 and for periods thereafter, determined in accordance \nwith the provisions of Section I. 1.0 of this Tariff. \n \n \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n7 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nIII. Rates and Service Charges (CONT’D) \n \nSchedule of Service Charges \nType of Service \nAmount \n \nTo transfer service at a specific location from one customer to another \ncustomer where such service is continuous and does not require a \npremise visit. \n \n \n$10.00 \n \nTo institute or reinstitute gas service requiring a premise visit  \n \n \n$25.00 \n \nTo perform non-gratuitous labor for service work in addition to charges \nfor material is as follows: \n \n \n \nTrip Charge \n \n(Assessed when no actual service work, other than a general \ndiagnosis of the customer's problem is performed.) \n \n \n$25.00 \n \nFor service work during normal working hours, per man-hour \n \nMinimum Charge, one hour \n \n$25.00 \n \nAn overtime rate will be applicable to non-gratuitous labor for \nservice work performed before and after normal working hours \nof 8:00 AM to 5:00 PM Monday through Saturday. \n \n \nThe overtime rate shall be, per man hour \n \n \n \nMinimum Charge, one hour \n \n \nWhen such service work is performed on Sundays and \n \nholidays, per man hour \n \n \n \nMinimum Charge, one hour \n \n \n \n \n$45.00 \n \n \n$90.00 \n \nTo process a check from a customer that is returned to the City by the \nbank as not payable \n \n \n$20.00 \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n8 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nIV.  RULES AND REGULATIONS \nThe Trinidad Municipal Natural Gas Department shall supply natural gas service to \nall customers in accordance with the following Rules and Regulations.  These Rules and \nRegulations shall be deemed to be a part of every contract or agreement for service, \nwhether written, oral, or implied, made by the Trinidad Municipal Natural Gas \nDepartment.  No agent or employee of the Trinidad Municipal Natural Gas Department \nhas authority to make any promise, agreement, or representation that is inconsistent with \nthe provisions of this Tariff.   \n1.0 Definitions \n1.1 \n“Applicant” or “Applicants” means an individual or individuals, association, \nfirm, partnership, company, or corporation making application to the City for \ngas service.  \n1.2 \n“Billing Pressure Base” means the pressure base at which the City bills its \ncustomers for natural gas.  Billing Pressure Base is 12.10 p.s.i.a. \n1.3 \n“British Thermal Unit” (BTU) means the amount of energy required to \nincrease the temperature of one (1) pound of water one (1) degree Fahrenheit \nat fifty-nine (59) degrees Fahrenheit. \n1.4 \n“Capacity” means the maximum gas volume that any particular segment of \nthe City’s system is capable of carrying under then current operating \nconditions. \n1.5 \n“CCF” means one hundred (100) cubic feet of gas.  \n1.6 \n“City” means the City of Trinidad, Colorado.   \n1.7 \n“Commercial Establishment” means any establishment engaged in the \noperation of a business, whether for profit or not for profit.  Such enterprises \ninclude, without limitation, clubs, fraternities, sororities, lodges, hotels, \napartment and rooming houses, tourist and cottage camps, trailer camps, \ncampgrounds, schools, municipal buildings, churches, greenhouses, and \ndairies.   \n1.8 \n“Commercial Service” means the furnishing of natural gas for exclusive use \nof the individual customer for cooking, water heating, space heating, heat \napplications, and miscellaneous purposes in a commercial establishment.   \n1.9 \n“Commission” shall mean the Colorado Public Utilities Commission (PUC) \nand any other governmental body or bodies succeeding to, lawfully \nexercising, or superseding any powers of the PUC.  \n1.10 \n“Construction Cost of Distribution Facilities” means the combined costs of \nall facilities necessary to the distribution extension, including satisfactory \nrights-of-way. \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n9 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \n1.11 \n“Curtailment” means the inability of the distribution customer to receive \nnatural gas due to a shortage of natural gas supply.  \n1.12 \n“Customer” means any individually metered end user connected, or \nrequesting to be connected, to the City's gas facilities. \n1.13 \n“Delivery Charge” means the rate designed to reimburse the City for \nexpenses incurred in the delivery of natural gas to its customers, including, \nwithout limitation, a portion of operations and maintenance expenses, \ndepreciation, payroll and associated expenses, capital outlays, in-lieu-of tax \npayments, and transfers to the general fund. \n1.14 \n“Distribution Extension” means any construction of distribution facilities, \nincluding high and low pressure distribution pipes, service lines and laterals, \nand all appurtenant facilities excepting meters and meter installation \nfacilities necessary to supply service to additional customers. \n1.15 \n“Distribution System” means all of the City’s natural gas system and \nfacilities used for the purpose of general distribution of natural gas to its \ncustomers. \n1.16 \n“Extension Completion Date” means the date on which the construction of a \nDistribution Extension or Distribution Reinforcement is completed as shown \nby City records. \n1.17 \n“Gas Supply Charge” means the rate designed to reimburse the City for \nexpenses paid to gas suppliers and pipelines, including, without limitation, \nthe cost of all gas supplies, upstream pipeline transportation expenses, and \nstorage expenses. \n1.18 \n“Interruption” means the City’s inability to provide distribution service to a \ndistribution customer due to constraints on the distribution system.  \n1.19 \n“Local Pressure Base” means the pressure base at which the City delivers \nnatural gas to its customers.  Local Pressure Base is 12.10 p.s.i.a. \n1.20 \n“Meter Location” means the physical location of the meter measuring the \namount of natural gas supplied to the customer.  Meter locations in all \ninstances will be determined by the City and will be located so as to be \naccessible to the City’s meter readers at all times. \n1.21 \n“Metering & Billing Charge” means the rate designed to reimburse the City \nfor expenses that do not vary with the volume of natural gas consumed by \ncustomers, including, without limitation, meter reading expenses, accounting \nexpenses, and a portion of operations and maintenance expenses. \n1.22 \n“MCF” means one thousand (1,000) cubic feet of gas.  \n1.23 \n“MMBTU” means one million (1,000,000) British thermal units. \n \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n10 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \n1.24 \n“Point of Delivery” or “Delivery Point” means the point where the City’s \nfacilities are first connected to the facilities of the customer.  The location of \nthe point of delivery will be determined by the City in accordance with \nstandard practice or as individual circumstances may dictate. \n1.25 \n“Point of Receipt” or “Receipt Point” means the point(s) at which the \nupstream facilities are interconnected with the City’s distribution facilities \nand at which the gas flow is metered.   \n1.26 \n“p.s.i.a.” means pounds per square inch absolute.  \n1.27 \n“Residential Service” means the use of natural gas for cooking, water heating, \nspace heating, clothes drying, and other similar purposes in a home, \napartment, or other dwelling in which a person or people reside.   \n1.28 \n“Residence” means a home, apartment, or other dwelling in which a person \nor people reside.  \n1.29 \n“Service Line” means the pipe line and associated facilities located between \nthe City’s distribution main line and the point of delivery to the customer.  A \nService Line provides service for the customer’s exclusive use. \n2.0 Meters, Meter Reading, and Billing \n2.1 \nMetering of Service \nThe City will install, own, and maintain suitable metering and other \nequipment necessary for measuring the natural gas supplied.  All service to \na customer under one applicable rate will be measured by a single meter \ninstallation, and meter readings of one meter installation shall not be \ncombined with the meter readings of another meter installation for billing \npurposes.   \nWhere service is supplied directly from a high-pressure transmission or \ndistribution main, herein termed “main line”, to a customer or group of \ncustomers, and the City does not own or maintain the piping beyond the main \nline metering point, the customer or group of customers so supplied shall be \nresponsible for and pay the City for all gas as measured on the main line \nmeter. \nStandard delivery pressure of natural gas supplied by the City is four (4) \nounces per square inch above average atmospheric pressure.  Where \nnecessary, the volume of gas as registered on the service meter may be \nadjusted to the foregoing condition for billing purposes. \nCustomer shall consult the City regarding the necessity of changing the \nlocation of gas service before building any addition or structure, and the \ncustomer shall not build over existing natural gas lines.  Customer shall not \nenclose any exposed portion of gas service facilities unless approved by the \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n11 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nCity.  Customer shall notify the City of any leak or defect observed in the \nCity’s facilities. \n2.2 \nMeter Reading and Bill Forms \nExcept as provided in paragraph Section IV.2.1, each service meter shall \nindicate clearly the cubic feet or other units of service for which charge is \nmade to the customer.  In cases where the dial reading of a meter (other than \nan orifice or other chart-type gas meter) must be multiplied by a constant to \nobtain the units consumed, the proper constant to be applied shall be clearly \nmarked on the face or dial of the meter, if practical.   \n2.3 \nBilling \nThe Utility Service and Billing procedures set forth in Chapter 12, Article 1, \nof the Trinidad City Code, which are applicable to all utility services \nprovided by the City of Trinidad, Colorado, are hereby incorporated by this \nreference as if fully set forth herein. \n3.0 Continuity of Service \n3.1 \nCity Responsibility – Non-liability \nThe City will endeavor to furnish and supply, but does not guarantee, \nuninterrupted natural gas service.  The City will not be liable for interruptions \ndue to maintenance functions considered necessary or to causes or \ncontingencies beyond the control of the City, including, but not limited to, \naccidents, breakdown of equipment, acts of God, floods, storms, fires, \nstrikes, riots, vandalism, war, or authority and orders of government, or for \ndisconnection because of unsafe apparatus(es), operation of equipment \ndetrimental to other customers, non-payment of bills for service, or diversion \nof natural gas.  The City shall also not be liable for any injury, loss, or damage \noccasioned by any interruptions arising from the foregoing causes.  Such \ninterruptions shall not relieve the customer of responsibility for payment for \nservice under applicable contract or rate schedules. \n3.2 \nOutage for Alterations \nFor the purposes of making repairs to or changes in the City’s plant, \nequipment, transmission or distribution system, or other property, the City \nmay, without incurring any liability therefore, suspend service for such \nperiod as may be required, but will not inconvenience the customer \nunnecessarily.  The City will attempt to give reasonable notice to the \ncustomer prior to such suspension of service. \n \n \n \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n12 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \n3.3 \nOutage Records \nThe City will keep a record of all interruptions of service upon its entire \nsystem or major divisions thereof, including a statement of the time, duration, \nand cause of any such interruption. \n3.4 \nEmergency Load Interruptions \nIn case of an emergency, the City shall have the right to grant preference to \nthat service which, in its opinion, is most essential to the public safety and \nwelfare.  The priority for emergency load interruptions shall be as follows: \nA. \nPriority 1 \nRequirements of customers using natural gas for residential purposes, \nand service to: \n(1) \nSchools, defined as a facility delivering instruction to regularly \nenrolled students in attendance at such facility; \n(2) \nHospitals, defined as a facility delivering medical care to patients \nwho remain at the facility, including nursing and convalescent \nhomes; and \n(3) \nPolice, fire protection, correctional, and sanitation facilities.  \nB. \nPriority 2 \nRequirements of commercial customers having peak day requirements \nof more than 50 MCF and less than 450 MCF, and commercial \ncustomers having peak day requirements of more than 450 MCF for \nplant protection purposes, provided the gas requirement for plant \nprotection purposes is less than 450 MCF. \nC. \nPriority 3 \nRequirements of commercial customers having peak day requirements \nof more than 450 MCF. \n3.5 \nCurtailment Due to Gas Supply Shortages \nIn case of a shortage of supply, the City shall have the right to limit the \navailability of service under any sales rate schedule.  Such limitations will \nfollow the priority order contained in Section IV. 3.4. \n4.0 Requested Alterations to City’s Facilities \n4.1 \nRequests by Customers \nRequests for alterations to the City’s facilities by the customers will be \nindividually considered by the City and, if found to be desirable or feasible, \nwill be made.  If, in the opinion of the City, such alterations, or portions of \nalterations, are made for the convenience of the customer and do not result \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n13 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nin a substantial improvement to the City’s system or to the service provided, \nthe customer will be required to pay the total cost of the alteration or portion \nof the alteration. \n4.2 \nRequest by Others \nOther requests, such as for road changes, house moving, joint use, etc., shall \nbe made sufficiently in advance to enable the City to properly schedule the \nrequested alteration.  The total cost of such alteration will be guaranteed by \na cash deposit, contract, or some other method agreeable to the City.  An \nexception to this rule will be alterations for road changes where the City’s \nfacilities are located on public right-of-way and the governing body requires \nthat the cost to alter the line will be the City’s cost. \n4.3 \nEasements \nBy making application for natural gas service the applicant agrees to grant or \narrange for an easement on applicant’s property for the installation, \noperation, and maintenance of natural gas lines and other equipment of the \nCity necessary to render service to the applicant.  When requested by the \nCity, the applicant shall, without expense to the City, make or procure \nconveyance to the City of satisfactory right-of-way easements.\n5.0 Customer Use and Facilities \n5.1 \nCustomer Installation\nConcurrently with or prior to requesting gas service, the customer shall \nsubmit to the City, on forms supplied by the City, written data detailing the \nservice requested, to enable the City to determine if the type of service, \nquantity, capacity, and pressure desired by the customer is available; to \ndetermine if extensions of, or additions to, the City’s facilities will be \nrequired; and to secure a definite location of the point of delivery.  Before \nany additions to or alterations of existing installations are made by the \ncustomer which will materially affect the amount of service required, or \nwhich may require a change in the type of service or the point of delivery, \nthe City must be notified reasonably in advance thereof as to the proposed \nadditions or alterations in order that the City may first determine if the service \ndesired is available and if facilities may be arranged for and completed. \nAll gas piping and other natural gas equipment on the customer’s side of the \npoint of delivery will be furnished, installed, and maintained at all times by \nthe customer in conformity with good practice and all applicable regulations, \nand will be inspected and approved by a City inspector, or by the state \nplumbing inspector, before a meter is installed.  However, the City, by such \ninspection or approval, accepts no responsibility or liability for injury or \ndamage caused by defects in the customer’s piping or equipment. \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n14 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nNo equipment or apparatus will be connected to the City’s distribution \nsystem the operation of which may cause such an abnormal pressure \nvariation in said system to impair or endanger the natural gas service supplies \nto other customers of said system or to adversely affect operation of the \nCity’s metering or pressure regulating equipment.  In the event that \nequipment having a high instantaneous demand, such as a gas engine, is to \nbe connected, the customer shall provide an adequate pulsation or surge tank, \nshut-off valves, and other protective devices as may be required by the City.  \nCustomer shall, in every case, confer with the City before any equipment or \napparatus requiring extremely close regulation or pressure or quantity of gas \nis connected to the City’s distribution system. \nWhen the City is required, by order of properly constituted authorities, to \nmove or alter its existing distribution system, thereby necessitating a change \nin the location of the service lead and the point of delivery, the City will \ndesignate a new point of delivery to which the customer, at the customer’s \nexpense, will bring the service lead. \nService will be delivered to the customer for each premise at one point of \ndelivery designated by the City.  For the mutual protection of the customer \nand the City, only authorized employees of the City are permitted to make \nconnections between the City’s gas service and the customer’s gas piping. \nThe City reserves the right to require the customer to reimburse the City for \nany cost due to a change in meters or other apparatus, or in their location, \nmade at the request of the customer.  Meters and other equipment of the City \nwill be removed and relocated only by employees of the City. \n5.2 \nProtection of Sub-Surface Facilities \nThe customer shall consult the City regarding the necessity of changing the \nlocation of gas service before building any addition or structure.  The \ncustomer shall notify the City before operating or permitting the operation of \nany power excavating or ditching equipment in the proximity of the City’s \nunderground gas service on the Customer’s premises. \n5.3 \nForeign Gas or Fuel – Emergency Fuel \nThe customer shall make exclusive use of service provided by the City, and \nno other source of gas or fuel shall be connected to any installation, which in \nturn is connected to the City’s gas distribution system.  This does not \npreclude the use of emergency fuel systems owned by the customer, provided \nthat switching arrangements are installed to prevent the possibility of the \nemergency fuel and the City gas service being connected to the load \nsimultaneously.  The matter of connection of any emergency fuel system \nmust be approved by the City prior to use. \n \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n15 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \n5.4 \nResale of Natural Gas \nNatural gas service supplied by the City is for the exclusive use of the \ncustomer.  Consequently, the customer will not be permitted by submetering, \nprorating, or any other means, to determine a quantity of natural gas and \nresell the same as such to any other person or persons on the customer’s \npremises or for use on any other premises.  The sale of energy by a customer, \nwhere natural gas purchased from the City is the fuel used for production of \nsuch energy for sale, shall be construed as a resale of the natural gas and is \nnot permitted.  Except that natural gas purchased from the City for the \nexclusive resale in the form of compressed natural gas for the fueling of \nmotorized vehicles is permitted. \nThe City reserves the right to refuse to furnish natural gas to any customer \nwhere the purchase of such service is for the purpose of resale by the \ncustomers to others.  In the event natural gas is resold in conflict herewith, \nthe City shall have the right, at its option, either to discontinue service to the \ncustomer or to furnish service directly to the sub-customer. \n5.5 \nAccess to Premises \nThe customer will provide access to the customer’s premises at all reasonable \ntimes for authorized employees of the City for any purpose incidental to the \nsupplying of natural gas service. \n5.6 \nCity Apparatus Remains City Property \nAll lines, apparatuses, instruments, meters, regulators and materials supplied \nby the City shall remain its property and shall be returned to it by the \ncustomer in the same condition as when received by customer except for \nordinary wear and depreciation, and the City may at any time examine, \nchange, or repair its property on the premises of the customer and may \nremove all such property at any time after the termination of service.  The \nCity’s property shall not be worked upon or interfered with by the customer \nor other unauthorized persons.  All damages or injury to the lines, \napparatuses, or materials of the City on the customer’s premises caused by \nany act or neglect of the customer shall be repaired by City personnel and \npaid for by the customer. \n5.7 \nIndemnity to City \nThe customer assumes all responsibility on customer’s side of the point of \ndelivery for service supplied or taken, as well as for the natural gas \ninstallation and appliances used in connection therewith, and will indemnify, \nsave harmless, and defend the City against all claims, demands, costs, or \nexpense for loss, damage, or injury to persons or property in any manner \ndirectly or indirectly connected with or growing out of the distribution or use \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n16 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nof natural gas service by the customer at or on the customer’s side of the \npoint of delivery. \n6.0 Definition of a Cubic Foot of Gas \n6.1 \nFor Testing \nFor the purpose of testing natural gas, a cubic foot of gas shall be taken to be \nthat amount of gas which occupies a volume of one cubic foot when saturated \nwith water vapor and at a temperature of 60 degrees Fahrenheit, and under \nan absolute pressure of 30 inches of mercury at 32 degrees Fahrenheit. \n6.2 \nFor Delivery \nFor the purpose of measurement of gas to a customer, a cubic foot of gas \nshall be taken to be the amount of gas which occupies a volume of one (1) \ncubic foot under the conditions existing in such customer’s meter as and \nwhere installed; provided, however, that when gas is metered at a pressure in \nexcess of four (4) ounces above average local atmospheric pressure, a \nsuitable correction factor shall be applied to provide for measurement of gas \nas if delivered and metered at a pressure of four (4) ounces above average \nlocal atmospheric pressure.  In cases where gas is supplied to the customer \nthrough an orifice or other type meter at other than standard low-pressure \ndistribution conditions, the City shall apply suitable correction factors or \nequipment as it deems necessary for measurement of gas as if metered at \nstandard delivery pressure.\n7.0 Meter Testing \n7.1 \nMeter Accuracy and Testing \nThe City shall, at any time, have the authority to make a test of the accuracy \nof any gas service meter.  If the meter is determined to be inaccurate, the City \nmay repair or replace the meter at its discretion.   \n7.2 \nMeter Testing on Request \nThe City shall, at any time when requested by a customer, make a test of the \naccuracy of any gas service meter free of charge; provided, first, that such \nmeter has not been tested within the twelve-month period prior to such \nrequest, and, second, that the customer will agree to accept the result of such \ntest made by the City as the basis for settling any difference claimed.  A \nwritten report giving the result of every such test shall be made to the \ncustomer who requested it, the original record being kept on file at the office \nof the Trinidad Municipal Natural Gas Department for a period of at least \ntwo years.  If the meter is determined to be inaccurate, the City may repair \nor replace the meter at its discretion.  \n  \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n17 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \n7.3 \nRecords of Tests and of Meters \nA “meter record card” shall be maintained on each meter owned or used by \nthe City.  Such records shall show the date of purchase, manufacturer’s serial \nnumber, record of the present location, and date and results of the last test \nperformed by the City, which record shall be retained for the life of the meter. \nWhenever a meter is tested either on request or upon complaint, the test \nrecord shall include the information necessary for identifying the meter, the \nreason for making the test, the reading of the meter if removed from service, \nthe result of the test, together with all data taken at the time of the test in \nsufficiently complete form to permit the convenient checking of the methods \nemployed and the calculations made.  Such record shall be retained for a \nperiod of two years. \n8.0 Gas Supply Charge \n8.1 \nApplicability \nAll customers receiving service under the following rate schedules shall be \nbilled a Gas Supply Charge: \n \nRate Schedule RS – Residential Sales Service \n \nRate Schedule CS – Commercial Sales Service \nAdditionally, customers served under Rate Schedule SC may also be subject \nto the Gas Supply Charge if so provided in the special contract required to \nreceive service under said rate schedule.   \n8.2 \nPurpose \nThe purpose of the Gas Supply Charge is to recover the cost of purchasing \nnatural gas for the City’s customers.  Such costs include the cost of upstream \npipeline transportation, storage, and other services incurred to deliver the \nnatural gas supplies to the City’s distribution system at the City’s Receipt  \nPoint. \n8.3 \nDetermination of Gas Supply Charge \nThe Gas Supply Charge shall be computed using the following formula: \n \n \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n18 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nA+B \nC \nWHERE: \nA = Forecasted Gas Cost obtained by adding the forecasted cost \nof purchased gas and the forecasted cost of upstream pipeline \nservices. \nB = Deferred Gas Cost obtained by comparing the actual \npurchased gas cost plus the actual cost of purchased pipeline \nservices with the revenue recovered by the Gas Supply \nCharge.  If the Gas Supply Charge revenue exceeds costs, \nthere shall be an over-recovery of gas costs.  If costs exceed \nthe Gas Supply Charge revenue, there shall be an under-\nrecovery of gas costs. \nC = Forecasted Gas Sales obtained by normalizing an historical \ntwelve-month period of gas sales volumes. \nThe Gas Supply Charge shall be calculated on an annual basis no later than \nOctober 1 and changes to it will be effective on November 1 of each year, \nunless otherwise approved by the City Council.  Additionally, the Gas Supply \nCharge may be calculated and changed from time to time during the year, if \nthe change amounts to at least $0.01 per CCF or greater.   \nIn the event the Deferred Gas Cost deficit exceeds $500,000 as of the \ncalculation date, the recovery amount in the following year may be reduced \nupon approval by the City Council. In no case shall the recovery amount for \nthe following year be less than twenty-five percent (25%) of the Deferred \nGas Cost deficit.\n9.0 Extension Policy \nThe purpose of the Trinidad Municipal Natural Gas Department’s extension policy \nfor its natural gas distribution system is to: (1) set forth its service connection and \ndistribution line extension requirements; (2) protect the City against making \nunwarranted or uneconomical investment which might adversely affect rates or \nservice upon existing customers; and (3) provide for the classification of natural gas \ndistribution service to customers and the appropriate terms and conditions under \nwhich service facilities will be extended. \n \n9.1 \nGas Service and Main Line Installations \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n19 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nA. \nAssociation, Subdivision, and Master Tap Applicants. \n(1) Application for gas taps by an Association, Subdivider, or \nMaster Tap Applicant shall contain the number of individual \nservice lines to be granted the Association, Subdivider, or \nMaster Tap Applicant.  \n(2) In no event shall the number of individual service lines \nactually granted to and utilized by the Association, Subdivider, \nor Master Tap Applicant, after the approval of the tap, exceed \nthe number specified in the application.  A violation of this \nsubparagraph shall result in termination of gas service to the \nAssociation, Subdivider, or Master Tap Applicant; provided, \nhowever, an Association, Subdivider, or Master Tap Applicant may \nbe granted additional services upon submission and approval of \nan amended application.   \n(3) Association taps, Subdivision taps, and Master taps may be \nallowed for out-of-city services from City gas mains on an \nindividual contract basis with the City.  The City shall be \nresponsible for the quality of gas only to the point of delivery.  \nMaintenance of the Association, Subdivider, or Individual lines \npast the point of delivery shall be borne by the Association, \nSubdivider, or Master Tap Applicant. \n9.2 \nGas Mains, Taps, Service Lines, and Meters \nA. \nAll taps on the City mains shall be performed by City forces and shall be \ncharged to the person requesting the tap.  Materials will be charged \nat City cost plus fifteen percent (15%).  Charges for such installations \nshall be based upon a schedule determined by the Gas \nSuperintendent to include the cost of materials, equipment, and \nhourly labor rates paid by the City.  Sales taxes shall be charged \nwhere applicable.  Said fee shall be payable upon completion of the \nwork. \nB. \nAll gas mains and service lines shall be of steel or polyethylene pipe \ninstalled in accordance with all applicable codes and specifications. \nC. \nService lines from the main to the meter shall be installed by City forces \nupon the issuance of a gas service permit by the Trinidad Municipal \nNatural Gas Department. \nD. \nIn the event of a leaking or ruptured gas service line or main, the City \nshall perform the repair work.  The property owner, developer, and/or \ncontractor will be responsible for payment of such repairs if the damage \nto the pipeline is caused by the property owner, developer, and/or \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n20 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \ncontractor, including any expenses the City may incur in turning the gas \nservice off. \nE. \nIf, in establishing a new grade for a street, the street grade is lowered \ncausing the gas service to have less than eighteen inches (18\") of burial, \nthe City shall replace the line, except that if the changing of the grade \nis part of an improvement district or development project the charges \nshall be borne by the project. \nF. \nProperty to be served must be adjacent to City mains and must be served \ndirectly therefrom. \nG. \nNo tap shall be made on a City main until the applicable front foot \ncosts have been paid or a payment plan has been approved by the Gas \nDepartment Superintendent.   \nH. \nNo gas service line shall be connected from the service on one (1) building \nto any other building, vehicle, trailer, mobile home, or other structure or \nfacility, fixed or mobile. \nI. \nAny complex of buildings containing ten (10) or more separate \ndwelling units, whether the same be apartments, homes, duplexes, or \notherwise, but not including sleeping rooms, and owned by any one (1) \nperson, or a licensed trailer coach park owned by one (1) person, if the said \nbuildings or trailer coach park are all located on one (1) continuous tract \nof ground owned by one (1) person, shall be allowed to install one (1) or \nmore metered service lines, and may make such taps from these service \nlines as are approved from plans submitted in advance of construction \nsubject to Section IV. 9.1 A.(1), A.(2) and A.(3) herein.  No additional \ntaps shall be made on these service lines until revised plans are \nsubmitted and approved.  No tap shall be made to sell or give away gas \nto any agency, corporation, or person.  It is further provided that in the \nevent any property or properties owned by such person shall be sold or \ndisposed of, and such property or properties does not have a separate \nservice line, the new owner must install a separate service line if gas \nservice is to be retained.\nJ. \nIf the City initiates a main installation for replacement of an existing City \nmain, the City shall bear the cost of transferring taps and re-\nconnecting the customer's service lines. \nK. \nWhere taps are provided in the laying of a gas main, no connection shall \nbe made to these taps until the applicable front foot costs have been paid. \nL. \nWhere gas service is abandoned and/or the building being served is razed, \nthe customer's service shall be disconnected from the main at the \ncustomer's expense and the tap capped and closed.  Service will not \nbe re-established until the line is replaced at the property owner's \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n21 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nexpense.  Service will not be re-established for any use other than that \noriginally authorized unless approved in advance by the City. \n9.3 \nGeneral Requirements for Main Extensions \nA. \nThe City shall make or cause to be made such extensions or \nreplacements to the gas distribution system, as it deems necessary \nand feasible to serve any dwelling, commercial or industrial \nestablishment, or property situated within the service area of the \nTrinidad Municipal Natural Gas Department. \nB. \nAll gas main extensions of the Trinidad Municipal Natural Gas \nDepartment are to be under the exclusive control and ownership of the \nCity.  The request for a main extension shall be made in accordance \nwith the provisions of this Tariff.  The Trinidad Municipal Natural Gas \nDepartment shall have sole discretion in making main extensions and \nconstructing appurtenant facilities both inside and outside the \ncorporate limits of the City. \nC. \nAll requests for main extensions, whether they are for a single \ncustomer or for a developer of an area, shall be submitted to the City \nin writing so that the Gas Superintendent and other City departments, \nas may be required, may review and consolidate their planning.  Plans \nshall be approved prior to construction. \nD. \nAll new gas services shall be served from mains only, and from mains \nadjacent to the property being served. \nE. \nDevelopers shall submit plans for approval that shall include such \ninformation as street widths, lot size, street names, utility easements, \nand utility design, and other information as may be required by City \ndepartments.\nF. \nAgreements on cost-sharing distribution shall be entered into prior to \nconstruction, and, rather than assessment of a front foot cost, the \ndeveloper of an area may elect to include the price of utilities in the \ncost of the lot. \nG. \nOwners or developers of properties either inside or outside the City \nrequiring the construction of new mains or reinforcement of existing \nmains in order to be served by the utilities shall bear the cost of such \nfacilities.  Costs shall include design, supervision, valving, cathodic \nprotection, and appurtenances. \nH. \nMains shall be laid only in platted streets, alleys, or recorded right-of-\nway easements with provisions for access to maintain the facilities. \nI. \nThe City shall bear the cost of main extensions only under the following \ncircumstances: \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n22 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \n(1) When the City requires a larger main for purposes of system \nimprovement or system extension above and beyond that \nrequired to serve a customer or a developer's present and \nanticipated needs in completely developing his/her property, the \nCity shall pay the estimated cost of over-sizing and over-design \nrequirements. \n(2) Lines laid by the City for the exclusive use of transmission lines \nor lines laid for general system upgrading to provide better \npressure, or multiple feeding for greater reliability, shall be at \nCity expense.  A customer allowed to tap such lines shall pay to \nthe City a front foot cost as though the main were laid for the \ncustomer’s service. \n(3) Lines laid to municipal development, such as parks or City \nowned industrial parks, shall be at City expense. \nJ. \nNo services will be provided for unplatted properties located within \nthe City. \n9.4 \nElements in Planning, Constructing, and Financing Main Extensions \nA. \nThe location, route, and length of gas extensions shall be \ndetermined by the City Gas Superintendent based upon service \nrequirement capabilities and ultimate requirements of the City utility \nsystem.  Generally, properties shall be serviced from mains in the \nstreet or alley fronting the property, and gas mains laid within the \npublic right-of-ways shall be no smaller than two inches (2\") in \ndiameter.  The size, materials, valving, cathodic protection, and other \nmain extension requirements shall be determined by the City Gas \nSuperintendent prior to the authorization of such work and material \ninstallation.\nB. \nThe “Guidance Manual for Operators of Small Gas Systems,” as \npublished and hereafter amended by the U.S. Department of \nTransportation, Research and Special Programs Administration, U.S. \nGovernment Printing Office 1991-568-282, and Title 49, §§ 190-99, of \nthe Code of Federal Regulations (49 CFR §§ 190-99), are hereby \nadopted by reference and incorporated fully as if set out at length \nherein. \nC. \nNo tap shall be allowed on a main to serve a property until the main is \nextended to the far property line, unless the owner of the property \nsigns an agreement approved in form by the City Attorney that he/she \nwill pay the front foot costs for such main extension to or past his/her far \nproperty line.  Such agreement shall contain the total amount of monthly \npayment installments to be made, not to exceed twelve (12) months \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n23 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \nwithout authorization of City Council. City Council may waive this \nrequirement if it finds and determines that no practical or useful purpose \nwould be served by extending the main to the far property line or \nbeyond. \nD. \nA main may be extended to serve a single customer, a group of \ncustomers, a “pocket” consisting of a house or houses between \ndeveloped areas, or a development.  At the option of the City, and \ndepending on the availability of City funds for investment in new mains, \nany of the following means of financing may be arranged: \n(1) If the City elects to lay a main, either with City forces or by \ncontract at City expense, no service shall be allowed to any \ncustomer until front foot costs are paid for that property, or until \narrangements are agreed to for deferred payment. \n(2) Main Extensions to serve a subdivision, development, or area \ngenerally will be financed by the property owner or the person \ndeveloping the property.  Within the development, all costs of \nthe main extensions shall be absorbed in the development \ncosts.  Upon completion of construction of the mains, they shall \nbecome the property of the City. \nE. \nIn submitting a main extension proposal, the developer shall submit two \n(2) copies of a preliminary plat that indicates point(s) of connection \nto existing City mains, valving existing lines or structures, and other \npertinent factors controlling line sizing.  Two (2) copies of the final \nplat shall be submitted for approval to the Gas Superintendent. \nF. \nThe City may assume all or a portion of the cost of replacement of \nundersized or deteriorated mains which the City deems to have served \ntheir useful purpose.  At its discretion, the City may assume all or a \nportion of the cost of main extensions to properties already having \nservice. \nG. \nAt the City's discretion, payment for main extension may be in cash, or \nby a fifty percent (50%) down payment with the balance handled as a \nmiscellaneous charge by consolidated billing apportioned over no more \nthan twelve (12) months with a handling charge of one and one-half \npercent (1 1/2%) per month on the unpaid balance.  The outstanding \nunpaid balance shall constitute a lien on the property served.  \n9.5 \nOwnership of Constructed Facilities \nThe ownership of any equipment and facilities provided wholly or in part at \nthe expense of an applicant under these rules shall at all times be vested \nexclusively in the City. \n \nCITY OF TRINIDAD, COLORADO \nOriginal \nSheet No. \n24 \n \n \nSuperseding \nGas Tariff Volume 2 \n \nSheet No.  \n \n \n \nIssue Date January 16, 2024 \nSignature of Issuing Officer \n  \nCity Clerk \nEffective Date March 1, 2024 \n \n9.6 \nCost of Right of Way \nWhere applicants for service are so located that it is necessary or desirable to \nuse private and/or government right-of-way to furnish service, such \napplicants may be required to provide or pay the cost of providing such right-\nof-way in addition to any applicable construction or aid to construction \ncharges. \n9.7 \nConstruction to Be Part of City System \nThe branch of the distribution system necessary to supply service to an \nindividual customer shall be included as part of the City’s general \ndistribution system, unless said distribution line is owned, operated, and \nmaintained by the customer. \n10.0 Meter Locations \n10.1 \nIn all cases where gas piping is installed, and the gas piping will be directly \nconnected to the gas utility's gas meter or service gas piping outlet, the person \ninstalling such gas piping shall provide, or see that there is provided, a \nsuitable and sufficient space for the location of such gas meter or service gas \npiping outlet. \n10.2 \nNo gas meter shall be located inside any building or structure.  \n11.0 Pipe Material, Pipe Sizes, and Installation of Piping \nPipe material, pipe sizes, and the installation of piping shall conform to the \nrequirements set forth in the Plumbing Code, as adopted by reference in Section 15-\n1 of the Trinidad City Code. \n12.0 Penalty for Violation \nIt shall be unlawful for any person to violate any of the provisions of this Tariff or \nto cause, permit, or suffer the same to be done; and any person violating any of \nthe provisions of this Tariff shall be deemed guilty of a misdemeanor, and upon \nconviction of any such violation, such person shall be punished as provided in \nSection 1-8 of the Trinidad City Code. \n13.0 Non-liability of City \nThis Tariff shall not be construed as imposing upon the City any liability or \nresponsibility for damages to any person injured by any defect in any gas piping \nand/or appliances herein mentioned, or by the installation thereof, nor shall the City \nor any official or employee thereof be held as assuming any such liability or \nresponsibility by reason of the inspection authorized hereunder or certificate of \ninspection issued by the City or state gas inspector. \n"}