{
    "chapter": "Chapter 7 - Finance and Taxation",
    "content": "Chapter 7 - Finance and Taxation\nARTICLE 1.  GENERAL PROVISIONS.\nSections:  \n7-1                         Bills against City - Form of claim.   \n7-2                         Presentation of bills against City; payment of salaries.   \n7-3                         Property - Taxable and exempt.   \n7-4                         Equalization of property valuation; levy.   \n7-5                         Collection of City taxes; bond of County collector.   \n7-6                         Allowance to County officers for collection of City taxes.   \n7-6.1                      Revenue changes.   \nARTICLE 2.  CITY SALES TAX ACT.    \n7-7                         Purpose of Article.   \n7-8                         Citation of Article.   \n7-9                         Definitions.   \n7-10                       Taxable transactions - Exceptions.   \n7-11                       Transactions - Out of City sales.   \n7-12                       Retailer responsible to collect and remit tax.   \n7-13                       Schedule of taxes.   \n7-14                       Credit sales.   \n7-15                       Excess tax - Collection and remittance.   \n7-16                       Retailer holds tax in trust for City.   \n7-17                       License and tax additional.   \n7-18                       False or fraudulent returns; refusal to file returns.   \n7-19                       Use of proceeds of tax.   \n7-20                       Penalty for violation.   \nARTICLE 3.  USE TAX.    \n7-21                       Purpose.   \n7-22                       Application and exemptions.   \n7-23                       Building and Construction Use Tax.   \n7-24                       Motor Vehicle Use Tax.   \nARTICLE 4.  SALES TAX SIMPLIFICATION ACT.    \n7-25                       Sales Tax - Nonapplicability.   \n7-26                       Use Tax - Nonapplicability.   \n7-27                       Sales Tax - Credit for Sales or Use Taxes previously paid to another municipality.\n7-28                       Use Tax - Credit for Sales or Use Taxes previously paid to another municipality.   \n7-29                       Use Tax - Alternative dispute resolution procedure -Deficiency notice or claim for refund.   \nARTICLE 5.  BUSINESS AND OCCUPATION TAX ON UTILITY COMPANIES.    \n7-30                       Levy of tax.   \n7-31                       Amount of tax.   \n7-32                       Payment of tax and filing statements.   \n7-33                       Failure to pay tax.   \n7-34                       Penalty for violation.   \n7-35                       Inspection of records.   \n7-36                       Credit against tax.   \n\n7-37                       Exemption from Article.   \n7-38                       Construction of Article.   \nARTICLE 6.  ECONOMIC DEVELOPMENT FUND.    \n7-39                       Economic Development Fund established.   \n7-40                       Economic Development Fund purpose.   \n7-41                       Determination of use of Economic Development Fund.   \nARTICLE 7.  LODGING TAX    \n7-42                       Lodging Tax Imposed on Transaction of Furnishing Rooms or Accommodations/Exceptions.   \n7-43                       Point of Imposition.   \n7-44                       Administration.   \n7-45                       Persons Liable/Remittance of Tax.   \n7-46                       City Lodging Tax Fund.   \n7-47                       Lodging Tax Advisory Board.    \nARTICLE 8. PURCHASES    \n7-50                       Small purchases   \n7-51                       Purchases based on informal bids   \n7-52                       Purchases based on formal bids   \n7-53                       Exceptions   \nARTICLE 9.  RESPONSIBLE FINANCIAL MANAGEMENT.   \n7-54                       Responsible Financial Management Funding   \nCHAPTER 7.  FINANCE AND TAXATION.     \nARTICLE 1.  GENERAL PROVISIONS.    \nSection 7-1.    Bills against City - Form of claim.   \n    \n(1)  All bills against the City shall be presented in the form of an itemized account, stating specifically the nature of the\nindebtedness and shall be sworn to by the claimant, his/her agent or attorney, before the City Clerk, or some other person\nduly authorized by law to administer oaths, which affidavit may be in the following form:\n\"STATE OF COLORADO    \n    COUNTY OF LAS ANIMAS\"  ss.\n   \nI, A.B., on oath, state that the foregoing account is just and due, and no part thereof   \nhas been paid (except ________________) and that it comprises all claims I have   \nagainst the City of Trinidad to date.\"   \n(2)  If the claim is for a fixed salary or for any certain sum by contract with the City Council, the account need not be sworn\nto.  All such bills shall be read in open session of the Council, and may be allowed, rejected, referred to any appropriate\ncommittee, or otherwise disposed of, as the Council may direct.  (Ord. 1958, Sec. 26-2.)   \nSection 7-2.    Presentation of bills against City; payment of salaries.       \n   (1)  All bills against the City shall be presented for approval, auditing and allowance at regular meetings of the City\nCouncil.   \n   (2)  The City Manager is authorized to make payment of salaries and wages to all City employees every two weeks after\ncompletion of proper payroll or time cards have been approved by the respective department heads or immediate\nsupervisors of said employees.  Such salaries and wages shall be computed upon fourteen (14) calendar day periods\nreflecting the work hours or authorized leave time of each respective employee.  All such payroll shall be approved by the\nCity Council as now provided for by ordinance, and the same shall be approved at regular meetings of the City Council.      \n     State law references:    As to the powers of the City to levy taxes, see C.R.S. 1973, Sec. 31-15-302; as to finance matters\ngenerally see C.R.S. 1973, Title 31, Art. 20.    \nSection 7-3.    Property - Taxable and exempt.   \n     \n   The same amount and property, real and personal, shall be exempt from assessment and taxation for City purposes, as\nare now or may hereafter be exempt by general law from assessment and taxation for County purposes; and all property\nwithin the City that is subject to assessment and taxation for County purposes shall be subject to assessment and taxation\nfor City purposes.  (Ord. 1958, Sec. 26-5.)   \nSection 7-4.    Equalization of property valuation; levy.   \n    \n   When the equalization of the value of property within the City shall have been completed each year by the County\nCommissioners of Las Animas County, as required by law, it shall be the duty of the City Clerk to correct the duplicate\nreturn of such property made to the City Council by the Assessor, in accordance with the changes in the valuation of the\nsame adopted by the County Commissioners.  The City Council shall by resolution levy upon the real and personal\nproperty described in such amended return such sum or sums as may be required for any purpose for which it may be\nauthorized to levy taxes, and it shall therein specify the rate of taxation as fixed by it for City purposes upon all property\nwithin the City.  The City Clerk shall then certify a copy of such resolution to the County Assessor who shall proceed to\nextend upon the tax lists of the current year as required by law.  (Ord. 1958, Sec. 26-6.)   \n     State law reference:    As to levy and limitations thereon, see C.R.S. 1973, Sec. 29-1-301.    \nSection 7-5.    Collection of City taxes; bond of County collectors.   \n   The County Treasurer or other County collector of County taxes shall collect the City taxes at the same time he/she\ncollects other taxes.  He/she shall give such bond as may be fixed by ordinance, and he/she shall pay over all taxes\ncollected for the City to the City Finance Director at the end of each month, upon presentation to him/her of an order\nsigned by the Mayor and City Clerk.  He/she shall be liable upon his/her official bond as County Treasurer for the faithful\ndischarge of all the duties and obligations imposed by law.  (Ord. 1958, Sec. 26-7.)   \n     State law reference:    As to provisions pertaining to collection of City taxes by County Treasurer, see C.R.S. 1973,\nSec, 31-20-106.    \nSection 7-6.    Allowance to County officers for collection of City taxes. \n   The City Council each year shall make such allowance, to be paid out of the general fund as shall be reasonable and just\nto the County officers as compensation for the extra labor imposed by this Article or general law of the State, and shall pay\nsuch other charges as by law may pertain to the collection of the City taxes.  (Ord. 1958, Sec. 26-8.)  \n     State law reference:    As to City's share of expenses of County officers, see C.R.S. 1973, Sec. 31-20-107.    \nSection 7-6.1. Revenue changes.   \n   Pursuant to Article X, Section 20 of the Colorado Constitution, the qualified electors of the City of Trinidad authorize the\nCity to collect, retain and expend all sales tax, use tax, and property tax revenues, and all Non-Federal grants, fees and\nother revenues for capital projects and other basic municipal services, notwithstanding any state restriction on fiscal year\nspending, including without limitation the restrictions of Article X, Section 20 of the Colorado Constitution on and after\nJanuary 1, 1995. Nothing in this section shall be interpreted to authorize any increase in the rate of taxation of the sales\nand use tax, or property tax, without a vote of the people if and when required pursuant to Article X, Section 20 of the\nColorado Constitution. (Ord. 1514, 8-12-1995.)   \nARTICLE 2.  CITY SALES TAX ACT.    \nSection 7-7.    Purpose of Article.  \n \n  The purpose of this Article is to impose a sales tax on the sale of tangible personal property at retail and the furnishing of\nservices within the City. (Repealed and reenacted, Ord. 2080, eff. 8-16-19)\n \nSection 7-8.    Citation of Article.   \n   \n   This Article shall be known as the \"City Sales Tax Act\" and may be cited as such.  (Ord. 1181, Sec. 2, 10/4/80.)   \nSection 7-9.    Definitions.   \nAs used herein:   \n   (1)  City Clerk  shall mean the Clerk of the City of Trinidad.  \n   (2)  City Treasurer  shall mean the Treasurer of the City of Trinidad.\n     \n   (3)  Doing business or engaging in business  shall mean the selling, leasing or delivering in the City any activity in the\nCity in connection with the selling, leasing, or delivery in the City, of tangible personal property by the retail sale as\ndefined in this section, for use, storage, distribution or consumption within the City.  This term includes, but shall not be\nlimited to the following acts or methods of transacting business.   \n   (a)  The maintaining within the City, directly or indirectly or by a subsidiary, of an office, distributing house,\nsalesroom or house, warehouse, or other place of business;   \n     \n   (b)  The soliciting whether by direct representatives, indirect representatives, manufacturer's agents or by\ndistribution of catalogues or other advertising or by use of any communication media or by use of the newspaper,\nradio or television advertising media, or by any other means whatsoever, of business from persons residing in the\nCity, and by reason thereof receiving orders from, or selling or leasing tangible personal property to, such persons\nresiding in the City for use, consumption, distribution and storage for use and consumption in the City.   \n   (4)  Executive Director  shall mean the executive director of the Department of Revenue of the State of Colorado.   \n   (5)  Retail sale  shall mean all sales made within the City except wholesale sales.   \n   The definition of all other words, terms and phrases shall be as defined in Section 102, Article 26, Title 39, C.R.S. 1973 as\namended, and said definitions are incorporated herein by reference.  (Ord. 1398, Sec. 2, 6/18/91., Ord. 1539, Sec. 2, 8-31-\n1996.)   \n   (6) Repealed (Ord. 1539, Sec. 7-9, eff. 8/31/96)   \nSection 7-10.  Taxable Transactions - Exemptions.   \n \n(1) There is hereby levied and shall be collected and paid a tax in the amount stated in Section 7-13 of this Article on the\nsale of tangible personal property at retail and the furnishing of services within the City.  The tangible personal property\nand services taxable pursuant to this Article shall be the same as the tangible personal property and services taxable\npursuant to Section 39-26-104, C.R.S., and subject to the same exemptions as those specified in Section 39-26-713, C.R.S.,\nexcept the exemption allowed by Section 39-26-709, C.R.S. for purchases of machinery or machine tools, the exemptions\nof sales and purchases of those items in Section 39-26-715(1)(a)(II), C.R.S., the exemption for sales of food specified in\nSection 39-26-707, C.R.S., the exemptions for vending machine sales of food set forth in Section 39-26-714(1)(b), C.R.S.,\nthe exemption for occasional sales by a charitable organization set forth in Section 39-26-718, C.R.S., the exemption for\nsales and purchases of farm equipment and farm equipment under lease or contract specified in Section 39-26-716(2)(3)\n(4), C.R.S., and the exemption for sales of low-emitting motor vehicles, power sources, or parts used for converting such\npower sources as specified in Section 39-26-719, C.R.S. (Repealed and reenacted, Ord. 2080, eff. 8-16-19)\n(2) All sales of personal property on which a specific ownership tax has been paid or is payable shall be exempt from the\ntax imposed by this Article when such sales meet both of the following conditions: \n                        (a)       The purchaser is a non-resident of or has his/her principal place of business outside of the City;\nand\n                        (b)       Such personal property is registered or required to be registered outside the City limits under the\nlaws of the State of Colorado. (Repealed and reenacted, Ord. 2080, eff. 8-16-19)\n(3) The amount subject to tax shall not include the amount of any sales or use tax imposed by Article 26 of Title 39, C.R.S.\n(Repealed and reenacted, Ord. 2080, eff. 8-16-19)\n   (4)    This sales tax shall not apply to the sale of construction and building materials, as the term is used in C.R.S. 29-2-\n109, if such materials are picked up by the purchaser and if the purchaser of such materials presents to the retailer a\nbuilding permit or other documentation acceptable to the City evidencing that a local use tax has been paid or is required\nto be paid.   \n   (5)    This sales tax shall not apply to the sale of tangible personal property at retail or the furnishing of services if the\ntransaction was previously subjected to a sales or use tax lawfully imposed on the purchaser or user by another statutory\nor home rule city and county, city, or town equal to or in excess of that sought to be imposed by this City.  A credit shall be\ngranted against the sales tax imposed by this City with respect to such transaction equal in amount to the lawfully imposed\nlocal sales or use tax previously paid by the purchaser or user to the previous statutory or home rule city and county, city\nor town.  The amount of the credit shall not exceed the sales tax imposed by this City.  (Ord. 1398, Sec. 2, 9/3/91.)   \n(6) This sales tax shall not apply to the sale of food purchased with food stamps.  For the purpose of this subsection (6),\n\"food\" shall have the same meaning as provided in 7 U.S.C. Section 2012(g), as such section existed on October 1, 1987, or\nas thereafter amended. (Repealed and reenacted, Ord. 2080, eff. 8-16-19)\n(7) This sales tax shall not apply to the sale of food purchased with funds provided by the special supplemental food\nprogram of women, infants, and children, 42 U.S.C., 1786.  For purposes of this subsection (7), \"food\" shall have the same\nmeaning as provided in 42 U.S.C. Section 1786, as such section existed on October 1, 1987, or as thereafter amended.\n(Repealed and reenacted, Ord. 2080, eff. 8-16-19)\nSection 7-11.  Transactions - Out of City sales.   \n \n   (1)  All retail sales are deemed to be consummated at the place of doing business of the retailer unless the tangible\npersonal property sold is delivered by the retailer or his/her agent to a destination outside the City limits or to a common\ncarrier for delivery to a destination outside the City limits.   \n   (2)  The gross receipts from sales consummated outside the City limits shall include delivery charges when such charges\nare subject to state sales and use tax imposed by Article 26, Title 39, C.R.S. 1973, regardless of the place to which delivery\nis made.   \n   (3)  In the event a retailer has no permanent place of business in the City, or has more than one place of business, the\nplace at which the retail sales are consummated for the purpose of this Article shall be determined by the provisions of\nArticle 26, Title 39, C.R.S. 1973, as amended, and by the rules and regulations promulgated by the Department of Revenue\nof the State of Colorado.  (Ord. 1398, Sec. 2, 9/3/91.)   \nSection 7-12.  Retailer responsible to collect and remit tax.   \n   (1)  Every retailer shall, irrespective of the provisions of Section 7-13 of this Article, be liable and responsible for the\npayment of an amount equivalent to the amount specified in Section 7-13 of this Article.   \n   (2)  Every retailer shall remit the amount specified in subsection (1) of this section to the executive director. The\ncollection, administration and enforcement of the tax imposed by this Article shall be performed by the executive director\nin the same manner as the collection, administration and enforcement of the Colorado state sales tax.  Unless otherwise\nprovided in Article 2, Title 29, C.R.S. 1973, as amended, the provisions of Article 26, Title 39, C.R.S. 1973, as amended,\nshall govern the collection, administration and enforcement of the tax imposed by this Article.  (Ord. 1181, 10/4/80.)   \nSection 7-13.  Schedule of taxes.    (Ord. 1857, Sec. 7-13 repealed and reenacted, eff. 6/27/08)  \n(1)      There is hereby imposed upon sales of tangible personal property and the furnishing of services as specified in\nSection 7-10 of this Article a tax at the rate of four percent (4%) of the amount of sale, to be computed in accordance with\nschedules or systems approved by the executive director. (Repealed and reenacted, Ord. 2080, eff. 8-16-19)\n(2)  Except as provided in subsection (3) of this Section, the retailer shall add the tax imposed hereby or the average\nequivalent thereof to the sale price or charge, showing such tax as a separate and distinct item, and when added, such tax\nshall constitute a part of such price or charge and shall be a debt from the consumer or user to the retailer until paid and\nshall be recoverable at law in the same manner as other debts.  \n(3)  Any retailer selling malt, vinous and spirituous liquors by the drink may include in his/her sales price the tax levied by\nthis Article, except that no such retailer shall advertise or hold out to the public in any manner directly or indirectly, that\nsuch tax is not included as part of the sales price to the consumer.  The schedules described in subsection (1) of this Section\nshall be used by such retailer in determining the amounts to be included in such sales price.  Use of the schedules set forth\nin subsection (1) of this section shall not relieve such retailer from liability for payment of the full amount of tax levied by\nthis Article.   \n(4)  Every retailer shall be entitled, as collecting agent of the City, to apply and credit the amount of his/her collections\nagainst the amount paid by him/her under the provisions of Section 7-15, remitting any excess collections over said\namount less the expense allowance provided in subsection (5) of this section, to the executive director.   \n(5)  Every retailer may deduct three and one-third percent (3 1/3%) of the amount of tax to be paid by him/her under this\nArticle to cover his/her expense of collection and remittance of the tax.   \n(6)  The amount of sale subject to tax under this Article shall not include the amount of any sales or use tax imposed by\nArticle 26, Title 39, C.R.S.  (Ord. 1398, Sec. 2, 9/3/91.)   \nSection 7-14.  Credit sales.   \n  \n   (1)  In case of a sale upon credit, or a contract for sale wherein it is provided that the price shall be paid in installments\nand title does not pass until a future date, or a chattel mortgage or a conditional sale, there shall be paid upon each\npayment, upon the account of purchase price, that portion of the total tax which the amount paid bears in the total\npurchase price.  Notwithstanding any other provision of this subsection (1), a retailer doing business wholly or partly on a\ncredit basis may, at his/her election, make a return, and remit sales tax on credit sales, on the basis of the aggregate\namount of cash received during the month from taxable credit sales.  The retailer may determine the tax to be remitted on\nthe basis of his/her reasonable estimate of the aggregate amount of tax which he/she has collected from his/her credit\nconsumers during the month.  A retailer's estimate of the taxes to be collected on credit sales made in any month (referred\nto in this section as \"base month\") shall be deemed reasonable if the cumulative sum of the monthly amounts of taxes on\nsuch credit sales remitted by the retailer on months following the base month is not less than twenty-five percent, forty-\nthree and seventy-five one-hundredths percent, sixty-two and five-tenths percent, respectively, of the total taxes due on\nthe aggregate credit sales made by the retailer in the base month.  In no event, however, shall the amount of taxes remitted\nby the retailer in any month be less than the amount which the retailer actually estimates to have been collected in that\nmonth.   \n   (2)  If the retailer transfers, sells, assigns or otherwise imposes of an account receivable, he/she shall be deemed to have\nreceived the full balance of the consideration for the original sale and shall be liable for the remittance of the sales tax on\nthe balance of the total sale price not previously reported; except that such transfer, sale, assignment, or other disposition\nof an account receivable by a retailer to a closely held subsidiary, as defined in section 39-26-102 (10)(k), C.R.S. 1973 as\namended, shall not be deemed to require the retailer to pay the sales tax on the credit sale represented by the account\ntransferred prior to the time the customer makes payment on said account.  (Ord. 1181, 10/4/80.)   \nSection 7-15.  Excess tax - Collection and remittance.   \n \n   If any vendor, during any reporting period, collects as a tax an amount in excess of four percent of his/her total taxable\nsales, he/she shall remit to the executive director of the department of revenue, the full net amount of the tax imposed in\nthis Article 2 and all such excess.  The retention by the retailer or vendor of any excess of tax collections over the four\npercent of the total taxable sales of such retailer or vendor or the intentional failure to remit punctually to the executive\ndirector the full amount required to be remitted by the provisions of this Article is declared to be unlawful and constitutes\na violation of this Article.   \nSection 7-16.  Retailer holds tax in trust for City.\n   All sums of money paid by the purchaser to the retailer as taxes imposed by this Article shall be and remain public\nmoney, the property of the City, in the hands of such retailer or vendor, and he/she shall hold the same in trust for the sole\nuse and benefit of the City until paid to the executive director, and failure to so pay the executive director, such retailer\nshall be punished as provided herein. (Ord. 1181, 10/4/80.)   \nSection 7-17.  License and tax additional.   \n \n   The license and tax imposed by this Article shall be in addition to all other licenses and taxes imposed by law, except as\nherein provided.  (Ord. 1181, 10/4/80.)   \nSection 7-18.  False or fraudulent returns; refusal to file returns.        \n   It shall be unlawful for any retailer to refuse to file any returns provided to be filed in this Article, or to file any false or\nfraudulent return, or fail or refuse to make payment to the executive director of any taxes collected or due the City or in\nany manner evade the collection and payment of the tax or any part thereof, or for any person or purchaser to fail or refuse\nto pay such tax or evade the payment thereof, or to aid or abet another in any attempt to evade the payment of the tax.\n (Ord. 1181, 10/4/80.)   \nSection 7-19.  Use of proceeds of tax.   \n  \n(1)  Tax Monies collected pursuant to this Article shall be used as follows:   \n        (a)  A Sum equal to seventy-five percent (75%) of the amount collected shall be deposited in the general fund of\nthe City.  \n   \n       (b)  The sum equal to the remaining twenty-five percent (25%) of the amount shall be set aside in a reserve fund\nand shall be used to pay for capital projects, including the construction, maintenance and improvement of public\nworks, the purchase of land and buildings, and capital purchases, as determined by City Council. City Council shall\nhold at least one public hearing per year for the purpose of providing an opportunity for the public to express\nopinions as to how such monies should be spent. (Repealed and reenacted, Ord. 2080, eff. 8-16-19)   \n(2)  The allocation of the tax monies collected pursuant to this Article set forth in subsection (1) of this Section, shall\nremain in effect until December 31, 2026.  Unless the one percent (1%) sales tax to be used for capital projects is extended\nby vote of the people prior to that date, the rate of sales tax shall decrease to three percent (3%) on January 1, 2027, and\nfrom that date forward all tax monies collected pursuant to this Article shall be deposited in the general fund of the City.\n(Repealed and reenacted, Ord. 2080, eff. 8-16-19)   \nSection 7-20.  Penalty for violation.   \n \n   Any person who shall violate any of the provisions of this Article shall be guilty of violation thereof and shall be punished\nby a fine not to exceed Three Hundred Dollars ($300.00) or imprisonment not to exceed ninety (90) days, or both such\nfine and imprisonment.  (Ord. 1181, 10/4/80.)   \nARTICLE 3.  USE TAX.    \nSection 7-21.  Purpose.       \n   The purpose of this Article is to raise revenue and provide a complementary tax to the Trinidad City Sales Tax. The tax\nimposed herein is a Use Tax on building and construction materials which are purchased outside the City of Trinidad by\nCity residents for use, storage or consumption within the City of Trinidad, and on motor vehicles which are purchased\noutside the City of Trinidad by City residents for use, storage or consumption within the City of Trinidad.   \nSection 7-22.  Application and exemptions.   \nIn no event shall the Use Tax imposed by this Article extend or apply:   \n   (1)  To the storage, use or consumption of any tangible personal property, the sale of which is subject to a retail\nsales tax imposed by the City of Trinidad.   \n     \n   (2)  To the storage, use or consumption of any tangible personal property purchased for resale in the City of\nTrinidad, either in its original form or as an ingredient of a manufactured or compounded product, in the regular\ncourse of a business;   \n     \n   (3)  To the storage, use or consumption of tangible personal property brought into the City of Trinidad by a\nnonresident thereof for his/her own storage, use or consumption while temporarily within the City of Trinidad;   \n     \n   (4)  To the storage, use or consumption of tangible personal property by the United States government, or the State\nof Colorado, or its institutions, or its political subdivisions in their governmental capacities only or by religious or\ncharitable functions;   \n     \n   (5)  To the storage, use or consumption of tangible personal property by a person engaged in the business of\nmanufacturing, compounding for sale, profit, or use any article, substance, or commodity, which tangible personal\nproperty enters into the processing of or becomes an ingredient or component part of the product or service which is\nmanufactured, compounded or furnished and the container, label, or the furnished shipping case thereof;   \n     \n   (6)  To the storage, use, or consumption of any article of tangible personal property the sale or use of which has\nalready been subjected to a legally imposed sales or use tax of another statutory or home rule town, city or city and\ncounty equal to or in excess of that imposed by this Ordinance.  A credit shall be granted against the use tax imposed\nby this Ordinance with respect to a person's storage, use or consumption in the City of Trinidad of tangible personal\nproperty purchased by him/her in a previous statutory or home rule town, city, or city and county.  The amount of\nthe city credit shall be equal to the tax paid by him/her by reason of the imposition of a sales or use tax of the\nprevious statutory or home rule town, city, or city and county on his/her purchase or use of the property.  The\namount of the credit shall not exceed the tax imposed by this ordinance.   \n     \n   (7)  To the storage, use or consumption of tangible personal property and household effects acquired outside of the\nCity of Trinidad and brought into it by a non-resident acquiring residency;   \n     \n   (8)  To the storage or use of a motor vehicle if the owner is or was, at the time of purchase, a nonresident of the City\nof Trinidad, and he/she purchased the vehicle outside the City of Trinidad for use outside the City of Trinidad and\nactually so used it for a substantial and primary purpose for which it was acquired and he/she registered, titled and\nlicensed said motor vehicle outside of the City of Trinidad;   \n     \n   (9)  To the storage, use or consumption of any construction and building materials and motor and other vehicles on\nwhich registration is required, if a written contract for the purchase thereof was entered into prior to the effective\ndate of such use tax;   \n     \n   (10)  To the storage, use or consumption of any construction and building materials required or made necessary in\nthe performance of any construction contract bid, let or entered into at any time prior to the effective date of such\nuse tax ordinance or proposal.  (Ord. 1325, Sec. 2, 8/18/87.)   \nSection 7-23.  Building and Construction Use Tax.        \n   (1)  There is hereby imposed on the privilege of storing, using or consuming any construction and building materials of\nevery kind and form purchased outside the City of Trinidad, for use, storage or consumption within the City of Trinidad, a\nUse Tax of four percent (4%) of the purchase price of said construction or building materials.  (Ord. 1325, Sec. 2, 8/18/87.)\n       \n   (2)  Said Use Tax shall be paid by estimate through payment to the City an amount equal to fifty percent (50%) of the\ntotal cost of the project as indicated on the application for a city building permit and shall be evidenced by the issuance of a\nbuilding permit by the City Building Inspector.  Provided, however, the City shall, when necessary, issue a certificate of\nexemption from payment of any further sales or use tax for the materials to be used, stored or consumed pursuant to such\nbuilding permit.  \n  \n   (3)  The collection and administration of the Use Tax imposed by this Section shall be performed by the Treasurer in\nsubstantially the same manner as the collection, administration and enforcement of the Colorado Sales and Use Tax as\nprovided in Article 26, Chapter 39, Colorado Revised Statutes.  The City Manager is hereby authorized to promulgate such\nadditional rules and regulations as may be necessary for the proper administration of enforcement of this section.   \nSection 7-24.  Motor Vehicle Use Tax.   \n \n   (1)  There is hereby imposed on the privilege of using, storing, or consuming every motor vehicle purchased outside this\ncity by any resident of this City for the purpose of use, storage or consumption within this City, a Use Tax in the amount of\nfour percent (4%) of the purchase price of said motor vehicle.  (Ord. 1325, Sec. 2, 8/18/87.)        \n   (2)  Said Use Tax shall be applicable to every motor vehicle for which registration is required by the laws of the State of\nColorado.   \n \n   (3)  No registration shall be made of any motor vehicle for which registration is required, and no certificate of title shall\nbe issued for such vehicle by the Department of Revenue or its authorized agents, until any tax due upon the use, storage\nor consumption thereof pursuant to this Ordinance has been paid.   \n   (4)  The Use Tax imposed by this section shall be collected by the authorized agent of the Department of Revenue in the\nCounty in which the purchaser resides.   \n   (5)  The proceeds of said Use Tax shall be paid to the City periodically in accordance with an agreement entered by and\nbetween the City and the authorized County Agent of the Department of Revenue.   \n   (6)  The City Manager and the Mayor are hereby empowered to enter into and execute on behalf of the City any\nagreements necessary for the administration and enforcement of this Section in accordance with the provisions of Section\n24-35-110, Colorado Revised Statutes.   \nARTICLE 4.  SALES TAX SIMPLIFICATION ACT.    \nSection 7-25.  Sales Tax - Nonapplicability.   \n  \n   For transactions consummated on or after January 1, 1986, the City's sales tax shall not apply to the sales of construction\nand building materials, as the term is used in 29-2-109, C.R.S., if such materials are picked up by the purchaser and if the\npurchaser of such materials presents to the retailer a building permit or other documentation acceptable to the City\nevidencing that a local use tax has been paid or is required to be paid.  (Ord. 1285, Sec. 1, 12/17/85.)   \nSection 7-26.  Use Tax - Nonapplicability.   \n \n   For transactions consummated on or after January 1, 1986, the City's use tax shall not apply to the storage of\nconstruction and building materials.  (Ord. 1285, Sec. 1, 12/17/85.)   \nSection 7-27.  Sales Tax - Credit for Sales or Use Taxes previously paid to another municipality.    \n   For transactions consummated on or after January 1, 1986, the City's sales tax shall not apply to the sale of tangible\npersonal property at retail or the furnishing of services if the transaction was previously subjected to a sales or use tax\nlawfully imposed on the purchaser or user by another statutory or home rule municipality equal to or in excess of four\npercent (4%).  A credit shall be granted against the City's sales tax with respect to such transaction equal in amount to the\nlawfully imposed local sales or use tax previously paid by the purchaser or user to the previous statutory or home rule\nmunicipality.  The amount of the credit shall not exceed four percent (4%).  (Ord. 1285, Sec. 1, 12/17/85.)   \nSection 7-28.  Use Tax - Credit for Sales or Use Taxes previously paid to another municipality.        \n   For transactions consummated on or after January 1, 1986, the City's Use Tax shall not apply to the storage, use, or\nconsumption of tangible personal property the sale of which has already been subjected to a legally imposed Sales or Use\nTax of another statutory or home rule municipality equal to or in excess of four percent (4%).  A credit shall be granted\nagainst the City's Use Tax with respect to a person's storage, use, or consumption in the City of tangible personal property\npurchased by him/her in a previous statutory or home rule municipality.  The amount of the credit shall be equal to the tax\npaid by him/her by reason of the imposition of a sales or use tax of the previous statutory or home rule municipality on\nhis/her purchase or use of the property.  The amount of the credit shall not exceed four percent (4%).   \nSection 7-29.  Use Tax - Alternative dispute resolution procedure - Deficiency notice or claim for refund.  \n    \n   (1)  For transactions consummated on or after January 1, 1986, the taxpayer may elect a state hearing on the City\nManager's or his/her designee's final decision on a deficiency notice or claim for refund pursuant to the procedure set\nforth in this Section.   \n   (2)  As used in this Section, \"state hearing\" means a hearing before the Executive Director of the Department of Revenue\nor delegate thereof as provided in 29-2-106.1 (3), C.R.S.   \n   (3)  When the City asserts that use taxes are due in an amount greater than the amount paid by a taxpayer, the City shall\nmail a deficiency notice to the taxpayer by certified mail.  The deficiency notice shall state the additional use taxes due.\n The deficiency notice shall contain a notification, in clear and conspicuous type, that the taxpayer has the right to elect a\nstate hearing on the deficiency pursuant to 29-2-106.1 (3), C.R.S.  The taxpayer shall also have the right to elect a state\nhearing on the City's denial of such taxpayer's claim for a refund of use tax paid.   \n   (4)  The taxpayer shall request the state hearing within thirty days after the taxpayer's exhaustion of local remedies.  The\ntaxpayer shall have no right to such hearing if he/she has not exhausted local remedies or if he/she fails to request such\nhearing within the time period provided for in this subsection (4).  For purposes of this subsection (4), \"exhaustion of local\nremedies\" means:   \n   (a)  The taxpayer has timely requested in writing a hearing before the City and such City has held such hearing and\nissued a final decision thereon.  Such hearing shall be informal and no transcript, rules of evidence, or filing of briefs\nshall be required; but the taxpayer may elect to submit a brief, in which case the City may submit a brief.  The City\nshall hold such hearing and issue the final decision thereon within ninety days after the City's receipt of the\ntaxpayer's written request therefor, except the City may extend such period if the delay in holding the hearing or\nissuing the decision thereon was occasioned by the taxpayer, but, in any event, the City shall hold such hearing and\nissue the decision thereon within one hundred eighty days of the taxpayer's request in writing therefor; or   \n     \n   (b)  The taxpayer has timely requested in writing a hearing before the City and the City has failed to hold such\nhearing or has failed to issue a final decision thereon within the time periods prescribed in paragraph (a) above.   \n   (5)  If a taxpayer has exhausted his/her local remedies as provided in subsection (4) above, the taxpayer may request a\nstate hearing on such deficiency notice or claim for refund, and such request shall be made and such hearing shall be\nconducted in the same manner as set forth in Section 29-2-106.1 (3) through (7), C.R.S.   \n   (6)  If the deficiency notice or claim for refund involves only the City, in lieu of requesting a state hearing, the taxpayer\nmay appeal such deficiency notice or denial of a claim for refund to the District Court of the County of Las Animas as\nprovided in 29-2-106 (8), C.R.S., provided the taxpayer complies with the procedures set forth in subsection (4) of this\nsection.   \n   (7)  If the City reasonably finds that the collection of Use Tax will be jeopardized by delay, the City may utilize the\nprocedures set forth in section 39-21-111, C.R.S.   \nARTICLE 5 . BUSINESS AND OCCUPATION TAX ON UTILITY COMPANIES.    \nSection 7-30.  Levy of tax.   \n \n   There is levied on and against utility companies operating within the City a tax on the occupation and business of:   \n   (1)  Maintaining a telephone exchange and lines connected therewith in the City and of supplying local exchange\ntelephone service to the inhabitants of the City;   \n   (2)  Maintaining and operating within the City a plant for the transmission and distribution of artificial or natural gas, or\na mixture thereof, and of furnishing either or both of said products to the inhabitants of the City; and   \n   (3)  Maintaining and operating within the City a plant for the transmission and distribution of electrical energy and of\nfurnishing and distributing electricity or electrical energy to the inhabitants of the City.   \nSection 7-31.  Amount of tax.   \n   That the amount of tax hereby levied for 1978 shall be a flat sum in the amount of Thirty Eight Thousand Two Hundred\nDollars ($38,200.00), and for years subsequent to 1978, Two and 75/100 Dollars ($2.75) annually for each telephone\naccount for which local exchange service is provided within the City of Trinidad, as provided in Section 2 of this Ordinance\nNo. 998, Series 1971.   \nSection 7-32.  Payment of tax and filing statements.   \n \n   (1)  The tax levied by this Ordinance No. 988, Series 1971, which were made under protest or accrued by telephone\nutilities, shall be applied against the flat fee tax for 1978.  Payment of the 1978 tax shall be made fifty percent (50%) on\nJuly 31, 1978 and fifty percent (50%) on or before October 31, 1978 and for years subsequent to 1978, the tax shall be\npayable in twelve (12) equal monthly installments each installment to be payable on the last business day of each calendar\nmonth.   \n   (2)  Within fifteen (15) days after the effective date of this Ordinance, each telephone utility subject to the tax imposed\nherein shall file with the Clerk in such form as the Clerk may require, a statement showing the total number of telephone\naccounts for which local exchange telephone service was provided within the City on January 1, 1978.  Such statements\nshall be filed in each subsequent year within fifteen (15) days after January 1, showing the total number of such accounts\non January 1.   \nSection 7-33.  Failure to pay tax.   \n \n   If any utility company subject to this Article shall fail to pay the taxes as herein provided, the full amount thereof shall be\ndue and collected from such company, and the same, together with an addition of ten (10%) percent of the amount of taxes\ndue, shall be and hereby is declared to be a debt due and owing from such company to the City.  The City Attorney upon\nthe direction of the City Council, shall commence and prosecute to final judgment and determination in any court of\ncompetent jurisdiction an action at law to collect the said debt in the name of the people of the State. (Ord. 988, Sec. 4,\n12/6/71.)   \nSection 7-34.  Penalty for violation.   \n \n   If any officer, agent or manager of a utility company which is subject to the provisions of this Article shall fail, neglect or\nrefuse to make or file any quarterly statement in the manner herein prescribed, the said officer, agent, or manager shall, on\nconviction thereof, be punished by a fine of not less than Twenty Five Dollars ($25.00) nor more than Three Hundred\nDollars ($300.00).  (Ord. 988, Sec. 5, 12/6/71.)   \nSection 7-35.  Inspection of records.   \n  \n   The City, its officers, agents or representatives shall have the right at all reasonable hours and times to examine the\nbooks and records of the utility companies which are subject to the provisions of this Article and to make copies of the\nentries or contents thereof.  (Ord. 988, Sec. 6, 12/6/71.)   \nSection 7-36.  Credit against tax.   \n  \n   Any utility company maintaining facilities within the City pursuant to a franchise granted by the City may claim as a\ncredit against the tax levied by this Article the amount of any franchise payments made in accordance with the terms of\nsuch franchise.  (Ord. 988, Sec. 7, 12/6/71.)   \nSection 7-37.  Exemption from Article.   \n \n   The provisions of this Article shall not apply to any utility owned and operated by the City.  (Ord. 988, Sec. 8, 12/6/71.)   \nSection 7-38.  Construction of Article.   \n  \n   This Article shall not be construed as granting a franchise or franchise rights to any utility company.  (Ord. 988, Sec. 9,\n12/6/71.)   \nARTICLE 6.  ECONOMIC DEVELOPMENT INCENTIVES    \nSection 7-39. Economic Development Incentives.  \n(1)    Development incentives may be considered as follows to encourage business location or the creation of deed\nrestricted workforce housing that will result in economic growth for the City:\n1. Conveyance of real property owned by the City at no or reduced consideration;\n2. Reduction, deferment, or abatement of outstanding property tax;\n3. Refund of general property tax, pursuant to CRS 39-30-107.5(1); \n4. Refund of personal property tax, pursuant to CRS 31-15-903; \n5. Property tax credit or Incentive Payment, pursuant to HB 02-1399;\n6. Refund of sales tax levied by the City, pursuant to CRS 39-30-107.5(2);\n7. Waiver or reduction of both deed-restricted affordable workforce housing and commercial permit fees; \n8. Waiver or reduction of utility tap fees for both deed-restricted affordable workforce housing and commercial\ndevelopment;\n9. Any other incentive deemed appropriate not specifically identified herein.\nSection 7-40. Economic Development Incentive Considerations.   \n(1)  In making an initial determination as to the appropriateness and extent of a development incentive offer and whether\nit is in the best interest of the City, the following factors shall be considered:\n1. The size and fair market value of the improvements, number of deed restricted units, and business facilities that are\nproposed to be located in the City.\n2. The number of employees that are proposed to be employed at the business site, the proposed educational and/or\ntraining requirements of the employees to be employed, whether or not the employees will be those already\nretained by the business or will be recruited from the City and the surrounding communities, and the projected\nsalaries of the employees.\n3. Workforce intended to be served by affordable housing, deed restrictions to protect long-term affordability, reuse\nor rehabilitation of vacant or dilapidated property, or impacts to increasing the city’s existing housing stock.\n4. The impact that the proposed business will have on the City’s resources and infrastructure.  Particularly, the\nbusiness shall provide information regarding the amount of water that may be required to operate the business, the\nprojected discharge of wastewater, and special wastes produced by the business that would require the availability\nof additional resources by the City, whether the business would require increased law enforcement resources,\nand/or whether the business would produce significant amounts of odor, noise, or dust pollution, and other\nimpacts upon the City’s infrastructure due to the nature of the proposed business.\n5. The financial ability of the proposed business ownership to build the improvements, connect to City infrastructure,\nor other considerations.   The business ownership may be required to provide proof of such financial ability as part\nof an agreement for the provision of development incentives by the City.\n6. Whether the proposed business is in conformance with the City’s Comprehensive Plan and is of a character that is\namenable to the City and the surrounding community. \n7. Whether the business would result in a contribution to the economic diversity of the City.  \n8. Whether the proposed business will purchase materials and seek services from the City’s existing businesses.\n9. Any other factors determined to be peculiar to the proposed business.\nSection 7-41.  Negotiation; Determination.\n(1)  The City may contract with outside consultants or internally to collect the necessary data; conduct the initial\nassessment of the appropriateness and extent of the development incentive offer, based on the factors outlined in Section\n7-40(a) through (i); and make subsequent recommendations to the City regarding whether granting the development\nincentive is advantageous to the City and warrants the pursuit of an agreement as described in 7-41(2) or (3). \n(2)  Upon determination that the granting of a development incentive for commercial development is advantageous to the\nCity and warranted pursuant to the considerations set forth herein, the business ownership shall enter into an agreement\nwith the City setting forth the terms and conditions by which the development incentive will be allowed.  Such agreement\nshall be approved by a majority of a quorum at a public meeting of the City Council.   \n(3)  Upon determination that the granting of a development incentive for deed- restricted workforce housing development\nis advantageous to the City and warranted pursuant to the considerations set forth herein, the property ownership shall\nexecute a deed restriction or other affordability mechanism deemed appropriate by the City Attorney to be recorded prior\nto final payment of the incentive. If the incentive exceeds $50,000, the property owner or business owner shall enter into\nan agreement with the City setting forth the terms and conditions by which the development incentive will be allowed.\n Such agreement shall be approved by a majority of a quorum at a public meeting of the City Council.  (Ord. 3043, Article 6\nRepealed and Reenacted, eff. 7/15/22)\nARTICLE 7. LODGING TAX    (Ord. 3072, Art. 7, repealed  and re-enacted, eff. 4/28/23)\nSection 7-42.  Lodging Tax Imposed on Transaction of Furnishing Rooms or\nAccommodations/Exceptions.   \n     \n1. Imposition. Pursuant to the approval of the eligible registered electors in the City of Trinidad at the election held on\nNovember 6, 2001, there is hereby imposed and levied and shall be collected a 3% lodging tax on the purchase price paid\nor charged to persons for the transaction of furnishing rooms or accommodations by any person, partnership, association,\ncorporation, estate, receiver, trustee, assignee, lessee, or person acting in a representative capacity or any other\ncombination of individuals by whatever name known to a person who for consideration uses, possesses, or has the right to\nuse or possess any room in a hotel, apartment hotel, lodging house, motor hotel, guesthouse, guest ranch, trailer coach,\nmobile home, auto camp, or trailer court and park, under any concession, permit, right of access, license to use, or other\nagreement, or otherwise. The tax authorized hereby shall not be imposed upon food, service, beverages, telephone, laundry\nor like services incidental to the furnishing of lodging or shelter and for which a separate charge is customarily made.\n2. Exceptions.\n(a) The tax imposed in this article shall not apply to the following individuals or entities and under the following specific\ncircumstances:\n(1) If a purchaser is a resident of the taxable premises for a period of at least thirty (30) consecutive days;\n(2) If the purchaser enters into or has entered into a written agreement for lodging at the taxable premises for a\nperiod of at least thirty (30) consecutive days; or\n(3) If the purchaser is an agency, subdivision or department of the federal government or the government of the state\nor one of its political subdivisions and is purchasing lodging in a governmental capacity or in direct pursuit of its\ngovernmental functions and activities.\n(b) The tax imposed by this article shall also be specifically inapplicable to vendors which qualify as clinics, hospitals, other\nmedical facilities, privately owned and operated convalescent homes for the aged, infirm, indigent or chronically ill. \nSection 7-43.  Point of Imposition.   \n \n   For the purpose of the lodging tax imposed by this Ordinance, all sales are consummated at the place where the actual\nrooms or accommodations, which are provided, are located. \nSection 7-44.  Administration.   \n  \n1. The City lodging tax shall be collected, administered, and enforced, to the extent feasible, pursuant to Section 29-2-106,\nC.R.S., as amended.\n2. The Finance Department is given responsibility for administration and implementation of this Article under the\ndirection of the City Manager.\n3. Administration of Article. In order to effectuate the purposes of this Article, the Finance Director, under the direction of\nthe City Manager, shall prescribe necessary forms for the making of returns, for the ascertainment, assessment and\ncollection of the taxes imposed and for the proper administration and enforcement thereof and to permit uniform methods\nof adding the tax or the average equivalent thereof to the purchase price. For the purpose of ascertaining the correctness of\nany return or for the purpose of making an estimate of the tax due from any taxpayer, the Finance Director shall have the\npower to examine or cause to be examined any books, papers, records or memoranda bearing upon the matters required to\nbe included in the return. \n4. Books and records required of taxpayer.\n(a) Taxpayer's retention of records. It shall be the duty of every person liable to the City for any tax imposed under\nthis Article to keep and preserve for a minimum of three (3) years such books, accounts and records as may be\nnecessary to determine the amount of such tax liability.\n(b) Availability of records to Finance Director. All such books, accounts and records shall be open for examination at\nany time by the Finance Director. If such person keeps or maintains such person’s books, accounts and other records\nor any portion thereof outside the state, upon demand by the Finance Director, such person shall make such\navailable at a suitable place within the state, to be designated by the Finance Director, for examination, inspection\nand audit by the Finance Director. The Finance Director, in the discretion of the Finance Director, may make, permit\nor cause to be made the examination, inspection or audit of books, accounts and other records so kept or maintained\nby such person outside the state at the place where such are kept or maintained or at any place outside the state\nwhere such will be made available, provided that such person shall have entered into a binding agreement with the\nCity to reimburse the City for all costs and expenses incurred by the City in order to have such examination,\ninspection or audit made in such place.\n(c) Subpoena to secure records. If any taxpayer shall refuse voluntarily to furnish any of the information required in\nParagraph 3(2) of this Section, when requested by the Finance Director, the Finance Director, by subpoena issued\nunder the Finance Director's hand, may require the attendance of the taxpayer and the production by the taxpayer of\nany such information in the taxpayer's possession and may administer an oath to the taxpayer and take the\ntaxpayer's testimony. If the taxpayer fails or refuses to respond to the subpoena and give testimony or produce any\ndocuments or information as directed in the subpoena, the Finance Director may apply to a judge of the Municipal\nCourt for a citation against such taxpayer for contempt, and the judge may cause arrest of such person; and upon\nhearing, the judge shall have, for the purpose of enforcing obedience to the requirements of the subpoena, power to\nmake such order as, in the judge's discretion, the judge deems consistent with the law for punishment of contempt.\n(d) Subpoena to secure evidence. If the Finance Director is unable to secure from the taxpayer information relating\nto the correctness of the taxpayer's return or the amount of the income of the taxpayer, the Finance Director may\napply to a judge of the Municipal Court for the issuance of subpoenas to such other persons as the Finance Director\nbelieves may have knowledge in the premises, and upon making a showing satisfactory to the court that the taxpayer\ncannot be found or evades service of subpoena or fails or refuses to produce records or give testimony, the judge shall\nhave power to cause the issuance of subpoenas under the seal of the court to the person sought to be so summoned,\nrequiring them or any of them to appear before the Finance Director and give testimony relating to the taxpayer's\nreturn or income. In case any of such persons so served with subpoena shall fail to respond thereto, the judge may\nproceed against such persons as in cases of contempt.\n5. Preservation of tax reports and returns.\n(a) City's preservation of records. All reports and returns of taxes received by the Finance Department covered by\nthis Article shall be preserved for three (3) years and thereafter until the Finance Director orders them to be\ndestroyed.\n(b) Confidential nature of returns. Except in accordance with judicial order or as otherwise provided by law, the\nFinance Director shall not divulge or make known in any way any information disclosed in any document, report or\nreturn filed in connection with any of the taxes covered by this Article. The officials charged with the custody of such\ndocuments, reports and returns shall not be required to produce any of them or evidence of anything contained in\nthem in any action or proceeding in any court, except on behalf of the Finance Director in an action or proceeding\nunder the provisions of any such taxing statutes when the report of facts shown thereby are directly involved in such\naction or proceeding, in either of which events the court may require the production of and may admit in evidence so\nmuch of such reports or of the facts shown thereby as are pertinent to the action or proceeding and no more.\n(c) Taxpayer records. Nothing in this Section shall be construed to prohibit the delivery to a person or a person's duly\nauthorized representative of a copy of any return or report filed in connection with such person's tax, and such copies\nmay be certified by the Finance Director and when so certified shall be evidence equally with and in like manner as\nthe originals and may be received by the courts of this state as evidence of the contents.\n(d) Publication of statistics; returns available to City Attorney. Nothing in this Section shall be construed to prohibit\nthe publication of statistics so classified as to prevent the identification of particular reports or returns and the items\nthereof or the inspection of returns by the City Attorney or other legal representatives of the City.\n(e) Records available to authorized parties. Notwithstanding the provisions of this Section, the Finance Director, in\nthe discretion of the Finance Director, may furnish to the taxing officials of any other state and its political\nsubdivisions and to the United States any information contained in tax returns and related schedules and documents\nfiled pursuant to this Article or in the report of an audit or investigation made with respect thereto, provided that\nsuch jurisdiction enters into an agreement with the Finance Director to grant similar privileges to the City and,\nprovided further, that such information is to be used only for tax purposes.\n6. Employees' restrictions. It shall be unlawful for any officer or employee of the City engaged in any administration which\nis governed by this Article to engage in the business or profession of tax accounting or to accept employment, with or\nwithout consideration, from any person holding a City business license for the purpose, directly or indirectly, of preparing\ntax returns or reports required by the laws of the City, by the state, by any other state or by the United States government\nor to accept any employment for the purpose of advising, preparing materials or data or the auditing of books or records to\nbe used in an effort to defeat or cancel any tax or part thereof that has been assessed by any city of the state, by the state,\nany other state or its political subdivisions or by the United States government. (Ord. 3072, Sec. 7-42, repealed  and re-\nenacted, eff. 4/28/23)\n  \nSection 7-45.  Persons Liable/Remittance of Tax.   \n \nAs defined in this article, all vendors providing lodging are required to act as trustees and collect taxes on behalf of the\nCity. The tax should be collected from purchasers in accordance with this article and must be remitted to the City on a\nquarterly basis by the 20th of each month following the close of the quarter unless the 20th falls on a holiday or weekend,\nthen it is due the following business day. Any remittance that is received by the City after the deadlines listed herein will be\nsubject to a five percent (5%) late fee. Along with the remittance, vendors must submit a quarterly report in the forms\nprovided by the Finance Director. \nSection 7-46.  City Lodging Tax Fund.   \n \n1. All revenues derived from the lodging tax, less costs of collection and administration, shall be placed in a special fund,\nseparate and distinct from the general fund. All interest derived from the investment of revenues within such special fund\nshall also be deposited for the benefit of the special fund.\n2. The funds derived from the imposition of tax hereby authorized shall be expended for the following purposes:\n(a) Thirty-five (35) percent for sustainable tourism marketing, including advertising and attracting conferences,\nconventions, capital expenditures, and meetings;\n(b) Twenty (20) percent for personnel and expenses related to tourism including, but not limited to, the welcome\ncenter and a Convention and Visitors Bureau;\n(c) Thirty (30) percent for maintenance, improvement, and development of quality of life facilities and programs;\n(d) Ten (10) percent to support art and cultural events, programs, and facilities; and\n(e) Five (5) percent for any of the above purposes or other purposes related to the impacts of tourism as the City\nCouncil may determine.\n(f) Any money left unspent following inclusion in an annual budget shall be held in reserves and allocated according\nto the provisions above for the following fiscal year.\n(g) The approved budget for the fiscal year beginning January 1, 2023, and ending on December 31, 2023, shall be\nmaintained as adopted by the City Council; however, it may be spent for any of the above purposes subject to City\nCouncil approval.\n3. All expenditures of lodging tax revenues shall be in accordance with budgetary limitations and specific proposals\nsubmitted to and approved by the City Council, as the same may occur from time to time. Approval of fund expenditures\nshall be accomplished through the adoption of the annual budget or by the adoption of a resolution or resolutions by the\nCity Council detailing the purpose and extent of such expenditures.\n4. There shall be budgeted from the monies received from the imposition of lodging tax an amount equal to two (2)\npercent thereof to reimburse the City for administrative and clerical expenses incurred in the administration and\ncollection of the tax authorized in this article. \nSection 7-47.  Lodging Tax Advisory Board.   \n1. There is established a Lodging Tax Advisory Board consisting of five (5) members who shall study, investigate, and\nadvise the City Council as to the development and promulgation of policies for the implementation, support and use of\nrevenues as defined in Section 7-46. The Board may also advise on other policy-related matters related to tourism as\nrequested from time to time by the City Council.\n2. Members of the Lodging Tax Advisory Board shall be appointed in accordance with Section 8.3 of the City’s Charter;\nhowever, preference shall be given to those individuals with experience in a tourism-related industry.\n3. Terms of Office/Removal.\n(a) The terms of appointment for the members of the Board shall be staggered for overlapping terms of three years.\n(b) Any member may be removed at any time by the Mayor, with the approval of the majority of the members of the\nCity Council. Any member may be automatically removed for failure to attend 75% of the regular meetings in a\nconsecutive 12-month period.\n4. At its first meeting each year, the Board shall elect a chairperson, vice chairperson and secretary from among its\nmembers, each of whose term shall be for one (1) year, with eligibility for reelection. The Board shall meet as necessary. It\nshall adopt such bylaws, rules and regulations governing its procedures as it may consider necessary or advisable, and\nshall keep a record of its proceedings, which record shall be a public record. A quorum shall consist of a majority of the\nvoting members.\n5. All members of the Lodging Tax Advisory Board shall adhere to the provisions of Section 2-71.1 – Rules of Ethics – of\nthe Trinidad Municipal Code. \nARTICLE 8. PURCHASES.    \nSection 7-50   Small purchases.   \n  \nThe Purchasing Agent shall establish written procedures for purchase of goods and securing of a Professional Services\nAgreement involving the estimated expenditure of $1,000.00 or more, but less than $50,000.00, in aggregate, of public\nmoney. These procedures shall require that competition be sought and written records adequate to document the\ncompetition be maintained in order to properly account for the funds expended, and to facilitate an audit of the small\npurchases made.   However, should an opportunity to purchase a good at a less-than market-value price present itself, that\nrequires a timely response, the City Manager may waive the requirement to obtain additional quotes.  With respect to\nprofessional services, qualification-based selection (QBS) will be used. (Ord. 3089, Sec. 7-50, amended, eff. 1/26/24)\nSection 7-51   Purchases based on informal bids.   \n     \nAll contracts for the purchase of goods and securing of a Professional Services Agreement involving the estimated\nexpenditure of $50,000.00 or more, but less than $100,000.00, in aggregate, of public money, shall be made after\ninformal bids and/or use of State Award pricing and other various purchasing organizations, such as NJPA pricings, are\nobtained. All such contracts shall be in writing and shall be awarded to the lowest responsible bidder, upon authorization\nof the City Manager. The quality and performance of the good(s) offered by each bidder, and the time specified for delivery\nof the good shall be considered in determining the lowest responsible bid. The Department Head and/or the Purchasing\nAgent shall keep a record of all bids submitted and the record shall be available for public inspection after the contract is\nawarded, in the manner provided by law.  However, should an opportunity to purchase a good at a less-than market-value\nprice present itself, that requires a timely response, the City Manager may waive the requirement to obtain additional\ninformal bids.  With respect to professional services, qualification-based selection (QBS) will be used. (Ord. 3089, Sec. 7-\n51, amended, eff. 1/26/24)\nSection 7-52   Purchases based on formal bids.   \n \n   \nExcept as otherwise provided in this Article, no contract for the purchase of goods or securing of a Professional Services\nAgreement involving the estimated expenditure of $100,000.00 or more, in aggregate, of public money shall be awarded\nunless the provisions of this Section are followed, or unless available through State Award or other purchasing\norganizations the City has affiliated with.   (Ord. 3089, Sec. 7-52, amended, eff. 1/26/24)\n(1)  Proposals shall be invited by advertisement in a newspaper having general circulation in the City.  The advertisement\nshall state the time and place where specifications may be obtained, and the time and place for the opening of bids.  At\nleast seven (7) full days must pass between the day the advertisement appears and the day of the bid opening.  The\nadvertisement shall state that the City reserves the right to reject any or all of the bids. (Ord. 1684, eff., 3-29-02)\n(2) The City may require that bid deposits be submitted with each bid.  If bid deposits are required, they shall be in an\namount equal to five percent (5%) of the amount of the bid and may be submitted in the form of cash, a cashier’s check, a\ncertified check issued by a bank or trust company insured by the Federal Deposit Insurance Corporation, a bid bond, or\nany other form of bid security deemed sufficient by the City Attorney.  The bid deposit requirement, including the form in\nwhich bonds or other forms of bid security may be submitted, shall be included in the specifications. (Ord. 1684, eff., 3-29-\n02)\n(3) Bids shall be sealed.  All bids shall be opened in public and the Purchasing Agent or Department Head shall make a\nrecord of the bids received.  The record and the bids received shall be subject to public inspection after the bid opening in\nthe manner prescribed by law. (Ord. 1684, eff., 3-29-02)\n(4) The City may require the successful bidder to furnish a performance bond to secure the faithful performance of all of\nthe terms of the contract.  The performance bond shall be in a form approved by the City Attorney and the form of the\nbond shall be included in the specifications. The City Council may reject the bond of any bidder if it finds it to be\nunacceptable. (Ord. 1684, eff., 3-29-02)\n(5) All contracts to which this Section applies shall be in writing and shall be approved by the City Council.  The City\nCouncil may reject any and all bids. (Ord. 1684, eff., 3-29-02)\nSection 7-53   Exceptions.   \n \n(1) The provisions of this Article do not apply to the purchase of goods or services when:\n(a) the purchase or service is available from one source or when standardization or compatibility is the overriding\nconsideration.\n(2) All such purchases of $100,000.00 or more shall be approved by the City Council. (Ord. 3089, Sec. 7-53, amended, eff.\n1/26/24)\nARTICLE 9.  MARIJUANA SALES TAX       \nSection 7-54.  Purpose.\n    The purpose of this Article is to impose a separate and additional sales tax on the lawful retail sale of marijuana,\nmarijuana products and marijuana accessories within the City.    \nSection 7-55.  Definitions.    \n     For purposes of this Article, the following words shall have the following meanings:   \n \n     (a)       “Consumer” shall have the meaning attributed to it in section (2)(b) of Section 16 of Article XVIII of the\nColorado Constitution;               \n     (b)       “Lawful retail sale of marijuana, marijuana products and marijuana accessories” shall mean the sale of\nmarijuana, marijuana products and marijuana accessories by a licensed retail marijuana store to a consumer in\ncompliance with Section 16 of Article XVIII of the Colorado Constitution and § 12-43.4-101   , et seq.   , C.R.S.;     \n     (c)       “Marijuana” shall have the meaning attributed to it in section (2)(f) of Section 16 of Article XVIII of the\nColorado Constitution;     \n     (d)       “Marijuana Accessories” shall have the meaning attributed to it in section (2)(g) of Section 16 of Article\nXVIII of the Colorado Constitution;     \n     (e)       “Marijuana Establishment” shall have the meaning attributed to it in section 2(i) of Section 16 of Article\nXVIII of the Colorado Constitution;     \n     (f)        “Marijuana Products” shall have the meaning attributed to it in section (2)(k) of Section 16 of Article XVIII\nof the Colorado Constitution; and     \n     (g)       “Retail marijuana store” shall have the meaning attributed to it in section (2)(n) of Section 16 of Article\nXVIII of the Colorado Constitution. (Ord 1998, Sec. 7-55 corrected, eff. 3-1-16)     \nSection 7-56.  Tax Imposed.  \n \n          (a)       A tax is levied and shall be collected upon the lawful retail sale of marijuana, marijuana products and\nmarijuana accessories within the City at a rate of five percent (5%) of the price paid by the consumer thereof rounded\noff to the nearest penny.  \n  \n     (b)       The sales tax imposed by this section shall be in addition to and not in lieu of the sales tax imposed on the\nretail sale of tangible personal property pursuant to Article 2 of this Chapter.     \nSection 7-57.  Collections, administration and enforcement.  \n \n     The collection, administration and enforcement of the sales tax imposed by this Article shall be performed by the City of\nTrinidad Director of Finance in a manner similar to the collection, administration and enforcement of the state-collected\nCity sales tax as provided in Article 26 of Title 39 of the Colorado Revised Statutes.\n \nARTICLE 10.  RESPONSIBLE FINANCIAL MANAGEMENT.   \nSection 7-60.  Responsible Financial Management Funding.   \n \n  Within the General Fund, Water/Sewer Fund, Gas Fund and Power and Light Fund, there is hereby established the\nfollowing special revenue funds:  \n  Contingency Fund – for emergencies, unforeseen events, opportunities and other occurrences outside of the\nplanned fiscal year operating budget.  \n   \n   The Contingency Fund shall be equal to 5% of the budget for each fund, excluding non-operating items such as\ncapital project transfers and debt service payments or shall be funded annually as determined by the City Council in\nadoption of the annual budget.   \n   \n   Repair and Replacement Fund – for the repair and replacement of fleet and capital infrastructure items.\n  \na.    Infrastructure and Buildings   \nb.    Fleet and Rolling Stock \n   The funding for this fund will be determined annually based upon priorities and fleet management.   \n     \n   Information Technology (IT) Equipment Fund – for the repair or replacement of IT equipment.   \n     \n   The funding for this fund will be determined annually based upon priorities and needs.   \n   \n  Within the General Fund there is hereby established the following special revenue fund:  \n   Economic Development Reserve Fund – for support of economic development activities in Trinidad.  The Economic\nDevelopment Reserve Fund shall be funded annually as determined by the City Council in adoption of the annual budget.\n(Ord. 2032, Art. 10 amended, eff. 6/16/17)\n"
}