{
    "chapter": "Chapter 6 - Elections",
    "content": "Chapter 6 - Elections\nSections :\n6-1                   Nominating petition requirements; qualifications of candidates; conduct of elections.\n6-2                   Vacancies in Council or Office of Mayor.\n6-3                   Write-in candidate affidavit.\nCHAPTER 6.  ELECTIONS.\nSection 6-1.    Nominating petition requirements; qualifications of candidates; conduct of elections.\n(1)  Any candidate seeking election to the office of Mayor or City Council Person, shall appear in person before the City\nClerk and sign an affidavit of intent to seek such office.  Upon receipt of such affidavit, the City Clerk shall provide the\nperson desiring to be a candidate a petition of nomination form.  Petition of nomination forms shall be issued only to those\npersons signing the affidavit of intent, and shall contain the name and address of the affiant and shall indicate the office to\nwhich he/she is seeking election.\n(2)  The requirements for write-in candidates shall be governed by Section 6-3 of this Code.\n(3)  All other procedures for nomination of candidates for City Council or Mayor, the conduct of all elections, qualifications\nof Council Persons, the Mayor and electors, and all other matters pertaining to municipal elections shall be governed by\nthe Charter of the City of Trinidad, the \"Uniform Election Code of 1992\" and the \"Colorado Municipal Election Code of\n1965.\"  (Ord. 1486, 09/20/94.)\nSection 6-2.    Vacancies in Council or Office of Mayor.\nThe City Council shall have the power, by appointment, to fill all vacancies in the City Council and Office of Mayor, and the\nperson so appointed shall hold office until the next regular election and until his/her successor is elected and qualified.  If\nthe term of the person creating the vacancy extends beyond the next regular election, the person elected to fill the vacancy\nshall be elected for the unexpired term.\nSection 6-3.    Write-in candidate affidavit.\nNo write-in vote for any office in a regular or City Council vacancy election shall be counted unless an affidavit of intent\nhas been filed indicating that the person desires the office and is qualified to assume the duties of that office if elected.\n Such affidavit of intent shall be filed with the City Clerk prior to five days before the regular or City Council vacancy\nelection.  (Ord. 1370, 02/20/90.)\n\n"
}