{
    "chapter": "Chapter 16 - Public Peace, Morals and Welfare",
    "content": "Chapter 16 - Public Peace, Morals and Welfare\nARTICLE 1.  OFFENSES AGAINST PUBLIC PEACE.\nSections:\n16-1                       Disturbing the public peace.\n16-2                       Unlawful assembly.\n16-3                       Disturbing religious assembly.\n16-4                       Disturbing lawful assembly.\n16-5                       Loitering - Police order to disperse.\n16-6                       Schools, loitering about, disturbing, annoying or molesting students.\n16-7                       False impersonation of an officer.\n16-8                       Resisting and obstructing police officers.\n16-9                       Assisting prisoners to escape.\n16-10                     Quarreling and fighting.\n16-11                     Noises - Scope of prohibition.\n16-12                     Exceptions from provisions.\n16-13                     Throwing stones.\n16-14                     Participating in or inciting a riot or disturbance.\nARTICLE 2.  OFFENSES AGAINST PROPERTY.\n16-15                     Injuring, defacing or destroying publicly-owned property.\n16-16                     Injuring, defacing or destroying private property.\n16-16.1                  Graffiti\n16-17                     Trespassing upon publicly or privately owned property.\n16-17.1                  Theft.\n16-18                     Loitering about railroad yards; exception.\n16-19                     Peddlers going upon premises uninvited.\n16-20                     Abatement of nuisance by police.\n16-21                     Possession of license no bar to prosecution.\nARTICLE 3.  OFFENSES AGAINST PUBLIC SAFETY.\n16-22                     Carrying concealed weapons.\n16-23                     Discharging firearms.\n16-24                     False fire alarm.\nARTICLE 4.  OFFENSES INVOLVING MINORS.\n16-25                     Loitering defined.\n16-26                     Loitering after curfew.\n16-27                     Responsibility of parents; penalty for violation.\n16-28                     Furnishing tobacco to minor under age 16.\n16-28.1                  Minors in possession.\n16-29                     Abandoned refrigerators; removal of locks.\nARTICLE 5.  OFFENSES AGAINST MORALS.\n16-30                     Common gambler defined.\n16-31                     Permitting gambling in premises.\n16-32                     Playing games for money.\n16-33                     Gambling with intoxicated persons or minors.\n16-34                     Indecent exposure.\n16-35                     Urinating in public.\n16-36                     Allowing prostitution on premises.\n\n16-37                     Prostitution - Plying vocation.\n16-38                     Prostitution prohibited; cohabitation with prostitute.\n16-39                     Enticing to house of ill repute.\n16-40                     Keeping of disorderly house.\nARTICLE 6.  OFFENSES AGAINST PUBLIC HEALTH.\nDIVISION 1.  GENERAL PROVISIONS.\n16-41                     Poison to be labeled.\n16-42                     Tainted provisions not to be sold.\n16-43                     Unwholesome provisions not to be sold.\n16-44                     Cleaning of cesspools, grease traps and privy vaults; when required.\n16-45                     Discontinuance of cesspools, grease traps and privy vaults; filling.\n16-46                     Removal of contents of cesspools, grease traps and privy vaults.\n16-47                     Substances of abuse.\nDIVISION 2.  SMOKING IN PUBLIC PLACES AND PLACES OF EMPLOYMENT.\n16-48                     Legislative intent.\n16-49                     Repealed.\n16-50                     Repealed.\n16-51                     Repealed.\n16-52                     Repealed.\n16-53                     Repealed.\n16-54                     Repealed.\n16-55                     Repealed.\nARTICLE 7.  NUISANCES.\n16-56                     Discharging foul substances into street.\n16-57                     Accumulating offensive substances.\n16-58                     Offensive cellars; sewers.\n16-59                     Accumulation of junk.\n16-60                     Exclusion from provisions.\n16-61                     Barbed wire and other obstructions into thoroughfares.\n16-62                     Placing obstructions on public right-of-way.\n16-63                     Dangerous or hazardous conditions.\n16-63.5                  Broken windows\n16-64                     Notice to abate nuisance.\n16-65                     Assessment of costs and collection of assessments.\n16-66                     General notice to clean up.\n16-67                     Summary abatement of nuisances.\nARTICLE 8. PENALTIES\n16-68                     Penalty for violations by minors.\nCHAPTER 16.  PUBLIC PEACE MORALS AND WELFARE.\nARTICLE 1.  OFFENSES AGAINST PUBLIC PEACE\nSection 16-1.        Disturbing the public peace.\nIt shall be unlawful for any person intentionally, knowingly, or recklessly to:\n(1)  Make unreasonable noise in a public place or near a private residence that he/she has no right to occupy; or\n(2)  Repeatedly insult, taunt or challenge another person in a manner likely to provoke a violent or disorderly response; or\n(3)  Not being a peace officer, display a deadly weapon in a public place in a manner calculated to alarm; or\n(4)  In a public place, threaten to assault in any manner another person; or\n(5)  Strike, shove, kick or otherwise subject any person to unwanted physical contact.\nSection 16-2.        Unlawful assembly.\nIt shall be unlawful for any two (2) or more persons to assemble together with an intent to do any unlawful act, or being so\nassembled, to mutually agree to do any unlawful act with force or violence against the property of the City, or the person or\nproperty of another, or against the peace or to the terror of others; or make any movement or preparation therefor; and\nevery person present at such an assembly who shall not endeavor to prevent the commission or perpetration of such\nunlawful act, shall be deemed guilty of a misdemeanor.  (Code 1958, Sec. 17-53.)\nSection 16-3.        Disturbing religious assembly.\nIt shall be unlawful for any person to disturb or disquiet any congregation or assembly of persons met for or engaged in\nreligious worship by making any unreasonable loud and unnecessary noise, or by rude or indecent behavior, or discourse\nwithin their place of worship or so near it as to disturb the order and solemnity of the meeting.  (Code 1958, Sec. 17-20.)\nSection 16-4.        Disturbing lawful assembly.\nIt shall be unlawful for any person to obstruct or interfere significantly with any lawful meeting, assembly, procession or\ngathering by physical action, verbal utterance or any other means, with the intent to prevent or disrupt said meeting,\nassembly, procession or gathering.\nSection 16-5.        Loitering - Police order to disperse.\n(1)  It shall be unlawful for any person to loiter, loaf, wander, stand or remain idle either alone or in consort with others in\na public place in such manner so as to:\n(a)  Obstruct any public street, public highway, public sidewalk or any other public place or building by hindering or\nimpeding or tend to hinder           or impede the free and uninterrupted passage of vehicles, traffic or    pedestrians.\n(b)  Commit in or upon any public street, public highway, public sidewalk or any other public place or building any\nact or thing which is an obstruction or interference to the free and uninterrupted use of property or with any\nbusiness lawfully conducted by anyone in or upon or facing or fronting on any such public street, public highway,\npublic sidewalk or any other public place or building, all of which prevents the free and uninterrupted ingress,\negress, and regress, therein, thereon and thereto.\n(2)  Any person who causes or commits any of the conditions enumerated in Subsection (1) herein and who fails or refuses\nto stop causing or committing such conditions and to move on or disperse as directed by a police officer or any other lawful\nauthority shall be guilty of a violation of this Section.\nSection 16-6.        Schools, loitering about; disturbing, annoying or molesting students.\nIt shall be unlawful for any person, at any time, to loiter, idle, wander, stroll or play in or about any public, private or\nparochial school, college or seminary grounds or buildings, either on foot or in or on any vehicle, without having some\nlawful business therein or thereabout or in connection with such school or the employees thereof, or for any person to:\n(1)  Annoy, disturb or otherwise prevent the orderly conduct of classes and activities of any such school; or\n(2)  Annoy, disturb, assault or molest any student or employee of any such school or college while in any such school\nbuilding, school grounds; or\n(3)  Conduct himself/herself in a lewd, wanton or lascivious manner in speech or behavior in or about any such school\nbuilding or school grounds; or\n(4)  Park or move a vehicle at any time in the immediate vicinity of or on the grounds of any such school, college or\nseminary for the purpose of annoying or molesting the students or employees thereof or in an effort to induce, entice or\ninvite students into such vehicles for immoral purposes. (Code 1958, Sec.17-46.1.)\nSection 16-7.        False impersonation of an officer.\nIt shall be unlawful for any person to impersonate a policeman or any City, County, State or Federal officer by wearing a\nbadge or star, or by any acts or words which may lead others to believe that he/she is such officer when in fact he/she is\nnot such officer.  (Code 1958, Sec. 17-24.)\nState law references: As to penalty under State law, 1973, Sec. 29-5-102.\nSection 16-8.        Resisting and obstructing a police officer.\n(1)       (a)  It shall be unlawful for any person to resist arrest by a police officer of the City.  A person commits the crime of\nresisting arrest if he/she knowingly prevents or attempts to prevent a police officer acting under color of his/her official\nauthority from effecting an arrest of the actor or another by using or threatening to use physical force or violence against\nthe police officer or another, or using any other means which creates substantial risk of causing physical injury to the\npolice officer or another.\n(b)  It is no defense to a prosecution under this section that the police officer was attempting to make an arrest which in\nfact was unlawful, if he/she was acting under color of his/her official authority, and in attempting to make the arrest\nhe/she was not resorting to unreasonable or excessive force giving rise to the right of self-defense.  A police officer acts\n\"under color of his/her official authority\" when, in the regular course of assigned duties, he/she is called upon to make,\nand does make, a judgment in good faith based upon surrounding facts and circumstances that an arrest should be made\nby him/her.\n(c)  The term \"police officer\" as used in this section means a police officer, in uniform or, if out of uniform, one who has\nidentified himself/herself by exhibiting his/her credentials as such police officer to the person whose arrest is attempted.\n(2)       (a)  It is unlawful for a person to obstruct a police officer.  A person commits the crime of obstructing a police\nofficer, when, by using or threatening violence, force or physical interference, or an obstacle, he/she knowingly obstructs,\nimpairs or hinders the enforcement of the penal law or the preservation of the peace by a police officer acting under color\nof his/her official authority.\n(b)  It is no defense to a prosecution under this section that the police officer was acting in an illegal manner, if he/she was\nacting under color of his/her official authority as defined in subsection (1)(b).\nSection 16-9.        Assisting prisoners to escape.\nIt shall be unlawful for any person to aid or assist any person in custody of a police officer, to escape from such custody or\nsuch confinement.\nSection 16-10.      Quarreling and fighting.\nIt shall be unlawful for any person to fight with another upon public property or upon private property which is open to\nview from any other place within the City or in the presence of persons not engaged in said fight.  It shall not be unlawful\nto engage in a fight which is a contest of amateur or professional athletic skill.\nSection 16-11.      Noises - Scope of prohibition.\n(1)  Subject to the provisions of this Section, the creation of any unreasonably loud, disturbing and unnecessary noises at\nany time is prohibited.  Noises of such character and of such intensity and duration as to be detrimental to the public\nhealth and welfare is prohibited.  Noises which unreasonably interfere with the sleep, comfort and repose of any individual\nare prohibited.\n(2)  The following acts are declared to be a violation of this Section; the enumeration shall not be deemed to be exclusive or\nin any way limited by the generality of Subsection (1):\n(a)  The keeping in any building or upon any premises of any animal or bird which by frequent or long continued\nnoise shall disturb the comfort and repose of any person in the vicinity.\n(b)  The use of any automobile, motorcycle, streetcar or vehicle so out of repair, so loaded or in such a manner as to\ncreate loud and unnecessary grating, grinding, rattling or other noise.\n(c)  The sounding of any horn or signaling device on any automobile, motorcycle, streetcar or other vehicle on any\nstreet or public place except as a danger warning; the creation by means of any such signaling device of any\nunreasonably loud or harsh sound; and the sounding of any such device for an unnecessary and unreasonable period\nof time.\n(d)  The playing of any radio, phonograph or any musical instrument in any place at any time in such manner or with\nsuch volume as to annoy or disturb any person thereby.\n(e)  The creation of any excessive noise on any street adjacent to any public or parochial school, college, or institution\nof learning while it is in session, which unreasonably interferes with the work of pupils or instructors; provided,\nconspicuous signs are displayed on such street indicating, in substance, that it is a school street and that quiet is\nrequired.\n(f)  The creation of loud and excessive noise in connection with loading or unloading any vehicle or the opening and\ndestruction of bales, boxes, crates and containers.\n(g)  The playing of any game not for public exhibition, which results in the creation of any noise or disturbance that\nin any manner unreasonably interferes with the health, comfort or repose of any inhabitants of the City.  (Ord. 2084,\nSec. 16-11, amended, eff. 9/27/19.)\nSection 16-12.      Exceptions from provisions.\n(1)  Nothing contained in Section 16-11 shall be construed to prevent the production of music with any military, civic, or\nauthorized parade, funeral procession or religious ceremony, or any musical performance conducted with the consent of\nmunicipal authority, or to prevent public exhibitions of sports or other events.\n(2)  The provisions of Section 16-11 shall not apply to police officers or firemen in the discharge of their official duties.\n (Code 1958, Sec. 16-14.)\nSection 16-13.      Throwing stones.\nIt shall be unlawful for any person to throw any stone or other missile at or upon any building, tree or other public or\nprivate property, or at any person.  (Code 1958, Sec. 17- 50.)\nSection 16-14.      Participating in or inciting a riot or disturbance.\nIt is unlawful for any person who collects or assembles in crowds and bodies to become involved in or incite or attempt to\nincite a riot or public disturbance.\nARTICLE 2.  OFFENSES AGAINST PROPERTY.\nDivision 1.  General Provisions.\nSection 16-15.      Injuring, defacing, or destroying publicly-owned property.\nIt is unlawful for any person to knowingly injure, deface or destroy any real property or improvements thereon, or movable\nor personal property owned by the City or any other public entity. (Ord. 1499, 3/3/95.)\nSection 16-16.      Injuring, defacing or destroying private property.\nIt is unlawful for any person to knowingly injure, deface or destroy the real or personal property belonging to any person\nor other private entity.  (Ord. 1499, 3/3/95.)\nSection 16-16.1    GRAFFITI\n(1) Definitions: for purposes of Sections 16-16.1.: (Ord. 1756, eff., 7-16-04)\n(a) “Graffiti” means the defacing of public or private property without the consent of the property owner by means of\nany method of defacement, including but not limited to painting, drawing, writing, etching, carving or otherwise\nmarring the surface of the property by use of paint, spray paint, ink or any other substance or object. (Ord. 1756, eff.,\n7-16-04)\n(b) “Prohibited graffiti material” means and includes spray paint, spray paint nozzles, glass cutting tools and glass\netching tools or instruments. (Ord. 1756, eff., 7-16-04)\n(c) “Spray paint” means any aerosol container that is made or adapted for the purpose of applying paint or other\nsubstance capable of defacing property. (Ord. 1756, eff., 7-16-04)\n(d) “Spray paint nozzle” means a nozzle designed to deliver a spray of paint of a particular width or flow from a can of\nspray paint. (Ord. 1756, eff., 7-16-04)\n(2) Application of Graffiti. (Ord. 1756, eff., 7-16-04)\n(a) It is unlawful for any person to deface public or private property with graffiti. (Ord. 1756, eff., 7-16-04)\n(b) The City may order the occupant or owner of any property on which graffiti is found to remove the graffiti, at the\noccupant or owner’s sole expense, within twenty-four (24) hours, or such additional time as determined by the City.\n It is unlawful for any occupant or owner of property on which graffiti is found to fail to remove or cause to be\nremoved graffiti as directed by the City. (Ord. 1756, eff., 7-16-04)\n(c) Upon conviction of a violation of this Section, in addition to any other penalty allowed by law, the Municipal\nCourt may order the defendant to personally make repairs to the damaged property, or may enter an order\nauthorizing the City to enter upon the property and remove the graffiti, assessing the cost of removal against the\ndefendant. (Ord. 1756, eff., 7-16-04)\n(3)   Sale and Possession of prohibited graffiti materials. (Ord. 1756, eff., 7-16-04)\n(a) Possession. It is unlawful for any minor, except under the direct supervision of such minor’s parent, legal\nguardian, school teacher, tutor, counselor, art instructor or a law enforcement officer, to purchase, obtain, possess or\nattempt to purchase, obtain or possess any prohibited graffiti materials. (Ord. 1756, eff., 7-16-04)\n(b) Contributing to unlawful possession.  It is unlawful for any person, except a law enforcement officer in the\nperformance of official duty, to knowingly allow a minor to possess prohibited graffiti materials upon any real\nproperty unaccompanied by such minor’s parent, legal guardian, school teacher, tutor, counselor, art instructor or\nlaw enforcement officer. (Ord. 1756, eff., 7-16-04)\n(c) It is unlawful for any person, other than a parent or legal guardian, school teacher, tutor, counselor, art instructor\nor law enforcement officer, to sell, exchange, give, deliver, loan or otherwise furnish or cause or permit to be sold,\nexchanged, delivered, loaned or otherwise furnished any prohibited graffiti material to any minor unless the minor is\naccompanied by his or her parent, legal guardian, school teacher, tutor, counselor, art instructor or a law\nenforcement officer. (Ord. 1756, eff., 7-16-04)\n(4) Signs Required.  It is unlawful for any person who sells or offers for sale any prohibited graffiti material to fail to\ndisplay a warning sign in a prominent place in the building at all times.  Such warning sign shall have a minimum height of\nfourteen inches and a minimum width of eleven inches, shall use capital lettering of at least one-half of one inch in height,\nand shall read as follows: (Ord. 1756, eff., 7-16-04)\nWARNING: IT IS ILLEGAL FOR ANY PERSON UNDER EIGHTEEN YEARS OF AGE TO PURCHASE OR POSSESS ANY\nSPRAY PAINT, SPRAY PAINT NOZZLE, GLASS CUTTING TOOL OR GLASS ETCHING TOOL OR INSTRUMENT,\nUNLESS ACCOMPANIED BY HIS OR HER PARENT,\nLEGAL GUARDIAN, SCHOOL TEACHER, TUTOR, COUNSELOR, ART INSTRUCTOR OR A LAW ENFORCEMENT\nOFFICER, AND UPON CONVICTION, A FINE OF UP TO $300.00 MAY BE IMPOSED.\n(5) Affirmative Defenses. (Ord. 1756, eff., 7-16-04)\nIt shall be an affirmative defense to an alleged violation of Subsections 3(A) or (B) hereof that the minor possessing the\nprohibited graffiti materials was: (Ord. 1756, eff., 7-16-04)\n(a) Within his or her residence; (Ord. 1756, eff., 7-16-04)\n(b) At his or her place of employment; or (Ord. 1756, eff., 7-16-04)\n(c) Upon real property with permission from the owner, occupant or person having lawful control of such property to\npossess such materials. (Ord. 1756, eff., 7-16-04)\nIt shall be an affirmative defense to an alleged violation of Section 3(C) hereof that the person charged in an\nemployer and; (Ord. 1756, eff., 7-16-04)\n(a) Has adopted and enforces a written policy against selling prohibited graffiti materials to minors; (Ord. 1756, eff.,\n7-16-04)\n(b) Requires employees to verify the age of purchasers of prohibited graffiti materials by way of photo identification;\nand (Ord. 1756, eff., 7-16-04)\n(c) Has established and imposes sanctions for noncompliance. (Ord. 1756, eff., 7-16-04)\nAny person convicted of a violation of this Section shall be punished by a fine not to exceed three hundred dollars.\n(Ord. 1756, eff., 7-16-04)\nSection 16-17.      Trespassing upon publicly or privately owned property.\n(1)  It shall be unlawful for any person to knowingly use, occupy, or remain on or in any publicly owned property, except\nduring those times in which such property is open to the public, unless permission has been granted by a person properly\nauthorized to do so.\n(2)  It shall be unlawful for any person to knowingly use, occupy, or remain on or in any privately owned property, real or\npersonal, without the permission of the owner or person entitled to possession thereof.\n(3)  Any person who violates this Section shall be subject to a fine not exceeding Three Hundred Dollars ($300.00).\nSection 16-17.1. Theft.\nIt shall be unlawful for any person to commit theft.\n(1) A person commits theft when he or she knowingly obtains or exercises control over anything of value of another\nwithout authorization or by threat or deception when such person:\n(a) Intends to deprive the other person permanently of the use or benefit of the thing of value;\n(b) Knowingly uses, conceals or abandons the thing of value in such manner as to deprive the other person\npermanently of its use or benefit:\n(c) Uses, conceals or abandons the thing of value, intending that such use, concealment or abandonment will deprive\nthe other person permanently of its use and benefit; or\n(d) Demands any consideration to which he or she is not legally entitled as a condition of restoring the thing of value\nto the other person.\n(2) If any person willfully conceals unpurchased goods, wares or merchandise owned or held by and offered or displayed\nfor sale by any store or other mercantile establishment, whether the concealment is on his or her own person or otherwise\nand whether on or off the premises of the store or mercantile establishment, such concealment constitutes prima facie\nevidence that the person intended to commit the crime of theft.\n(3) This Section shall not apply when the aggregate value of the property involved in any one criminal episode is valued at\n$750.00 or more.\n(4) Penalty for violation.\n(a) Any person who violates this Section shall be subject to a fine of no less than Fifty Dollars ($50.00) and no more than\nSeven Hundred Fifty Dollars ($750.00). (Ord. 3025, Sec. 16-17.1, enacted 9/17/21)\nSection 16-18.      Loitering about railroad yards; exception.\nIt shall be unlawful for any person not an employee of the railroad to loiter about cars, car yards, transfer grounds, or to\nenter in or upon any car, depot or freight house or to move any car door or sleep in any car, or disturb any car or other\nproperty belonging to the railroad company doing business in the City; provided, this Section shall not apply to persons\ndoing business with any such railroad.  (Code 1958, Sec. 17-36.)\nSection 16-19.      Peddlers going upon premises uninvited.\nIt shall be unlawful and a nuisance for any solicitor, peddler, hawker, itinerant merchant or transient vendor of\nmerchandise, not having been requested or invited to do so by the owner or occupant of a private residence to enter upon\nsuch private residence for the purpose of soliciting orders for the sale of goods, wares or merchandise or for the purpose of\nor peddling or hawking the same.  (Code 1958, Sec. 17-40.)\nSection 16-20.      Abatement of nuisance by police.\nThe Chief of Police and all police officers are required and directed to suppress and abate any such nuisance as is described\nin Section 16-19.  (Code 1958, Sec. 17-41.)\nSection 16-21.      Possession of license no bar to prosecution.\nThe possession of a license issued by the City Clerk under the provisions of any ordinance of the City shall constitute no\nbar to the prosecution authorized by Sections 16-19.  (Code 1958, Sec. 17-42.)\nARTICLE 3.  OFFENSES AGAINST PUBLIC SAFETY.\nSection 16-22.      Carrying concealed weapons.\n(1)  It shall be unlawful for any person to carry concealed upon or about his/her person any pistol, revolver, bowie-knife,\ndirk, razor, slung shot, sand-bag, brass-knuckles or other deadly weapon.\n(2)  This Section shall not apply to any sheriff, deputy sheriff, constable, policeman or other peace officer within his/her\nown territory and while on duty provided such officer shall have and produce on demand a certificate from the proper\nauthority showing he/she is an officer within this exception; or, in default thereof, may be punished to the same extent an\nin the same manner of other violators.  This Section shall also not apply to any person who has been issued a valid\nConcealed Weapon Permit anywhere in the State.\nState law reference: As to provisions pertaining to carrying on concealed weapons, see C.R.S.  Sec. 18-12-105.\nSection 16-23.      Discharging firearms.\nIt shall be unlawful for any person to discharge any cannon, gun, fowling piece, pistol or firearm of any description or\nother thing containing gun powder or other combustible or explosive material.  (Code 1958, Sec. 17-25.)\nSection 16-24.      False fire alarm.\n(1)  It shall be unlawful for any person willfully and intentionally to give or cause to be given a false alarm of fire.\n(2)  Any person who shall give or cause to be given a public alarm of fire unless he/she can show that he/she had good and\nsufficient reason for believing that there was, at the time of giving such alarm, a fire in progress threatening the\ndestruction of property in the City, shall be deemed guilty of giving a false fire alarm. (Code 1958, Sec. 17-23.)\nARTICLE 4.  OFFENSES INVOLVING MINORS.\nSection 16-25.      Loitering defined.\nLoitering or loiter shall mean remaining idle in essentially one location, to be dilatory, to tarry, to dawdle and shall include\nbut not be limited to standing around, hanging out, sitting, kneeling, sauntering or prowling.\nSection 16-26.      Loitering after curfew.\n(1)  It shall be unlawful for any person under the age of 18 years to loiter on or about any street, sidewalk, curb, gutter,\nparking lot, alley, vacant lot, playground, yard, public building, or place of amusement or entertainment, whether public or\nprivate, without the consent or permission of the owner or occupant thereof, during the hours between 10:30 p.m. and\n5:00 a.m., except that for the period beginning with Friday evening and ending Sunday morning, the hours in which this\nrestriction applies shall be between 12:00 midnight and 5:00 a.m., unless accompanied by a parent, guardian or other\nadult person having care and custody of the minor.\n(2)  Any person who violates this Section shall be subject to a fine not exceeding Three Hundred Dollars ($300.00).\nSection 16-27.      Responsibility of parents; penalty for violation.\n(1)  It shall be unlawful for any parent, guardian or other adult person having the care and custody of a minor to knowingly\npermit such minor to violate the provisions of Section 16-26.\n(2)  Any person who violates this Section shall be subject to a fine of not less than Ten Dollars ($10.00) or more than Three\nHundred Dollars ($300.00) and/or a jail sentence of not less than ten (10) days or more than thirty (30) days at the\ndiscretion of the Municipal Judge.\nSection 16-28.      Furnishing tobacco to minor under age 16.\nIt shall be unlawful for any person to sell, give or furnish any tobacco or article made in whole or part of tobacco, to any\nchild under sixteen (16) years of age, without the written order of the father, mother or guardian of such child.  (Code\n1958, Sec. 17-65.)\nSection 16-28.1.     Minors in possession.\n(1) Illegal possession or consumption of ethyl alcohol by underage person.\n(a) Any person under 21 years of age who possesses or consumes ethyl alcohol anywhere in the City commits illegal\npossession or consumption of ethyl alcohol by an underage person. Illegal possession or consumption of ethyl\nalcohol by an underage person is a strict liability offense.\n(b) It is an affirmative defense to the offense described in Subsection (a) above that the ethyl alcohol was possessed\nor consumed by a person under 21 years of age under the following circumstances:\n(i.) While such person was legally upon private property with the knowledge and consent of the owner or legal\npossessor of such private property and the ethyl alcohol was possessed or consumed with the consent of his or\nher parent or legal guardian who was present during such possession or consumption; or\n(ii.) When the existence of ethyl alcohol in a person's body was due solely to the ingestion of a confectionery\nwhich contained alcoholic beverages within the limits prescribed by Section 25-5-410(1)(i)(II), C.R.S., the\ningestion of any substance which was manufactured, designed or intended primarily for a purpose other than\noral human ingestion, or the ingestion of any substance which was manufactured, designed or intended solely\nfor medicinal or hygienic purposes or solely from the ingestion of a beverage which contained less than one-\nhalf of one percent of alcoholic beverages by weight.\n(c) The possession or consumption of alcoholic beverages shall not constitute a violation of this Section if such\npossession or consumption takes place for religious purposes protected by the First Amendment to the United States\nConstitution.\n(d) Prima facie evidence of a violation of Subsection (a) above shall consist of:\n(i.) Evidence that the defendant was under the age of 21 years and possessed or consumed alcoholic beverages\nanywhere in the City of Trinidad; or\n(ii.) Evidence that the defendant was under the age of 21 years and manifested any of the characteristics\ncommonly associated with alcoholic beverage intoxication or impairment while present anywhere in the City of\nTrinidad.\n(e.) During any trial for a violation of Subsection (a) above, any bottle, can or other container with labeling indicating\nthe contents of such bottle, can or container shall be admissible into evidence; and the information contained on any\nlabel on such bottle, can or other container shall be admissible into evidence and shall not constitute hearsay. A jury\nor a judge, whichever is appropriate, may consider the information upon such label in determining whether the\ncontents of the bottle, can or other container were composed in whole or in part of ethyl alcohol. A label which\nidentifies the contents of any bottle, can or other container as \"beer,\" \"ale,\" \"malt beverage,\" \"fermented malt\nbeverage,\" \"malt liquor,\" \"wine,\" \"champagne,\" \"whiskey\" or \"whisky,\" \"gin,\" \"vodka,\" \"tequila,\" \"schnapps,\"\n\"brandy,\" \"cognac,\" \"liqueur,\" \"cordial,\" \"alcohol\" or \"liquor\" shall constitute prima facie evidence that the contents\nof the bottle, can or other container were composed in whole or in part of ethyl alcohol.\n(f). A parent or legal guardian of a person under 21 years of age, or any natural person who has the permission of\nsuch parent or legal guardian, may give, or permit the possession and consumption of, alcoholic beverages to or by a\nperson under the age of 21 years under the conditions described in Paragraph (b)(1) above. This Subsection shall not\nbe construed to permit any establishment which is or is required to be licensed pursuant to Article 46, 47 or 48 of\nTitle 12, C.R.S., or any members, employees, or occupants of any such establishment to give, provide, make available\nor sell alcoholic beverages to a person under 21 years of age.\n(2) Possession of marijuana\n(a) It is unlawful for any person under the age of 21 years to possess or use marijuana or to openly and publicly\ndisplay or consume marijuana within the City limits of the City of Trinidad.  Illegal possession or consumption of\nmarijuana by an underage person is a strict liability offense.\n(b) The possession or consumption of marijuana shall not constitute a violation of this Section if such possession or\nconsumption takes place for medical use 18-18-406.3.\n(3) Possession of drug paraphernalia\n(a) It is unlawful for any person under the age of 21 years of age who possesses marijuana paraphernalia anywhere in\nthe City of Trinidad and knows or reasonably should know that the drug paraphernalia could be used in\ncircumstances in the violation of the laws of the City commits illegal possession of marijuana paraphernalia by an\nunderage person. Illegal possession of marijuana paraphernalia by an underage person is a strict liability offense.\n(b) The possession of drug paraphernalia shall not constitute a violation of this Section if such possession takes place\nfor medical use 18-18-406.3.\n(4) Penalty for violation.\n(a) A violation of this section is an unclassified petty offense 18-13-122 (3)(d).\n(b) Any person who violates this Section shall be subject to a fine of no less than $100.00 and no more than $750.00.\n(Ord. 3024, Sec 16-28.1, enacted 9/17/21)\nSection 16-29.      Abandoned refrigerators; removal of locks.\nIt shall be unlawful for any person to leave outside of any building, dwelling or any other place accessible to children any\nabandoned, unattended, unused or discarded icebox, refrigerator or any other container of any kind which has an airtight\ndoor, snap or other device which may not be released from the inside of such icebox, refrigerator or container, without first\nremoving therefrom such door, lock or device. (Code 1958, Sec. 17-1 and 17-2.)\nARTICLE 5.  OFFENSES AGAINST MORALS.\nSection 16-30.      Common gambler defined.\nAs used herein, a common gambler shall mean a person who keeps or exhibits any gambling table, device or apparatus to\nwin or gain money or other property, or aids, assists or permits others to do the same, or engages in gambling for a\nlivelihood.  (Code 1958, Sec. 17-26.)\nSection 16-31.      Permitting gambling on premises.\n(1)  It shall be unlawful for any person to keep or as owner to rent any room, building, arbor, booth, shed or tenement of\nany description to be used or occupied for gambling or knowingly permit the same to be used or occupied for gambling.\n(2)  If the owner of the premises stipulated in Subsection (1) herein has knowledge that any gambling table, apparatus or\ndevice is kept or used in such premises he/she shall forthwith cause complaint to be made against the person so keeping or\nusing such premises; if he/she shall fail to do so he/she shall be taken, held and considered to have knowingly permitted\nthe same to be used and occupied for gambling.  (Code 1958, Sec. 17-27.)\nSection 16-32.      Gambling Unlawful.\nIt shall be unlawful for any person to engage in gambling, as that term is defined in C.R.S. 18-10-102(2).\nSection 16-33.      Gambling with intoxicated persons or minors.\nIt shall be unlawful for any person, by any device or pretense, to entice, or prevail upon, or cause any minor or intoxicated\nperson to engage in any game whatsoever, for any sum of money or property of value, or make any bet or wager with such\nminor or intoxicated person.  (Code 1958, Sec. 17-29.)\nSection 16-34.      Indecent exposure.\nIt shall be unlawful for any person to appear in any public place in a state of nudity, or make an indecent exposure of\nhis/her person, or be guilty of any lewd or indecent act or behavior. (Code 1958, Sec. 17-32.)\nSection 16-35.      Urinating in public.\nIt is unlawful for any person to urinate in any public way, or place which is public in nature, or any place within the City\nopen to public view.\nSection 16-36.      Allowing prostitution on premises.\nIt shall be unlawful for any person owning or in charge of any building or premises to permit the same to be used for\npurposes of prostitution.  (Code 1958, Sec. 17-16.)\nSection 16-37.      Prostitution - Plying vocation.\nIt shall be unlawful for any prostitute, courtesan or lewd woman, by word, gesture or action to ply or attempt to ply her\nvocation upon the streets, highways or thoroughfares, or from the door or window of any house, or in any public place.\n(Code 1958, Sec. 17-44.)\nState law reference: As to regulations pertaining to prostitution, see C.R.S., Sec.  18-7-201 et seq.\nSection 16-38.      Prostitution prohibited; cohabitation with prostitute.\nIt shall be unlawful for any female person to solicit or receive visits as a prostitute, or to occupy any house, room or\napartment, and use the same for purposes of prostitution, or for any male person to cohabit with any female prostitute.\n(Code 1958, Sec. 17-45.)\nSection 16-39.      Enticing to house of ill repute.\nIt shall be unlawful for any person to entice any male or female of good repute to any house of ill fame, or to any\nassignation house, or to any other house of bad repute. (Code 1958, Sec. 17-62.)\nSection 16-40.      Keeping of disorderly house.\n(1)  It shall be unlawful for any person to keep a bawdy house, house of ill fame, house of assignation or disorderly house,\nwithin the limits of the City or within three (3) miles beyond such limits, or be an inmate of or in any way connected with\nor contribute to the support of any such house or permit any building in his/her possession or under his/her control\nsituated within the City or within three (3) miles beyond the limits of the City or to be used for any such purpose; or within\nthe City or within three (3) miles beyond the limits thereof, suffer any drunkenness, quarreling, fighting, unlawful gaming\nor any disorderly conduct whatever on his/her premises.\n(2)  The license of any business operated in the premises described in (1) shall be subject to revocation.\nARTICLE 6.  OFFENSES AGAINST PUBLIC HEALTH.\nDIVISION 1.  GENERAL PROVISIONS.\nSection 16-41.      Poison to be labeled.\nIt shall be unlawful for any person to sell, give or deliver any deadly poison, knowing it to be such, without marking it in\nlegible letters \"Poison\".  (Code 1958, Sec. 16- 18.)\nState law reference: As to State requirements, see C.R.S. 1973, Sec. 12-22-119.\nSection 16-42.      Tainted provisions not to be sold.\nIt shall be unlawful for any person to sell or offer for sale any diseased, tainted or putrid meat, poultry, fish, game or\nprovisions of any kind or any decayed fruits or vegetables.  (Code 1958, Sec. 16-20.)\nSection 16-43.      Unwholesome provisions not to be sold.\nIt shall be unlawful for any person to sell or offer for sale in any market or elsewhere within the City, any emaciated,\ntainted or putrid meat, provisions or vegetables, which may be deemed unwholesome.  (Code 1958, Sec. 16-21.)\nSection 16-44.      Cleaning of cesspools, grease traps and privy vaults; when required.\nAll grease traps and privy vaults shall be cleaned once a year or oftener if ordered to do so by the Health Department, and\nall cesspools shall be cleaned when their contents are up to the inlet and the condition created by the failure to clean shall\nconstitute a nuisance.  (Code 1958, Sec. 16-3.)\nSection 16-45.      Discontinuance of cesspools, grease traps and privy vaults; filling.\nWhenever any grease trap, privy vault or cesspool is discontinued, it shall be cleaned to the bottom and filled up with earth\nor other suitable material and such work shall be done under the supervision of the Health Department.  (Code 1958, Sec.\n16-4.)\nSection 16-46.      Removal of contents of cesspools, grease traps and privy vaults.\nThe contents of privy vaults, grease traps, cesspools or accumulation of garbage, within the limits of the City, shall not be\nremoved or be transported through any street, alley or public place except in the most sanitary manner, through or by\nmeans of airtight suction tanks, if soft and mixed with water, and if solid or dry, in sheet steel tight tanks in such manner\nas shall prevent the escape of any noxious or offensive odors and preserve such contents from sight or exposure during\ntransportation.  All tools, appliances, and vehicles used in such removal shall be kept and maintained in a good sanitary\ncondition, subject to the inspection of the Health Department at all times.  (Code 1958, Sec. 16-5.)\nSection 16-47.      Substances of abuse.\n(1)  As used in this Ordinance, the term \"Substance of Abuse\" shall mean any toxic, noxious, or volatile chemical,\ncompound or substance containing toluene, acetone, or other solvent or chemical having the property of releasing toxic\nvapors.\n(2)  No person shall, for the purpose of causing a condition of intoxication, euphoria, excitement, exhilaration,\nstupefaction or dulling of the senses or nervous system, intentionally smell, inhale or ingest the fumes from any substance\nof abuse, provided, however, that this Section shall not apply to the inhalation of any anesthesia for medical or dental\npurposes.\n(3)  No person shall, for the purpose of violating or aiding another to violate any provision of this Ordinance, intentionally\npossess, buy, sell, transfer possession, or receive possession of any substance of abuse.\n(4)  Any person, other than a minor, violating any provision of this Ordinance shall, upon conviction, be fined not more\nthan Three Hundred Dollars ($300.00) or be imprisoned for a period not to exceed ninety (90) days or by both such fine\nand imprisonment.  Any minor violating any of the provisions of this Ordinance shall be dealt with in accordance with the\nChildren's Code as adopted by the State of Colorado.\n(5)  This section shall have no application to any alcoholic or fermented malt beverage, nor to any drug, compound, or\nsubstance regulated under Title 12 or Title 18 of the Colorado Revised Statutes as amended.\nDIVISION 2.  SMOKING IN PUBLIC PLACES AND PLACES OF EMPLOYMENT.\nSection 16-48.      Legislative intent.\nIn order to serve the public health, safety and general welfare, it is the declared policy of the City of Trinidad to prohibit\nsmoking in accordance with Colorado Revised Statutes, Section 25-14-201 et. seq. , and to recognize and enforce violations\nof the Colorado Law.\nSection 16-49. through Section 16-55 Repealed. (Ord. 1820, eff. 10/13/06)\nARTICLE 7.  NUISANCES.\nSection 16-56. Discharging foul substances into street.\nIt shall be unlawful and a nuisance for any person to allow to be discharged or permit to flow from any still house,\nworkshop, manufacture or other house or place owned or kept by him/her, foul or nauseous liquor or substance of any\nkind, upon any street or alley or other public place, so as to be a threat to the health or safety of any person, or offensive to\npersons living in the vicinity.\nSection 16-57.      Accumulating offensive substances.\nIt shall be unlawful and a nuisance for any person to permit or cause any grease traps, cesspool matter, animal or human\nexcrement, garbage, refuse or filth to be deposited, buried, or allowed to accumulate in or upon any premises owned or\nkept by him/her or to deposit, bury or allow to accumulate such offensive substances on any sidewalk, alley, premises,\nvacant lot or other place within the City.\nSection 16-58.      Offensive cellars; sewers.\nIt shall be unlawful and a nuisance for any person to permit any cellar, vault, private drain, pool, privies, sewer or grounds\nupon any premises belonging to, or occupied by him/her to become nauseous, foul or injurious to the public health.\nSection 16-59.      Accumulation of junk.\nIt shall be unlawful and a nuisance for any person to permit old rope, old iron, brass, copper, tin, lead, old lumber,\nconstruction material or debris, bricks, building remnants, rags, empty bottles, broken glass, paper, bagging or other\nsimilar junk to be deposited, stored or allowed to accumulate in or on any vacant lot, or in or on any other premises within\nthe City.  Any person who shall create, cause to be created, maintain, continue, increase or permit any nuisance specified\nin this Section, shall be deemed guilty of a nuisance.\nSection 16-60.      Exclusion from provisions.\nThe provisions of Section 16-59 shall not apply to the conduct, operation or establishment of a junk shop or junk yard\nbusiness duly licensed as such by the City.\nSection 16-61.      Barbed wire and other projections into thoroughfares.\nIt shall be unlawful and a nuisance for any person to put upon, keep or maintain any barb, barbed wire, sharpened nails or\nsharpened thing of metallic substance upon any fence, cellar guard or window guard, railing or bannister, that may front\nupon or that may be erected or constructed upon any street, avenue, lane, alley, building or sidewalk so that it shall project\nor extend beyond the surface of the wood or other material of which such fence, cellar guard or window guard, failing or\nbannister may be constructed.\nSection 16-62.      Placing obstructions on public right-of-way.\nIt shall be unlawful and a nuisance for any person to place or assist in placing or cause to be placed in or upon any street,\nalley, highway, or in or upon the track or right-of-way of any railway company, any construction material, building, fence,\nrubbish or other obstruction of any kind or description without obtaining the prior consent of the City Manager, and no\nsuch consent shall authorize the obstruction of more than one-half (½) the width of any street.\nSection 16-63.      Dangerous or hazardous conditions.\nIt shall be unlawful and a nuisance for any person to permit any building, structure or land owned or occupied by him/her\nwhich is accessible to the public, to become or remain in such a condition as to present a substantial danger or hazard to\nthe public health or safety.\nSection 16-63.5    Broken windows.\nIt is unlawful and a nuisance for any person to permit any windows on the ground level story of any building or structure\nwithin the City to remain broken or removed, or otherwise in a state of disrepair.  A window shall be considered broken or\nin a state of disrepair if glass is actually missing from the window area.  A cracked window shall not constitute a nuisance.\n Any person who shall create, cause to be created, maintain, continue, increase, or permit any such nuisance, shall be\ndeemed guilty of a nuisance.  No such nuisance shall be considered abated unless and until such broken or removed\nwindow has been replaced by glass or other translucent material.  (Ord. 1602, eff., 3/1/99)\nSection 16-64.      Notice to abate nuisance.\nAny person who violates either of sections 16-57, 16-58, 16-59, 16-61, 16-62, 16-63, or 16-63.5 of this Code shall be notified\nin writing by the City Manager or his/her designee of such violation.  Such written notice shall identify the nuisance and\norder the person in violation to abate or remedy such nuisance within a reasonable period of time from the date the notice\nis issued, to be determined by the City Manager or his/her designee.  The violator shall be served with such written notice\nby either first class mail, certified mail, or personal service.  A failure to comply with such notice shall subject such person\nin violation to punishment as provided in Section 1-8 of this Code for each day he/she neglects or refuses to abate such\nnuisance beyond the period of time he/she is given to abate the nuisance.  In addition, if the nuisance is not abated within\nthe time specified in the notice, the City Manger may then proceed to have the nuisance abated. (Ord. 1602, eff., 3/13/99)\nSection 16-65.      Assessment of costs and collection of assessments.\n(1) Upon abatement of a nuisance by City forces or by independent contractors employed by the City for such purpose, a\ncharge shall be made against the owner of the property or any other person who created or permitted the creation of such\nnuisance.  The charge shall be actual costs for labor, equipment and materials, or the contract price of an independent\ncontractor, together with a $1,000 administrative fee thereon for administrative supervision, inspection, and noticing.\n(Ord. 2050, repealed and reenacted, eff., 11/21/17)\n(2)  The City Clerk, as soon as practicable after such charge has accrued, shall send by first class mail, addressed to the\nowner of such property and/or any other person who has created or permitted the creation of such nuisance, at the last\nknown address of such person or persons, a notice of such charge, which notice shall contain a description of the lots or\ntracts of land, the name of the owner or owners and the amount of the assessment.\n(3)  It shall be the duty of the owner or any other person who has created or permitted the creation of such nuisance, to pay\nsuch charge within twenty (20) days after the mailing of such notice, and upon his/her failure to do so, provided the notice\nhas been mailed to the owner, such charge shall be certified to the officer having custody of the tax list, in the same\nmanner as the City taxes are certified to such officer, to be collected according to the laws of the State of Colorado for the\nassessment and collection of general taxes, including the laws for the sale of property for taxes and the redemption thereof.\n(4)  Provided such notice has been mailed to the property owner, such charge shall become a lien upon the respective lots\nor tracts of land at the time the City Clerk certifies such charge to the officer having custody of the tax list.\n(5)  The City may also proceed to collect such charge by obtaining a judgment in the County or District Court against  the\nproperty owner or any other person who has created or permitted the creation of such nuisance, and enforcing such\njudgment through such means as are provided by law.\nSection 16-66.      General notice to clean up.\nWhenever the Mayor deems it necessary to give a general notice to all the inhabitants and the property owners to clean up\nand remove from their premises all filth, garbage, excrement, rubbish and refuse matter of every kind, a formal notice\nissued by the City and published in a newspaper of general circulation in the City shall be deemed sufficient and legal\nnotice; and any person failing to comply with the requirements of such notice shall be liable to the penalties prescribed in\nthis Code for maintaining a nuisance.  (Code 1958, Sec. 16-26.)\nSection 16-67.      Summary abatement of nuisances.\nThe City Manager, if he/she should determine that the existence of a nuisance is an immediate threat to the public health,\nsafety or welfare, shall have the power to proceed to have the nuisance abated, without prior notice to the property owner\nor other person who created or permitted the creation of the nuisance.\nARTICLE 8. PENALTIES\nSection 16-68.      Penalty for violations by minors.\nWhenever, in this Chapter of this Code, any act or failure to do a required act is prohibited or is made or declared to be\nunlawful or an offense or a misdemeanor, the violation of any such provision by a person under the age of eighteen (18)\nyears shall be punished by a fine not exceeding three hundred dollars ($300.00), notwithstanding any other penalty for\nsuch offense which may be provided elsewhere in this Code. (Ord. 1674, 3 eff., 10-26-01)\n"
}