{
    "chapter": "Chapter 4 - Animals",
    "content": "Chapter 4 - Animals\nARTICLE 1.  GENERAL PROVISIONS.\nSections:\n4-1                         Butchering unlawful and a nuisance; exception.\n4-2                         Cruelty to animals.\n4-2-1                      Tethering and penning.\n4-3                         Keeping hogs in City.\n4-4                         Fowl not to run at large.\n4-5                         Animals not to run at large.\n4-6                         Offensive pens - Nuisance.\n4-7                         Keeping of noisy and odoriferous poultry.\n4-8                         Penalty for violation.\n4-9                         Release of impounded animal without authority.\nARTICLE 2.  IMPOUNDING.\n4-10                       Animals running at large to be impounded.\n4-11                       Disposition of impounded animals.\n4-12                       Impoundment fees; claiming impounded animal.\nARTICLE 3.  DOGS AND CATS.\n4-13                       Definitions.\n4-14                       License and registration required; fees.\n4-15                       Tag and Collar.\n4-16                       Vaccination.\n4-17                       Confinement of dogs and cats biting persons or suspected of being rabid; procedure.\n4-18                       Dogs running at large.\n4-19                       REPEALED\n4-20                       Liability of owner.\n4-21                       Impounding dogs.\n4-22                       Notice to owner and period of impoundment.\n4-23                       Disposition of impounded dogs and cats.\n4-24                       Keeping of vicious dogs prohibited.\n4-25                       Definitions.\n4-26                       Unlawful conduct.\n4-27                       Investigation and Complaints.\n4-28                       Citations, Orders & Impoundment.\n4-29                       Penalty-Fines.\nCHAPTER 4.  ANIMALS\nARTICLE 1.  GENERAL PROVISIONS.\nSection 4-1.          Butchering unlawful and a nuisance; exception.\n(1)  It shall be unlawful for any person to kill or dress any cow, calf, sheep, hog or goat or to steam or render any tallow or\nlard, except for his/her own use or consumption.\n(2)  Any person who violates this section shall be deemed guilty of maintaining a nuisance.  (Ord. 1958, Sec. 4-1.)\nSection 4-2.          Cruelty to animals.\n\nIt shall be unlawful for any person to commit cruelty to animals.  A person commits cruelty to animals if, except as\nauthorized by law, he/she knowingly over drives, overloads, overworks, tortures, torments, deprives of necessary\nsustenance unnecessarily or cruelly beats, needlessly mutilates, needlessly kills, carries in or upon any vehicles in a cruel\nmanner, or otherwise mistreats or neglects any animal, or causes or procures it to be done, or, having the charge and\ncustody of any animal, fails to provide it with proper food, drink or protection from the weather or abandons it.  Any\nperson who violates this Section shall be subject to the penalty set forth in Section 1-8 of the Code of Ordinances.\nSection 4-2-1.          Tethering and penning.\nIt is a violation for any owner or keeper of an animal to:\n(1)       Keep any animal on a permanent tether that restricts movement of the tethered animal to an area less than one\nhundred forty-four square feet (144 sq. ft.), or less than a twelve foot (12’) radius at ground level.\n(2)       Tether an animal with a choke-type collar or prong-type collar.\n(3)       Keep any animal tethered for more than four (4) hours during a twenty-four (24) hour period or keep any animal\nconfined in an outdoor pen, or cage without appropriate shelter for more than four (4) hours during any twenty-four (24)\nhour period.\n(4)       Keep any animal tethered without appropriate shelter at all times from the weather or for any duration when\noutdoor conditions (extreme heat, cold, wind, rain, snow or hail) pose an adverse risk to the health or safety of the animal.\n(5)       Keep any animal tethered with a tether that has weights attached or that contains metal chain links more than one-\nquarter of an inch thick.\n(6)       Provide an inappropriately sized shelter for the animal, defined as a structure with a roof and sufficient ventilation\nwhile providing the animal ability to maintain body heat in cold months and ability to dissipate heat in warm months.\n(7)       Tether an animal so as to restrict its access to suitable and sufficient clean water and food.\n(8)       Tether an animal in a manner that allows it to become entangled with the tether or other object that restricts its\nmovement.\n(9)       No person owning or keeping any animal shall subject the animal to cruel conditions or inhumane chaining or\ntethering at any time (ie., exposure to filth, taunting or harassing,  or subjecting it to dangerous conditions).\n(10)     Cage, pen, or kennel an animal in a confinement with sidewalls less than four (4) feet nor provide a floor area less\nthan 24 square feet per animal or a length less than three times the length of the animal, whichever is greater.\nAny person who violates this Section shall be subject to the penalty set forth in Section 1-8 of the Code of Ordinances.\n(Ord. 2048, Sec. 4-2-1 enacted, eff. 12-01-17)\nSection 4-3.          Keeping hogs in the City.\nIt shall be unlawful for any person to keep hogs or pigs within the City, except as follows.  Any person may keep what is\ncommonly known as a Miniature Pot-Bellied Pig within any zone district within the City in which domestic animals are\npermitted.\nSection 4-4.    Fowl not to run at large.\nIt shall be unlawful for any owner or keeper of chickens, ducks, geese or other like fowl to permit them at any time to run\nat large within the City.  (Ord. 1958, Sec. 4-10.)\nSection 4-5.    Animals not to run at large.\nIt shall be unlawful for any owner or keeper of horses, asses, mules, cattle, sheep, goats and swine to permit them to run at\nlarge within the City.  (Ord. 1958, Sec. 4-13.)\nSection 4-6.    Offensive pens - Nuisance.\nIt shall be unlawful for any person after notice to abate by a City officer, to permit or maintain any pen, place or premises\nin or upon which animals are kept so as to be offensive or any annoyance to any person.  All such places are declared to be\na nuisance.  (Ord. 1958, Sec. 4-6.)\nSection 4-7.    Keeping of noisy and odoriferous poultry.\nIt shall be unlawful and a nuisance for any person to knowingly keep, maintain or permit to remain, under his/her control,\nupon any lot or parcel of land in the City, any poultry or fowl, or any creature which by any persistent or pertinacious\nnoise, sound or outcry, or by the creation or causing of offensive odors, shall disturb the peace or comfort of any\nneighborhood or interfere with any person in the reasonable and comfortable enjoyment of life or property, and such\nconditions shall be abated upon the order of the City Manager or any other authorized official of the City.\nSection 4-8.   Penalty for violation.\nAny person who knowingly violates any of the provisions of this Article shall be deemed guilty of a misdemeanor and upon\nconviction thereof shall be subject to the penalties provided in Section 1-8 of this Code.\nSection 4-9.   Release of impounded animal without authority.\nIt shall be unlawful for any person to release or attempt to release any animal that has been impounded, from the custody\nof any animal control officer or police officer of the City, or from the City's Animal Shelter, transport vehicle or cages or\ntraps set in the field, by opening the gate of the Animal Shelter, tearing down the fence or enclosure, or in any other\nmanner without the consent of the person in charge thereof.\nARTICLE 2.  IMPOUNDING.\nSection 4-10.        Animals running at large to be impounded; notice of sale.\nAny animal control officer or police officer shall impound at the City's Animal Shelter any of the animals listed in Sections\n4-4 or 4-5 of this Code, found running at large.  Where livestock is so impounded, the State Brand Inspector shall be\nnotified as soon as practicable of such impoundment.\nSection 4-11.  Disposition of impounded animals. (Ord. 1942, Sec. 4-11 repealed and reenacted, eff.\n8/16/13)\n(1)       Disposition of impounded livestock shall be in accordance with State statutes and regulations and at the direction of\nthe State Brand Inspector.\n(2)       The following procedures shall be followed with respect to the disposal of all other animals impounded pursuant to\nthis Article:  No such animal shall be put up for adoption or humanely destroyed unless the ownership of such animal\ncannot be ascertained or at least ten (10) days have elapsed since written notice of impoundment has been issued to the\nowners.  Said notice shall advise the owner as to where the animal was impounded, the date and time of the impoundment,\nthe location where the animal is being held, a description of the animal, that the animal must be claimed within ten (10)\ndays of the issuance of the notice, and the impound fee and feeding costs to be paid prior to the release of the animal to the\nowner.  Said notice shall be either mailed by certified mail to the owner’s last known address or hand delivered to the\nowner.\nSection 4-12.  Impoundment fees; claiming impounded animal. (Ord. 1942, Sec. 4-12 repealed and\nreenacted, eff. 8/16/13)\nThe owner of any animal impounded pursuant to this Article shall be charged Ten Dollars ($10.00) per day for boarding\nand feeding of said animal.  If the owner of the impounded animal shall claim such animal within the ten (10) day period\nspecified in the notice and pay all costs then accrued for impounding and feeding, plus a Fifteen Dollar ($15.00)\nredemption fee, the animal shall be released to the owner; except that in the case of livestock, the owner may be required\nby the State Brand Inspector to pay the cost of transporting the animal to the Animal Shelter before the animal is released.\nARTICLE 3.  DOGS AND CATS.\nSection 4-13.        Definitions.\nAs used herein:\n(1) Animal control Officer shall mean the person employed by the City Manager as being responsible for control of animals\nby the City.\n(2) Dog shall mean an animal of canine species, male or female.\n(3) Female dog shall mean a dog of the female sex.\n(4) Male dog shall mean a dog of the male sex.\n(5) Owner or owns means any person, firm, corporation, or organization owning, possessing, harboring, keeping, having\nfinancial or property interest in, or having control or custody of a domestic animal (meaning any dog, cat, any animal kept\nas a household pet, or livestock), including a dangerous dog as the term is defined in Section 4-24 of this Article 3.  (Ord.\n1942, Sec 4-13(5), amended eff. 8/16/13)\n(6) Spayed female dog shall mean a dog of the female sex upon which surgery has been performed to make her incapable\nof reproduction.\n(7) Bodily injury means any physical injury that results in bruising, muscle tears, or skin lacerations requiring, or that\ncould require, professional medical treatment or any physical injury that requires or could require corrective or cosmetic\nsurgery.  (Ord. 1942, Sec 4-13(7), eff. 8/16/13)\n(8) Serious bodily injury means bodily injury which, either at the time of the actual injury or at a later time, involves a\nsubstantial risk of death, a substantial risk of serious permanent disfigurement, a substantial risk of protracted loss or\nimpairment of the function or any part or organ of the body, or breaks or fractures. (Ord. 1942, Sec 4-13(8), eff. 8/16/13)\nSection 4-14. License and registration required; fees.\n(1) All dogs and/or cats kept, harbored and maintained by their owners, except as provided in Subsection (4) hereof, shall\nbe licensed and registered annually, and each owner shall pay to Noah’s Ark Animal Welfare Association for its use and\nbenefit, the following license fees:\n(a) Female dogs (unspayed) and male dogs (Unneutered)------$15.00\n(b) Male dogs (neutered) and female dogs (spayed)-------------$  8.00\n(c) Cats------------------------------------------------------------------$ 3.00\n(2) All license fees shall be due and payable not later than the 15th day of January of the ensuing year.\n(3) The owner shall state at the time application is made for license, and upon printed forms provided for such purpose,\nhis/her name and address, and the name, breed, color and sex of each dog and/or cat owned or kept by him/her.\n(4) All dogs and/or cats over four (4) months old shall be licensed as herein provided, within ten (10) days after their\nacquisition or purchase by the owner or after their arrival in the City. (Ord. 1978, Sec. 4-14, repealed and reenacted, eff. 6-\n2-15)\nSection 4-15. Tag and collar.\n(1) A license tag will be furnished by Noah’s Ark Animal Welfare Association upon receipt of the application, together with\na certificate from a veterinarian licensed to practice veterinary\nmedicine in this State, unless the same has been waived as provided in Section 4-16, that the dog and/or cat has a\ncertificate of rabies vaccination that is valid until the end of the year, together with the payment of the required fee. Every\nowner shall be required to provide each dog and/or cat with a collar to which the license tag must be affixed, and shall see\nthat the collar and tag are constantly worn.\n(2) In case a dog and/or cat tag is lost or destroyed, a duplicate will be issued by Noah’s Ark Animal Welfare Association\nupon presentation of a receipt showing the payment of the license fee for the current year and the payment of a Two\nDollars ($2.00) fee for the issuance of the duplicate tag.\n(3) Dog and/or cat tags shall not be transferable from one dog and/or cat to another and no refund shall be made on any\ndog and/or cat license fee because of the death of the dog and/or cat or the owner leaving the City before the expiration of\nthe license. (Ord. 1978, Sec. 4-15, repealed and reenacted, eff. 6-2-15)\nSection 4-16. Vaccination.\n(1) Each dog and/or cat shall be vaccinated against rabies and such vaccination shall be repeated as determined by the\nveterinarian administering the original vaccination. A certificate of vaccination shall be completed in duplicate by the\nveterinarian, and one (1) copy retained in the veterinarian's file. In the event the dog and/or cat is not of age to be properly\nvaccinated, the vaccination shall be waived therein and a certificate delivered to Noah’s Ark Animal Welfare Association.\n(2) No dog and/or cat shall be licensed as provided in Section 4-14 unless a valid certificate of rabies vaccination\naccompanies the application for the license. (Ord. 1978, Sec. 4-16, repealed and reenacted, eff. 6-2-15)\nSection 4-17.        Confinement of dogs and cats biting persons or suspected of being rabid; procedure.\n(1)  The owner of any dog or cat that has bitten any person shall immediately advise the Supervising Animal Control\nOfficer of this fact.  Any dog or cat that has bitten any person or has been exposed to another animal that is believed to\nhave rabies, shall be immediately confined for a period of ten (10) days or for a longer period, at the discretion of the\nAnimal Control Officer.  No owner of any dog or cat that has bitten any person or that has been exposed to another animal\nthat is believed to have rabies, shall destroy such animal before it can be properly confined by the Supervising Animal\nControl Officer.  Such confinement may be on the premises of the owner, if deemed appropriate in the discretion of the\nSupervising Animal Control Officer, but it must be within the City for a minimum of ten (10) days.  If the dog or cat is not\nconfined on the premises, the confinement shall be at the City Animal Shelter or any veterinary hospital of the owner's\nchoice.  Such confinement shall be at the expense of the owner.  Stray dogs whose owners cannot be located shall be\nconfined in the City Animal Shelter.\n(2)  No person knowing or suspecting a dog or cat has rabies shall allow such dog or cat to be taken off his/her premises or\nbeyond the limits of the City without the written permission of the Animal Control Officer.  Every owner, or other person\nupon ascertaining a dog or cat is rabid, shall immediately notify the Animal Control Officer or a police officer, who shall\nremove the dog or cat to the Animal Shelter for observation, or follow the procedure as provided for in Subsection (1)\nhereof.\nSection 4-18. Dogs running at large.\nNo owner or person in possession of any dog shall permit the same to run at large within the City, and all\ndogs shall be confined to the immediate premises of the owner or person in possession of the dog, except\nwhen:\nRestrained by a leash, chain, rope, cord or other device physically attached to the collar of the dog, which\nkeeps the dog under the absolute control of the owner or person in possession of the dog;\nWithin public places where it is clearly posted by the City that no leash is required. (Ord. 3065, Sec. 4-18,\namended, eff. 3/3/23)\nSection 4-19.        REPEALED (Ord. 1992, eff. 10/16/15)\nSection 4-20. Liability of owner. (Ord. 1732, Sec 4-20, amended eff. 8/29/03)\nThe owner of any dog shall comply with the following conditions:\n(1)  Shall not allow said dog to obstruct or interfere with any pedestrian or motor vehicle upon any public way or the\nentrance of any building or upon any public area.\n(2)  Shall keep and maintain said dog so that it does not, by noise or other activities, injure or interfere with the rights of\nother persons.\n(3)  Shall commit no cruel or inhumane action against said dog.\n(4)  Shall be liable and responsible for said dog at all times, whether it is on or off the owner's premises.\n(5) Shall not feed stray/homeless dog(s) without taking full responsibility for the dog(s) by providing the dog(s) with\ncontinued humane treatment which shall include proper food, water, shelter, veterinarian care, rabies vaccination, and\nalter the dog(s).  Any person who feeds stray dogs must follow the regulations by the city in reference to licensing and\nvaccination.\n(6) It is unlawful for any owner, or temporary owner, to own a pair of dogs of opposite sex of breeding age without one or\nboth of the dogs being altered even if not allowed to roam at large, with the exception of licensed pet stores, veterinary\nclinics, and animal shelters.\n(7) It is unlawful for any person to offer for sale or for free any dog(s) six (6) months of age or older without the dog(s)\nbeing altered, with the exception of pet stores with a current city business license and animal shelters.\n(8) It is unlawful for any person to own any number of unaltered dogs of the opposite sex and of breeding age (six months\nof age or older), with the exception of pet stores with a current city business license and animal shelters.\n(9) It is unlawful for any person who is the owner, or other person in possession, of a dog to permit such dog to cause\nannoyance in any neighborhood in the City by damage any lawn, garden, shrubbery, or any property of another at any\ntime, or in any other way to create a nuisance on the property of another, including the discharge of deposit of feces or\nother waste matter.\n(10) It is unlawful for a person to own, keep or harbor more than three dogs in any residence or provided establishment\nwithin the city.  Within thirty (30) days of enactment of this ordinance, any dog owner who altered and licensed his or her\ndogs in excess of three can continue to own, keep or harbor such dogs in excess of three.  Any owner who has in excess of\nthree dogs and complies with this sub-section cannot replace any dog in excess of three if any of the dogs dies or goes\nmissing.  It is the owner’s responsibility to provide written documentation of the altering and licensing of the dogs.\nSection 4-21.        Impounding dogs.\nThe Animal Control Officer or any police officer may catch and impound any dog that is not wearing a proper license as\nherein provided, that is not under proper control or confined to the owner's premises as herein provided or is in violation\nof any Section of this Article, in the Animal Shelter, provided, however, that if any dog cannot be safely caught and\nimpounded because of its dangerous or vicious propensities, such dog may be slain.\nSection 4-22.        Notice to owner and period of impounding. (Ord. 1762, Sec 4-22 amended eff. 10/15/04)\n(1)  Any dog or cat which has been impounded at the Animal Shelter pursuant to this Article, and whose owner cannot be\nascertained, shall be held at least seventy-two (72) hours before said dog or cat is disposed of by adoption or by humane\ndestruction.  No notice shall be required prior to disposition of said dog or cat.\n(2) Any dog or cat which has been impounded at the Animal Shelter pursuant to this Article, and whose owner is\nascertained, shall not be disposed of by adoption or humane destruction until at least ten (10) days after notice of\nimpoundment has been issued to the owner.  Said notice shall advise the owner as to where the dog or cat was impounded,\nthe date and time of the impoundment, the location where the dog or cat is being held, a description of the dog or cat, that\nthe dog or cat must be claimed within ten (10) days of the issuance of the notice, and the impoundment fee to be paid, and\nany vaccination and/or licensing requirements which must be met prior to the release of the dog or cat to the owner.   Said\nnotice shall be mailed by certified mail to the owner at the owner’s last known address or hand delivered to the owner.  \n(Ord. 1942, Sec. 4-22(2) repealed and reenacted, eff. 8/16/13)\n(3) Any dog that has been impounded at the Animal Shelter pursuant to a summons and complaint under Section 4-24\n“Keeping of vicious dogs prohibited” shall be held indefinitely.  The dog may be released pending the resolution of the\nsummons and complaint if the owner of the dog has shown cause to the Municipal Judge as to why the dog should be\nreleased.  The owner of the dog must establish to the Municipal Judge facts that show that the owner has taken steps to\nconfine, restrain, or properly supervise the dog before the dog is released to the owner pending resolution of the summons\nand complaint.\nSection 4-23.  Disposition of impounded dogs and cats. (Ord. 1523, Sec. 4-23 repealed and reenacted 12/5/95)\nAny owner may redeem a dog or cat being held at the Animal Shelter upon proof of ownership thereof and the payment of\na care and maintenance fee of Eight Dollars ($8.00) per day or any portion of a day that the dog or cat is maintained at the\nAnimal Shelter or any greater fee that might be charged by a veterinarian for the impounding of such dog or cat, a\ntranquilization fee of Ten Dollars ($10.00) where it has been necessary to tranquilize such dog or cat in order to impound\nit, and payment of a redemption fee of Fifteen Dollars ($15.00), subject to the provisions of Section 4-17 and vaccination\nand/or licensing requirements.\nSection 4-24.    Keeping of dangerous dogs prohibited. (Ord. 1924, Sec. 4-24 repealed and reenacted, eff.\n8/16/13)\n(1)       It shall be unlawful for any person to own, keep, harbor or possess a dangerous dog anywhere in the City.\n(2)       As used in this section, unless the context otherwise requires:\n(a)       Dangerous dog means any dog that:\n(I)        Inflicts bodily or serious bodily injury upon, or causes the death of a person or domestic animal; or\n(II)       Engages in or is trained for animal fighting as described and prohibited in C.R.S. 18-9-204; or\n(III)      Demonstrates tendencies that would cause a reasonable person to believe that the dog may inflict\nbodily or serious bodily injury upon, or cause the death of any person or domestic animal.\n(IV)     Such dog shall not be deemed to be a dangerous dog under the following circumstances where such dog\nhas bitten or attacked under the following circumstances:\n(a)       Any person engaged in the unlawful entry into or upon the dog owner’s property where such dog is\nkept;\n(b)       Any person engaged in the unlawful entry upon the dog owner’s automobile or any vehicle wherein\nsuch dog is confined, or which is parked on the street immediately adjacent to the owner’s property;\n(c)       Any person engaged in attacking or molesting another person;\n(d)       Any person engaged in attempting to stop an altercation between such dog and another dog;\n(e)       Any person who deliberately and wantonly provokes such dog to bite or attack such person,\nanother person or another animal.  (Ord. 2035, Sec. 4-24(2)(a) repealed and reenacted, eff. 7/28/17)\n \n(3) Any person who knowingly violates any of the provisions of this section shall be deemed guilty of a\nmisdemeanor and upon conviction thereof shall be subject to the penalties provided in Section 1-8 of this\nCode.  (Ord. 3064, Sec. 4-24(3), amended, eff. 3/3/23)\nSection 4-25.        Definitions (Ord. 1732, Sec 4-25 repealed and reenacted eff. 8/29/03)\nDefinitions. As used in this chapter unless the context otherwise indicates, the following terms shall have the meaning\nascribed to each:\n(1) “Altered” means any animal that has been sprayed or neutered.\n(2)   “Animal Shelter” means an animal shelter operated by city or county government or a shelter operated by a non-profit\norganization organized to benefit animals.\n(3) “Cat” means any commonly domesticated feline animal and includes both the male and female sex of the species.\n(4) “Free Roaming” means any cat that is allowed or that is able to leave the property of the owner at will.\n(5) “Nuisance Cat” means any cat that is allowed to free roam and is not altered.\n(6) “Owner” means an adult person or custodian possessing, harboring, keeping, feeding or having control or custody of a\ncat or any person having any financial interest, right, or property in the cat and also includes any person who permits a\ncat(s) to remain on or about any premises occupied by that person.\n(7) “Temporary Owner” means an adult person or custodian who harbors an animal with the knowledge and consent of the\nowner who is temporarily unable to care for the animal because of absence or indisposition.  An animal is deemed to be\nharbored if it is sheltered and/or fed.  A temporary owner shall be responsible for any violations of this chapter and shall\npay fines or fees charged as a result of any violation.\nSection 4-26.        Unlawful conduct.\n(1) It is unlawful for the owner, or temporary owner, of any cat(s) to allow it to be a nuisance cat(s). (Ord. 1732, eff., 8-29-\n03)\n(2) It is unlawful for any person to feed stray/homeless cat(s) without taking full responsibility for the cat(s) by providing\nthe cat(s) with continued humane treatment which shall include proper food, water, shelter, veterinarian care, rabies\nvaccination, and alter the cat(s).  Any person who feeds stray cats must follow the regulations by the city in reference to\nlicensing and vaccination. (Ord. 1732, eff., 8-29-03)\n(3) It is unlawful for any owner, or temporary owner, to own a pair of cats of opposite sex of breeding age without one or\nboth of the cats being altered even if not allowed to free roam, with the exception of licensed pet stores, veterinary clinics,\nand animal shelters. (Ord. 1732, eff., 8-29-03)\n(4) It is unlawful for any person to offer for sale or for free any cat(s) six (6) months of age or older without the cat(s) being\naltered, with the exception of pet stores with a current city business license and animal shelters. (Ord. 1732, eff., 8-29-03)\n(5) It is unlawful for any person to own any number of unaltered cats of the opposite sex and of breeding age (six months\nof age or older), with the exception of pet stores with a current city business license and animal shelters. (Ord. 1732, eff., 8-\n29-03)\n(6) It is unlawful for any person who is the owner, or other person in possession, of a cat to permit such cat to cause\nannoyance in any neighborhood in the City by any loud or unusual noise, or to damage any lawn, garden, shrubbery, or\nany property of another at any time, or in any other way to create a nuisance on the property of another, including the\ndischarge or deposit of feces or other waste matter. (Ord. 1732, eff., 8-29-03)\n(7) It is unlawful for a person to own, keep or harbor more than three cats in any residence or provided establishment\nwithin the city.  Within thirty (30) days of enactment of this ordinance, any cat owner who altered and licensed his or her\ncats in excess of three can continue to own, keep or harbor such cats in excess of three.  Any owner who has in excess of\nthree cats and complies with this sub-section cannot replace any cat in excess of three if any of the cats dies or goes\nmissing.  It is the owner’s responsibility to provide written documentation of the altering and licensing of the cats. (Ord.\n1732, eff., 8-29-03)\n(8) It is unlawful for a person to own, keep or harbor a cat or cats that have not been vaccinated pursuant to Section 4-16.\n(Ord. 1732, eff., 8-29-03)\nSection 4-27         Investigation and Complaints.\n(1) Upon receipt of a complaint by one or more persons alleging the presence of possible nuisance cat(s), the name of the\nowner of the animal, the address of the owner, and the description of the suspected cat(s), an animal control officer may\ninvestigate the complaint to determine if in fact the animal is a nuisance cat. (Ord. 1732, eff., 8-29-03)\n(2) Persons bothered by a nuisance cat may humanely trap the cat(s) on complainant’s property.  Complainants, after\nmaking prior arrangements, may deliver the cat to the animal control shelter.  Humane traps will be available at animal\ncontrol for a nominal fee and/or refundable deposit.  Persons using animal control traps shall be provided instructions\nregarding use of humane traps. (Ord. 1732, eff., 8-29-03)\nSection 4-28         Citations, Orders & Impoundment.\n(1) The department shall order the owner of a nuisance cat or dog running at large or vicious dog to have the animal\naltered at the owner’s expense, or if there is only one cat owned, order the owner to prevent the cat from free roaming.\n(Ord. 1732, eff., 8-29-03)\n(2) A citation or order may be issued to the owner or temporary owner of a cat for failure to comply with any applicable\nsection of this chapter. (Ord. 1732, eff., 8-29-03)\n(3) Animal control may set humane traps, resulting from complaints, where free roaming nuisance cat(s) are suspected\nand a secure trapping site is available. (Ord. 1732, eff., 8-29-03)\n(4) Free roaming cats may be impounded at the city-county animal control shelter. (Ord. 1732, eff., 8-29-03)\n(5) Any unaltered cat that is impounded shall be spayed or neutered at the owner’s expense and all impound fees, board\nfees, etc., paid before it can be reclaimed from the shelter.  Animal control shall transport the cat to owner’s choice of\nveterinarian clinics within the city limits. (Ord. 1732, eff., 8-29-03)\nSection 4-29 Penalty for violation. (Ord. 1903, Sec. 4-29 repealed and reenacted, eff. 9/17/10)\n(1)  An owner or temporary owner who violates any of the provisions of this Article shall be deemed guilty of a\nmisdemeanor and, upon conviction thereof, shall be subject to the assessment of a fine in accordance with this Section.  No\njail time shall be imposed for any violation of this Article.\n(2)  An owner or temporary owner who is found guilty of a first offense of any violation of this Article, other than a\nviolation addressed in subsection (3) below, shall be fined an amount of not less than Thirty Dollars ($30.00), plus an\nincrement of Twenty-Five Dollars ($25.00) for each additional offense occurring within a twelve (12) month period.\n(3)  An owner or temporary owner who fails to license and register his or her dog(s) or cat(s) or fails to vaccinate the dog(s)\nor cat(s) shall be fined an amount of Twenty Dollars ($20.00).\n"
}