{
    "chapter": "Chapter 3 - Alcoholic Beverages",
    "content": "Chapter 3 - Alcoholic Beverages\nSections:\n3-1                   License required.\n3-2                   Application for new license - Contents. \n3-3                   Notice of hearing - Posting and publication. \n3-4                   Applicant's initial appearance before Council. \n3-5                   Investigation; report. \n3-6                   Decision of Council. \n3-7                   License renewal procedure. \n3-8                   Changes in ownership of outlet - Application.\n3-9                   Transfer of location of license - Application.\n3-10                 500-foot Requirement for hotel and restaurant licenses eliminated.\n3-11                 Sale to certain persons prohibited. \n3-12                 Minors on licensed premises prohibited. \n3-13                 Hours of operation\n3-14                 Unlawful conduct - Licensee.\n3-15                 Suspension and revocation proceedings.\n3-16                 Fine in lieu of suspension.\n3-17                 Penalty for violations. \n3-18                 Prohibited acts; penalty. \n3-19                 Liquor license application fees.\n3-20                 Fees for Special Events Permits. \n3-21                 Optional premises standards.\n3-22                 Liquor Tasting Permits.\n3-23                 Alcohol beverage festival permit standards.\nCHAPTER 3.  ALCOHOLIC BEVERAGES.\nSection 3-1.    License required.\nThis Chapter shall be deemed to exercise the police powers of the City for the protection of the economic and social\nwelfare, health and peace and morals of the people of this City. This Chapter is further intended to augment the\nrequirements provided for in Article 3, Title 44, C.R.S. It shall further be deemed to impose other reasonable restrictions,\nterms and conditions which are placed upon licenses for the sale or dispensing of alcoholic beverages which may be\ngranted by the Trinidad City Council as the Local Licensing Authority for the City as provided in Articles 46 and 47 of Title\n12, C.R.S.\nIt shall be unlawful for any person to sell, or offer to sell, to dispense, or offer to dispense,\nany malt, vinous or spirituous liquors, as defined by the Article 3, Title 44, C.R.S. (Ord. 2071, Sec 3-1, amended eff.\n1/12/19.)\nSection 3-2.    Application for new license - Contents.\nAn application for a new alcoholic liquor or fermented malt beverage license shall be filed with the City Clerk on forms\nprovided by the State Liquor Licensing Authority. The application shall be complete in every material detail and shall be\naccompanied by the documents required to illustrate ownership interests, possession, the proposed licensed premises in\ndetail, and moral character. Where a petition in support of a new license being issued has been circulated, said petition\nmust be filed with the City Clerk no later than one calendar week preceding the public hearing date. The applicant is\nrequired to submit any other such information and documents as may be required by the City Clerk. (Ord. 2071, Sec. 3-2,\namended eff. 1/12/19.)\n\nSection 3-3.    Notice of hearing - Posting and publication.\nUpon receipt of an application, except an application for renewal or for transfer of ownership, the local licensing authority\nshall schedule a public hearing upon the application not less than thirty (30) days from the date of the application and\nshall post and publish the public notice in conformance with §44-3-311, C.R.S. (Ord. 2071, Sec. 3-3, amended eff. 1/12/19.)\nSection 3-4.    Applicant's initial appearance before Council.\n(1)  The City Clerk shall cause the application to be placed on the agenda of the Council meeting to be held no less than\nfour (4) nor more than thirty (30) days after the Clerk has received the application.\n(2)  The applicant shall be in attendance at the Council meeting at which his/her application is presented to the Council.\n This date of presentation to the Council shall be deemed the date of filing of the application for the purposes set forth in\nthe statutes.\n(3)  The Council shall tentatively set the boundaries of the neighborhood considered affected by the proposed location.\n Until the Council sets the tentative boundaries, the neighborhood shall be deemed to be that area within a radius of one\nhalf (½) mile in all directions from the proposed outlet.\n(4)  The applicant shall be instructed to, and shall cause to be prepared and shall furnish the Clerk at least fifteen (15) days\nprior to the public hearing an official area map showing the location of the proposed outlet and the location and nature of\nall other licensed premises located therein.\n(5)  The Council shall also set a date for public hearing which date shall not be less than thirty (30) days from the date of\nthe Council meeting at which the application is presented.\nSection 3-5.    Investigation; report.\n(1)  After the initial appearance of the applicant before the Council, the Clerk shall commence the investigation of the\napplicant and the premises.  Such investigation shall include the following:\n            (a)  Obtaining from the appropriate law enforcement agencies a criminal record on the applicant, including all\npartners, principals or stockholders holding over ten percent (10%) of the outstanding and issued capital stock, if\napplicable.\n            (b)  Letters of reference shall be verified with the person or persons signing the letters, if the references are local.  If\nthe references are not local, a letter from the Clerk shall be sent to the person or persons signing the reference letters\nrequesting verification.\n            (c) A report shall be prepared by the City Building Inspector identifying satisfaction of City\nBuilding Codes at the proposed licensed location or a recitation of any deficiencies and the steps\nrequired to correct such deficiencies.\n            (d)  The maps and information submitted concerning the general character of the neighborhood and of the residents\nand working population of the neighborhood shall be verified.\n            (e)  The premises proposed for a license shall be inspected to ensure that the plans and specifications submitted\nwith the application are true representations of the premises.\n(2)  All departments and administrative officials of the City shall cooperate fully with the Clerk in his/her investigation.\n These departments and officials shall include, but are not limited to, the Planning and Zoning Department, the Fire\nDepartment, the Building Inspector, the Police Department, the City Attorney, and all other City departments and officials.\n(3)  Any reports of the results of this investigation shall be delivered by the respective departments or officials to the City\nClerk at least ten (10) days prior to the date of hearing on the application.\n(4)  Not less than five (5) days prior to the date of hearing on the application, the Clerk shall make known the findings\nbased on the investigation in a written report to the applicant or principals of the organization applying for the license, and\nupon request to other interested parties, by mailing a copy thereof by certified mail.  (Ord. 1269, Sec. 2, 7/2/85.)\nSection 3-6.    Decision of Council.\n(1)  The decision of the City Council shall be rendered not more than thirty (30) days following the conclusion of the\nhearing.\n(2)  In formulating a decision, the City Council shall consider all of the facts and evidence adduced as a result of the\ninvestigation and hearing, including the reasonable requirements and desires of the inhabitants of the neighborhood\naffected; the number, type and availability of outlets located in or near the neighborhood under consideration; all other\nrestrictions applicable to the area under consideration; whether the City, State or Federal Building Codes, Fire Codes or\nElectrical Codes are  being satisfied at the proposed licensed location; and any other pertinent matters affecting the\n qualifications of the applicant to conduct the type of business proposed. (Ord. 1316, Sec. 1, 4/7/87.)\nSection 3-7.    License renewal procedure. \n(1) A renewal application for a liquor or fermented malt beverage license shall be filed with the City Clerk on a form\nprovided by the State Liquor Licensing Authority, no later than forty five (45) days before expiration of the existing license,\ntogether with the required fees.\n(2) The City Clerk is authorized to administratively process and approve, conditionally approve or deny renewal\napplications, or refer the license renewal to the City Council who shall approve, conditionally approve, or deny renewal\napplications. At the time of submission, the Clerk shall be furnished with all items consistent with section 3-7(1) of this\nArticle. The City Clerk shall not approve a renewal application unless credible evidence of good cause is presented.  The\nCity Clerk may impose reasonable terms and conditions on a license as may be necessary to protect the public health,\nsafety and welfare or to obtain or ensure compliance with this Article, this Code and applicable state law.  The City Clerk\nshall provide written notice of his or her decision, including the reason(s) therefor, by first-class, postage-prepaid U.S.\nmail to the Applicant at the address shown in the application.  An Applicant whose renewal application is denied or\nconditionally approved may appeal the Clerk’s decision to the Authority by filing written notice of appeal with the City\nClerk within ten (10) days of the date of mailing of the decision.  The Authority shall conduct a hearing on such appeal in\naccordance with Section 3-7(10) & 3-7(11) of this Article.\n(3) If the City Clerk has referred the license renewal to City Council, the City Clerk shall cause the renewal application to be\nplaced on the agenda of the Council meeting to be held no less than four (4) nor more than thirty (30) days after the Clerk\nhas received the application.\n(4) The applicant shall be in attendance at the Council meeting at which his/her renewal application is presented to the\nCouncil.\n(5) At the time of presentation of the renewal application, the Council shall be furnished with the following:\n            (a) A summary report submitted by the Police Department of the City of Trinidad identifying all calls responded to\nby the Police Department to the licensed location. Such summary report shall be accompanied by necessary subordinate\ninformation to provide a clear explanation of calls identified within the report.\n            (b) Copies of all incident reports of police responses to incidents which are identified as having originated at or\nwithin the licensed establishment during the previous license period.\n            (c) A report prepared by the City Building Inspector identifying satisfaction of City Building Codes or a recitation of\ndeficiencies and the steps required to correct such deficiencies.\n            (d) A report prepared by the Fire Department identifying satisfaction of City Fire Codes or a recitation of\ndeficiencies and the steps required to correct such deficiencies.\n(6) At the time the renewal application is presented to the City Council, the Council may approve the renewal application\nor postpone action on the application to a later date. In the event of a postponement, the Council shall not be required to\nhold a hearing on the application, except that no renewal application may be denied unless a renewal hearing has been\nheld.\n(7) The motion to set a hearing on the application must set forth the reason or reasons for holding a hearing. Notice of the\nhearing shall be posted in a conspicuous place on the licensed premises for a period of ten (10) days, and notice of the\nhearing shall be provided to the applicant at least ten (10) days prior to the hearing. Notice shall be by mail or personal\nservice.\n(8) The renewal hearing shall be conducted in the manner provided for hearings on applications for new liquor and\nfermented malt beverage licenses. At the hearing, evidence shall be taken to determine whether good cause exists to refuse\nto approve the renewal application. At the close of the hearing, the City Council may vote to approve or deny the renewal\napplication, or may adjourn the hearing to a later date before rendering its decision. Where timely application for renewal\nhas been made, the decision must be rendered prior to the date of expiration of the existing license, and in no event shall\nthe hearing be adjourned for a period exceeding thirty (30) days.\n(9) The City Council may refuse to renew a license for any of the following reasons: Failure to comply with City, State or\nFederal Building Codes, Fire Codes or Electrical Codes; any other reasons set forth under State law; and any other good\ncause reasons. (Ord. 2031, Sec. 3-7 repealed and reenacted, eff. 6/16/17)\nSection 3-8.    Changes in ownership of outlet - Application.\n(1)  All applicants for the issuance of a license by reason of transfer of possession of the licensing premises by operation of\nlaw or by the purchase and sale of the premises shall file an application on forms provided by the State Licensing Authority\nin duplicate with the City Clerk.\n(2)  All such applications shall be subject to the provisions of this Chapter.\n(3)  Notwithstanding Subsection (2) of this Section, the Council shall consider only the character of the applicant, and the\napplicant shall not be required to submit any other information except as it concerns his/her character and ability to\nconduct the business according to law.  (Ord. 973, Sec. 3.8 (c).)\n(4)  All applications for change of ownership shall be set for hearing.  Notice of the hearing must be conspicuously posted\non the licensed premises for a period of ten (10) days, and notice must be provided to the applicant at least ten (10) days\nprior to the hearing. The applicant shall be required to be in attendance at the hearing. (Ord. 1269, Sec. 9, 7/2/85.)\n(5)  Where the licensee is a corporation any transfer of ten (10%) percent or more of the capital stock of the corporation\nshall be reported to the City Clerk on forms provided by the State Licensing Authority not less than ten (10) days prior to\nsuch transfer.  (Ord. 973, Sec. 3.8(c).)\nSection 3-9.    Transfer of location of license - Application.\n(1)  Before the location of a license is changed, the licensee shall submit an application on forms provided by the State\nLicensing Authority in duplicate to the City Clerk for such change.  (Ord. 973, Sec. 3-8. (b).)\n(2)  All applications for a change in the location of a license shall be filed with the Clerk and shall be subject to the\nprovisions of this Chapter.  (Ord. 973, Sec. 3-8. (b).)\n(3)  Notwithstanding Subsection (2) of this Section, the Council, when considering an application for a change in location\nof a license, shall only consider the reasonable requirements of the neighborhood to which the applicant seeks to change\nhis/her location, and the desire of the adult inhabitants as evidenced by petitions, remonstrances or otherwise.  (Ord.\n1269, Sec. 10, 7/2/85)\n(4)  Notwithstanding Subsection (2) of this Section, all applications for change of location of a license shall be set for\nhearing.  The public hearing and notice requirements are the same as for a new license application.  The applicant shall be\nrequired to be in attendance at the hearing.  (Ord. 1269, Sec. 10, 7/2/85.)\n(5)  The City Council shall not transfer such license in less than twenty (20) days after the application has been made and\nthen only after no less than ten (10) days notice of the hearing has been given. (Ord. #973, Sec. 3-8.(b).)\nSection 3-10.  500-foot requirement for hotel and restaurant licenses eliminated.\nPursuant to Section 12-47-138 (1) (d) (IV), Colorado Revised Statutes, the distance restriction imposed by Section 12-47-\n138 (1) (d) (I), Colorado Revised Statutes is eliminated for hotel and restaurant licenses only. (Ord. 1383, 08/07/90.) \nSection 3-11.  Sale to certain persons prohibited.\nIt shall be unlawful for any person to sell or offer to sell, to dispense or offer to dispense, or to deliver or offer to deliver,\nany malt, vinous spirituous liquors to any person who is an habitual drunkard, or to any person who is under twenty-one\n(21) years of age or to an intoxicated person.  (Ord. 1958, Sec. 3-9.)\nSection 3-12.  Minors on licensed premises prohibited.\n(1) It shall be unlawful for any person under twenty-one (21) years of age to be in, or remain on any premises for which a\ntavern license has been issued, during those hours in which alcoholic beverages are sold or served, except in those areas of\nthe licensed premises in which the serving of alcoholic beverages is merely incidental to the serving of food, or other\nregular business of the establishment.\n(2) Any person who violates Subsection (1) of this Section shall be guilty of a misdemeanor and, upon conviction, shall be\nsubject to a fine of not more than Three Hundred Dollars ($300.00).\n(3) It shall be unlawful for any licensee, his/her agents, or employees to permit any person under the age of twenty-one\n(21) years to be in or remain on any premises for which a tavern license has been issued, during those hours in which\nalcoholic beverages are sold or served, except in those areas in which the serving of alcoholic beverages is merely\nincidental to the serving of food, or other regular business of the establishment.\n(4) Any person who violates Subsection (3) of this Section shall be guilty of a misdemeanor and, upon conviction, shall be\nsubject to imprisonment of not more than ninety (90) days, or a fine of not more than Three Hundred Dollars ($300.00),\nor both. (, Ord. 2071, Sec. 3-12, amended eff. 1/12/19)\nSection 3-13.  Hours of operation\nHours of operation for all types of licenses granted shall be those allowed pursuant to C.R.S., Article 3, Title 44, revised\nOctober 1, 2018 and as may be amended thereafter. (Ord. 2071, Sec. 3-13, repealed and re-enacted, eff. 1/12/19)\nSection 3-14.  Unlawful conduct - Licensee.\n(1)  It shall be unlawful for any licensee having authority to sell alcoholic beverages on his/her premises to permit any\ndisturbances or disorderly acts or conduct to be committed by any person or group of persons on his/her premises.\n(2)  It shall be unlawful for a licensee having authority to sell alcoholic beverages on his/her premises to in any manner\nencourage or participate in any disturbance or unlawful or disorderly act or conduct upon his/her premises, provided,\nhowever, such licensee may use such lawful means as may be proper to protect his/her person or property from damage or\ninjury.\n(3)  A licensee having authority to sell alcoholic beverages upon his/her premises shall immediately report to the police\ndepartment any unlawful or disorderly act or conduct or any disturbance committed on his/her premises.\n(4)  It shall not be a defense that the licensee was not personally present on his/her premises at the time such unlawful or\ndisorderly act, conduct or disturbance took place.  However, an agent, servant or employee of the licensee shall not be\nliable hereunder when absent from the premises and not on duty.\n(5)  It shall be unlawful for individuals employed as bartenders to consume alcoholic beverages during those times in\nwhich they are actually engaged in the serving of alcoholic beverages to customers on a licensed premises or for such\nindividuals to engage in the serving of alcoholic beverages to customers on the licensed premises while in an intoxicated\ncondition; or for a licensee having authority to sell alcoholic beverages on his/her premises to permit such conduct by\nhis/her bartenders.  Nothing in this Section shall be construed to prohibit the consumption of alcoholic beverages on a\nlicensed premises by a licensee, his/her agents or employees during such times in which they are not engaged in the\nserving of alcoholic beverages.\n(6)  Any licensee, agent, servant or employee of a licensee who shall violate any of the provisions of this Section shall be\nsubject to the penalty provided for in Section 1-8 of this Code. (Ord. 1269, Sec. 11, 7/2/85.)\nSection 3-15.  Suspension and revocation proceedings.\n(1)  The City Council shall have the power, upon its own motion or upon complaint to:\n            (a)  Summarily suspend any license for a period not to exceed fifteen (15) days, or\n(b)  Upon notice to the licensee and hearing to suspend any license for a period not to exceed six (6) months or to\nrevoke such license.\n(2)  Suspension and revocation proceedings shall be commenced by the Council by issuing and causing to be served upon\nthe licensee a notice of hearing and an order to show cause why his/her license should not be suspended or revoked\nwhenever it shall appear to the Council that there is probable cause to believe that the licensee has violated any law, any\nrule or regulation of the State Licensing Authority, or any of the terms, conditions or provisions of the license issued by the\nLiquor Authority Board.\n(3)  A hearing shall be held at a place and time designated by the Council on the day stated in the notice, or upon such\nother day as may be set for good cause shown.  Evidence in support of the charges shall be given first, followed by cross-\nexamination of those testifying thereto.  The licensee, in person or by counsel, shall then be permitted to give evidence in\ndefense, and in explanation and shall be allowed to give evidence and statements in mitigation of the charges, followed by\ncross-examination of those testifying thereto.  In the event the licensee is found to have committed the violation charged,\nor any other violation, evidence and statements in aggravation of the offense shall also be permitted, followed by cross-\nexamination of those testifying thereto.\n(4)  If the evidence presented at the hearing does not support the charges stated in the notice and order served upon the\nlicensee, but standing alone establishes the guilt of the licensee of a violation of some other law, rule or regulation, the\nlicensee shall be permitted to give evidence and statements in defense, explanation and mitigation if then prepared to do\nso.  If such evidence is not then available, but can be obtained by the licensee, the licensee shall state the substance thereof\nand upon his/her request the hearing may be recessed for not more than ten (10) days, and shall then continue under the\nsame procedure as though no recess has occurred.\n(5)  In the event the licensee is found not to have violated any law, rule or regulation, the charges against him/her shall be\ndismissed. If the licensee is found to have violated some law, rule or regulation, his/her license may be suspended or\nrevoked.\n(6)  Every licensee whose license has been suspended by the City Council shall, if ordered by the Council, post two (2)\nnotices in conspicuous places, one (1) on the exterior and one (1) on the interior of his/her premises, for the duration of the\nsuspension.  The notices shall be twenty-four inches (24\") in length and fourteen inches (14\") in width, and shall be in the\nfollowing form:\nNOTICE OF SUSPENSION\nALCOHOLIC BEVERAGE LICENSES ISSUED\nFor These Premises Have Been\nSuspended by Order Of The\nLOCAL LICENSING AUTHORITY\nFor Violation Of The\nCOLORADO BEER CODE - COLORADO LIQUOR CODE\n(7)  The temporary suspension of a license without notice pending any prosecution, investigation or public hearing as\nprovided for by the provisions of C.R.S. 12-47-110 and 12-46-107, 1973, shall be for a period not to exceed fifteen (15) days.\n (Ord. 973, Sec. 3.8(d).)\nSection 3-16.  Fine in lieu of suspension.\n(1)  (a)  Whenever a decision of the City Council suspending a retail license for fourteen days or less becomes final, whether\nby failure of the retail licensee to appeal the decision or by exhaustion of all appeals and judicial review, the retail licensee\nmay, before the operative date of the suspension, petition the City Council for permission to pay a fine in lieu of having\nhis/her retail license suspended for all or part of the suspension period.  Upon receipt of the petition, the City Council may,\nin its sole discretion, stay the proposed suspension and cause any investigation to be made which it deems desirable and\nmay, in its sole discretion, grant the petition if it is satisfied:\n(I)    That the public welfare and morals would not be impaired by permitting the retail licensee to operate during the\nperiod set for suspension and that payment of the fine will achieve the desired disciplinary purposes;\n(II)   That the books and records of the retail licensee are kept in such a manner that the loss of sales of malt\nbeverages which the retail licensee would have suffered had the suspension gone into effect can be determined with\nreasonable accuracy therefrom; and \n(III)  That the retail licensee has not had his/her license suspended or revoked, nor had any suspension stayed by\npayment of a fine, during the two years immediately preceding the date of a motion or complaint which has resulted\nin a final decision to suspend the retail license.\n            (b)  The fine shall be equivalent to twenty percent (20%) of the retail licensee's estimated gross revenues from sales\nof malt, vinous and spirituous liquors or fermented malt beverages during the period of the proposed suspension; except\nthat the fine shall not be less than Two Hundred Dollars ($200.00) nor more than Five Thousand Dollars ($5,000.00).      \n  \n            (c)  Payment of any fine pursuant to this section shall be in the form of cash or in the form of a certified check or\ncashier's check payable to the City.\n(2)  Upon payment of the fine pursuant to this section, the City Council shall enter its further order permanently staying\nthe imposition of the suspension.  The City Council shall cause such monies to be paid into the City's general fund.\n(3)  In connection with any petition pursuant to this Section, the authority of the City Council is limited to the granting of\nsuch stays as are necessary for it to complete its investigation and make its findings and if it makes such findings, to the\ngranting of an order permanently staying the imposition of the entire suspension or that portion of the suspension not\notherwise conditionally stayed.\n(4)  If the City Council does not make the findings required in paragraph (a) of Subsection (1) of this section and does not\norder the suspension permanently stayed, the suspension shall go into effect on the operative date finally set by the City\nCouncil. (Ord. 1359, 7/18/89)\nSection 3-17.  Penalty for violations.\nThe holder of any license for the sale of malt, vinous or spirituous liquors dispensing establishments found guilty of\nviolating any of the ordinances of the City relating to the conduct of his/her place of business shall be subject to the penalty\nin Section 1-8 of this Code.  (Ord. 2071, Sec. 3-17, amended, eff. 1/12/19)\nSection 3-18.  Prohibited acts; penalty. (Ord. 1678, Sec. 3-18, repealed and reenacted, eff. 12/28/01)\n(1) Except as may be authorized through approval of a Fermented Malt Beverage license, Special Event Permit or\nEntertainment District Event Permit, no person shall carry or have in his/her possession any open bottles or containers\ncontaining fermented malt beverages, or malt, vinous or spirituous liquors, nor shall any person consume any fermented\nmalt beverages, or malt, vinous or spirituous liquors on any street, sidewalk, parking lot, alley or any public school or\npublic park in the City, or in any automobile or other vehicle on a public way or public parking lot in the City, or as\notherwise authorized in this Chapter. (Ord. 2071, Sec 3-18(1), repealed and re-enacted eff. 1/12/19)\n(2) No person shall carry or have in his/her possession any open bottles or containers containing malt, vinous or\nspirituous liquors, nor shall any person drink any malt, vinous or spirituous liquor at the Trinidad Municipal Golf Course\nunless a valid liquor license that would allow for open consumption is in effect, and alcohol beverages are obtained solely\nfrom that licensee. (Ord. 2012, Sec 3-18(2), repealed and reenacted, eff. 7-29-16)\n(3)  Nothing in this section shall prohibit the POSSESSION OR consumption of fermented malt beverages at the UPPER\nFIELD BASEBALL FACILITY OF CENTRAL PARK DURING, OR IN ASSOCIATION WITH, NON-YOUTH BASEBALL\nGAMES, SUBJECT TO THE RESTRICTIONS SET FORTH IN § 12-47-901(1)(h)(I), C.R.S. (Ord. 1926, Secs 3 and 4, eff.\n3/6/12)\n(4) Every person convicted of any violation of this Section shall be punished by a fine of not more than Three Hundred\nDollars ($300.00) or by imprisonment of not more than ninety (90) days, or by both such fine and imprisonment.  (Ord.\n1926, Secs 3 and 4, eff. 3/6/12)\nSection 3-19.  Liquor license application fees. (Ord. 3062, Sec. 3-19 repealed and reenacted, eff. 2/17/23)\nThe application fees for license applications to cover actual and necessary expenses shall be as follows: \n   \n(1)          New license - One Thousand Dollars ($1,000.00)\n(2)         Transfer of ownership - Seven Hundred Fifty Dollars ($750.00)\n(3)         Renewal of license - One Hundred Dollars ($100.00)\n(4)         Renewal of expired license – Five Hundred Dollars ($500.00)\n(5)         Annual Art Gallery Fee, One Hundred Dollars ($100.00)\n(6)         Late Renewal, not more than 90-days of license expiration date – Five Hundred Dollars ($500.00)\n(7)         Reissue Fee, more than 90-days but less than 180-days of license expiration date – Five Hundred Dollars\n($500.00)\n(8)         Reissue Fine, more than 90-days but less than 180-days of license expiration date – Twenty-Five Dollars ($25.00)\na day beyond 90-day expiration date\nThe additional allowable fees to cover actual and necessary expenses shall be as follows: \n(1)          Change of location – Seven Hundred Fifty Dollars ($750.00)\n(2)         Corporate/LLC Change Per Person – One Hundred Dollars ($100.00)\n(3)         Manager Registration (Hotel & Restaurant; Tavern; Lodging & Entertainment;   Campus Liquor Complex – Thirty\nDollars ($30.00)\nSection 3-20.  Fees for Special Events Permits. (Ord. 3062, Sec. 3-20 repealed and reenacted, eff. 2/17/23)\nSpecial events permit fees for organizations and political candidates qualifying under state law for the sale, by the drink\nonly, of fermented malt, or malt, spirituous and vinous liquors shall be as follows, to cover the expenses of investigation\nand issuance of the permit:\n(a)         Malt, Vinous and Spirituous – Seventy-Five Dollars ($75.00) per day\n(b)         Fermented Malt Beverage – Seventy-Five Dollars ($75.00) per day\nSection 3-21.  Optional premises standards. (Ord. 1638, Sec. 3-21, eff. 8/11/00)\nThe following standards for the issuance of optional premises licenses and for optional premises for a hotel and restaurant\nlicense are hereby adopted:  \n(1) The standards adopted herein shall be considered in addition to all other standards applicable to the issuance of\nlicenses under the Colorado Liquor Code for an optional premises license and for optional premises for a hotel and\nrestaurant license.  These two types of licenses for optional premises shall be collectively referred to as “optional premises”\nin these standards unless otherwise provided.  \n(2) Outdoor sports and recreational facility shall mean a golf course.  \n(3) An optional premises may only be approved when that premises is located on or adjacent to an outdoor sports and\nrecreational facility.  \n(4) When submitting a request for the approval of an optional premises an applicant shall submit the following\ninformation in addition to information required by the State licensing authority and this\nChapter of this Code:  \n(a) A detailed diagram of the outdoor sports and recreational facility showing:  \n(I)        The location of the outdoor sports and recreational facility;  \n                        (II)       The location of all proposed optional premises;    \n                               \n(III)      The proposed locations of any permanent, temporary or movable structure or vehicle located on an\noptional premises and used to dispense alcoholic beverages;  \n                        (IV)     The seating, if any;  \n                        (V)      Restroom facilities, if any;  \n                        (VI)     Restrictions, if any, to access to the optional premises;  \n                        (VII)    Location of secured area or areas for use in storing malt, vinous and spirituous liquors for future use\non the optional premises.  \n(b) A written statement setting forth what will be done to secure the optional premises and\nstorage area or areas and the reason why the license should be granted; and  \n            (c) Such other information as reasonably may be required to satisfy the City that control of the optional premises\nwill be assured, and that the health, safety and welfare of the neighborhood and outdoor sports and recreational users will\nnot be adversely affected should the license be issued.  \n(5) If the applicant does not own the proposed optional premises, he/she shall submit to the City Clerk a written statement\nby the owner of the premises approving the application sought.  \n(6) The applicant shall provide the City Clerk with evidence that the State Licensing Authority has approved the location\nproposed to be optional premises, as required by the Colorado Liquor Code.  \n(7) An application for a new hotel and restaurant license with optional premises shall be processed in the same manner as\nany other hotel and restaurant license application.  If an application to use optional premises is filed in connection with an\nexisting hotel and restaurant license, then the application shall be processed in the same manner as an application to\nmodify or expand licensed premises.  No fee shall be required in connection with an application for an optional premises\nrelating to an existing hotel and restaurant license.  \n(8) No one licensee shall have more than four (4) optional premises within an outdoor sports and recreational facility.  \n(9) No alcoholic beverages may be served on the optional premises until the licensee has provided notice to State and Local\nLiquor Licensing Authorities forty-eight (48) hours prior to serving alcoholic beverages on the optional premises.  Such\nnotice must contain the specific day and hours on which the optional premises are to be used.  In this regard, there is no\nlimitations on the number of days which a licensee may specify in each notice.  However, no notice may specify any date of\nuse which is more than 180 days from the notice date.  \nSection 3-22.            Liquor Tasting Permits. (Ord. 1911, Sec. 3-22 eff. 1/28/11)\n(1)  Authorization.  The City Council is authorized to issue permits for alcoholic beverage tastings, as defined by the\nColorado Liquor Code, § 12-47-101 et seq., C.R.S., to a retail liquor store licensee or liquor-licensed drugstore licensee,\nsubject to the provisions of the Colorado Liquor Code and this Section.  \n(2)  Permit required.  It shall be unlawful for any person to conduct a tasting without first having obtained a valid tastings\npermit as provided in this Section.   \n(3)  Application Requirements.   \n(a)       Application for a tastings permit shall be made to the Office of the City Clerk upon forms provided by the\nOffice of the City Clerk.  Applications shall provide a schedule of dates and times that tastings will be held, and such\nother information as reasonably may be required to satisfy the City Council that tastings will be conducted without\nviolations of the Colorado Liquor Code and without creating a public safety risk to the neighborhood.  Tasting\nschedules shall not exceed one (1) year in duration\n(b)       An application to conduct a tasting or tastings must be submitted to the Office of the City Clerk no later than\nthirty (30) days prior to the date of the first tasting included in the permit.  At the time of permit application, the\nOffice of the City Clerk shall collect a permit application fee in the amount of Fifty Dollars ($50.00) to cover\nexpenses associated with investigation and issuance of the permit.  \n(c)       Any additions or changes to a schedule submitted with an application must be submitted in writing to the\nOffice of the City Clerk no later than thirty (30) days prior to the date(s) to be added or changed.  \n(d)       No application for a tasting permit shall be approved if the licensee has had his or her license suspended or\nrevoked, or had any suspension held in abeyance or stayed by payment of fine, during the six (6) month period\nimmediately preceding the date of the application.  (Ord. 1911, Eff. 1-28-11)\n(e)       Any of the disciplinary actions detailed in paragraph (d) of this subsection shall result in the cancellation of\nany scheduled tasting dates pending the City Council’s approval of a new application\n(4)       Limitations on Tastings.  Tastings shall be conducted in conformance with §44-3-301 (10), C.R.S. (Ord. 2071, Sec 3-\n22 (4), amended eff. 1/12/19)\nSection 3-23.            Alcohol beverage festival permit standards. (Ord. 3037, Sec. 3-23, eff. 5/13/22)\nThe following standards for the approval of an alcohol beverage festival permit are hereby adopted:\n(1) The standards adopted herein shall be considered in addition to all other standards applicable to the issuance of\nlicenses under the Colorado Liquor Code for an alcohol beverage festival permit and a City of Trinidad Special Events\nPermit pursuant to Chapter 21 and Chapter 3, Alcoholic Beverages, of the Trinidad Municipal Code.\n(2) Permit required. It shall be unlawful for any licensee to conduct a festival without having first obtained a valid alcohol\nbeverage festival permit as provided by this Section.\n(3) Application requirements.\n(a) A copy of the complete Alcohol Beverage Festival Permit Application with all required attachments for every\nfestival to be held within the City’s corporate limits shall be filed with the City Clerk on the form provided by the\nState Liquor Licensing Authority, no later than thirty (30) days before the proposed festival if it is to be held on\nprivate property. (Ord. 3093, Sec. 3-23(3)(a) amended, eff. 5/17/24)\n(b) If an alcohol beverage festival is proposed to be held on public property necessitating the permission of the City\nof Trinidad, a copy of the complete Alcohol Beverage Festival Permit Application with all required attachments for\nevery alcohol beverage festival to be held within the City’s corporate limits shall be filed with the City Clerk on the\nform provided by the State Liquor Licensing Authority, no later than forty-five (45) days before the proposed festival.\nShould the proposed alcohol beverage festival be sought on City property, the applicant shall be required to conform\nto the requirements set forth in Chapter 21, Special Events, of the Trinidad Municipal Code.\n(4) Limitations on alcohol beverage festivals. The following limitations for alcohol beverage festival permits are hereby\nadopted (the limitation of which only applies to alcohol beverage festivals without consideration to other Special Event\npermitted functions):\n(a) Alcohol beverage festivals on main throughfare public rights-of-way will be limited to four (4) per calendar year.\n(i) Main throughfares include Main Street, Commercial Street, Santa Fe Trail, Nevada Avenue, and Animas\nStreet\n(b) Alcohol beverage festivals on non-main throughfare public rights-of-way will be limited to eight (8) per calendar\nyear.\n(c) Alcohol beverage festivals in public parks will be limited to eight (8) per calendar year.\n(d) Where an alcohol beverage festival occurs on a throughfare and also encompasses a park, the alcohol beverage\nfestival shall be counted against the total number of allowable events on the throughfare.\n(e) Alcohol beverage festivals on private property shall not be limited except as otherwise limited pursuant to C.R.S.\n§44-3-404.\n(f) Due to the limitations in number of alcohol beverage festivals on public property and the draw on public\nresources, alcohol beverage festivals should be coordinated so as to be inclusive with other allowable licensees.\n(g) Due to the limitation of City resources, particularly with respect to public safety, consideration will be given by\nthe City in all instances in its approval or disapproval of applications. Except under exceptional circumstances, only\none alcohol beverage festival permit shall be granted per weekend.\n(h) Applicants must provide security by a private source, with full coordination and cooperation with the Trinidad\nPolice Department.\n(i) Use of public property is subject to a refundable deposit of $3,000, should there be no damage to the public\nproperty or neighboring private property.\n(j) Insurance will be required for Alcohol Beverage Festivals on all public property in accordance with Trinidad\nMunicipal Code, Chapter 21, Special Events.\n(k) Notification to businesses within the alcohol beverage festival area, when held on public property, must be\naccomplished by the applicant no less than 20 days prior to the alcohol beverage festival. The applicant is required to\nprovide written proof of notification to those businesses to the City Clerk no less than 10 days prior to the event.\nAlcohol beverage festival area is defined as that area abutting the outside perimeter of and all of that area within the\nsecured perimeter of the alcohol beverage festival, which may be affected by reduced and/or increased motorist\nand/or pedestrian traffic due to the event.\n(l) A safety and security plan for each alcohol beverage festival must be submitted with the application.\n(m) In accordance with C.R.S. §44-3-404, if a violation of the Colorado Liquor Code or Trinidad Municipal Code,\nAlcohol Beverages, occurs during an alcohol beverage festival and the licensee responsible for the violation can be\nidentified, the state or local licensing authority may charge and impose appropriate penalties on the licensee.\n(n) Alcohol beverage festivals may only be held on property zoned as Community Commercial, Historic Preservation\nand in Commercial property of a PUD.\n(o) Licensees participating in an alcohol beverage festival are obligated at all times to immediately report to the\npolice department any unlawful or disorderly act or conduct or any disturbance committed upon the alcohol\nbeverage festival premises.\n(5) Decision by City Clerk. The City Clerk in coordination with all pertinent municipal departments shall administratively\nprocess and approve, conditionally approve or deny alcohol beverage festival permit applications, or may refer the\napplication to the City Council who shall approve, conditionally approve, or deny alcohol beverage festival applications.\nThe City Clerk may impose reasonable terms and conditions on a licensee seeking an alcohol beverage festival permit as\nmay be necessary to protect the public health, safety and welfare or to obtain or ensure compliance with this Article, this\nCode and applicable state law. The City Clerk shall provide written notice of his or her decision, including the reason(s)\ntherefor, by first-class, postage-prepaid U.S. mail and/or by email to the Applicant at the address shown in the application.\nAn Applicant whose alcohol beverage festival application is denied or conditionally approved may appeal the Clerk’s\ndecision to the Authority by filing written notice of appeal with the City Clerk within five (5) days of the date of issuance of\nthe decision. The City Clerk shall cause the appeal to be placed on the next regular City Council meeting for consideration\nof the same.\n(6) Decision by Authority. If the City Clerk refers an alcohol beverage festival permit to City Council as the local licensing\nauthority, the Clerk shall cause the alcohol beverage festival application to be placed on the next regular meeting agenda of\nthe Council following receipt by the Clerk. The applicant shall be in attendance at the Council meeting at which his/her\nalcohol beverage festival application is presented to the Council. At the time of presentation of the alcohol beverage festival\napplication, the Council shall be furnished with all pertinent information to assist in rendering their decision.\n(7) Denial. The City Clerk and/or the Authority may refuse to approve an alcohol beverage festival permit for any of the\nfollowing reasons: Failure to comply with City, State or Federal Building Codes, Fire Codes or Electrical Codes; a history of\nviolations of the Colorado liquor code or Trinidad Municipal Code, or liquor rules; any other reasons set forth under State\nor local law; and any other good cause reasons.\n(8) Prevailing Code. If any language herein is contrary to or in conflict with that contained in Chapter 21, Special Events,\nthe provisions and requirements of this section shall prevail. This Section 3-23 is intended to supplement the\nrequirements contained in Chapter 21 and mesh harmoniously with the same.\n"
}