{
    "chapter": "Chapter 8 - Fire Prevention",
    "content": "Chapter 8 - Fire Prevention\nARTICLE 1. INTERNATIONAL FIRE CODE.\nSections:\n8-1                   International Fire Code.\nARTICLE 2.  GENERAL PROVISIONS.\n8-4                   Fire Department – Creation and membership.\n8-5                   Firefighters – Uniforms.\n8-6                   Inspection of buildings and other premises; order to abate.\n8-7                   Destruction of buildings to check fire.\n8-8                   Spectators at fire to obey orders.\nARTICLE 3. FIREWORKS.\n8-9                   Fireworks – Casting, throwing or firing.\n8-10                 Fireworks – Exhibition and possession.\n8-11                 Fireworks – Defined.\n8-11.1              Seizure of fireworks.\n8-12                 Exemptions from prohibitions.\n8-13                 Penalty for violation.\nCHAPTER 8.  FIRE PREVENTION .\nARTICLE 1. INTERNATIONAL FIRE CODE.\n(Ord. 2061, Article 1, repealed and reenacted, eff. 7-13-18)\nSection 8-1. International Fire Code.\n(1) The International Fire Code, 2018 Edition, including Appendix Chapters B, C and D, as published by the International\nCode Council, 500 New Jersey Avenue, NW, 6th Floor, Washington, DC 20001 (headquarters), is hereby adopted by\nreference as the Fire Code of the City of Trinidad, Colorado, as if fully set forth in this ordinance, together with the\nadditions, insertions, deletions, and changes prescribed in this Section. At least one (1) copy of said International Fire\nCode, 2018 Edition, shall remain on file in the Office of the City Clerk and open to public inspection.\n(2) The following sections of the International Fire Code, 2018 Edition (“IFC”), are hereby revised:\n(a) Amend IFC § 101.1, Title, as follows: insert: “the City of Trinidad, Colorado” where indicated.\n(b) Amend IFC § 105.2, Application, to read:  Application for a permit for new construction or remodeling of existing\nstructures is required by this code and shall be made to the fire code official or the Chief Building Official in such\nform and detail as prescribed by the fire code official and/or the Chief Building Official.  Applications for permits\nshall be accompanied by such plans as prescribed by the fire code official and the Chief Building Official as set forth\nin Chapter 5, Section 5-7 regarding the International Building Codes as adopted by the City of Trinidad, Colorado.\n(c) Amend IFC §110.4, Violation penalties, to read: Persons who shall violate a provision of this code or shall fail to\ncomply with any of the requirements thereof, or who shall erect, install, alter, repair, or do work in violation of the\napproved construction documents or directive of the fire code official, or of a permit or certificate used under\nprovisions of this code, shall be subject to penalties as prescribed in Chapter 1, Sections 1-8 and 1-9 of the Code of the\nCity of Trinidad, Colorado\n(d) Amend IFC §112.4, Failure to comply, to read: Any person who shall continue any work after having been served\nwith a stop work order, except such work as that person is directed to perform to remove a violation or unsafe\ncondition, shall be liable for a fine of not less than Three Hundred Dollars ($300.00) nor more than Two Thousand\nSix Hundred Fifty ($2,650.00).\n\n(e) Amend IFC §5704.2.9.6.1, Locations where above-ground tanks are prohibited, to read: The storage of Class I and\nII liquids in above-ground tanks outside of buildings is prohibited within all zoning classifications, except areas\nencompassed by the Industrial Zone district and only by special use permit.\n(f) Amend IFC §5706.2.4.4, Locations where above-grounds tanks are prohibited, to read: The storage of Class I and\nII liquids in above-ground tanks is prohibited within all zoning classifications, except areas encompassed by the\nIndustrial Zone district and only by special use permit.\n(g) Amend IFC §5806.2, Limitations, to read: The storage of flammable cryogenic fluids in stationary containers\noutside of buildings is prohibited within all zoning classifications, except areas encompassed by the Industrial Zone\ndistrict and only by special use permit.\n(h) Amend IFC §6104.2, Maximum capacity within established limits, to read:\nWithin the limits established by law restricting the storage of liquefied petroleum gas for the protection of heavily\npopulated areas, the aggregate capacity of any one installation shall not exceed a water capacity of 2,000 gallons\n(7570 L). Such storage is prohibited within all zoning classifications, except areas encompassed by the Industrial\nZone district and only by special use permit.\nARTICLE 2. GENERAL PROVISIONS.\nSection 8-4.  Fire Department – Creation and membership.\n(1)   There is created a Fire Department which shall consist of a Chief and as many firefighters necessary to properly\nhandle and manipulate the apparatus of the Department, to provide adequate fire protection for the citizens of the City of\nTrinidad.  Such protection shall be extended to the Trinidad Industrial Park and may be otherwise extended beyond the\ncorporate limits of the City by contractual relationship with fire district corporations or other legal entities.\n(2)   The City Manager shall by rules and regulations define the duties, functions and powers of the Fire Department.\nSection 8-5.  Firefighters – Uniforms.\nAll members of the Fire Department are required to dress in such uniform as is or may be prescribed by Department Rules\nand Regulations.  Uniforms shall be kept in a neat and clean condition and shall be worn at all times during hours of duty.\nSection 8-6.  Inspection of buildings and other premises; order to abate.\n(1)   It shall be the duty of the Fire Department to inspect as often as may be necessary, all buildings, premises and public\nthoroughfares, except the interiors of private dwellings, for the purpose of ascertaining and causing to be corrected any\nconditions liable to cause fire, or any violations of the provisions or intent of any ordinance of the City pertaining to fire\nhazards.\n(2)   Whenever any Fire Department personnel shall find in any building or upon any premises or other place, combustible\nor explosive matter or dangerous accumulation of rubbish or unnecessary accumulation of water paper, boxes, shavings, or\nany other highly inflammable materials, and which is so situated as to endanger life or property, or shall find obstructions\nto or on fire escapes, stairs, passageways, doors or windows, liable to interfere with the operations of the Fire Department,\nor egress of occupants, in case of fire, he/she shall order the same to be removed or remedied.  Such order shall be issued\nin conformance with the procedures set forth in Section 16-64 of this Code.\nSection 8-7.  Destruction of buildings to check fire.\nIn the process of combating a structure fire, the Chief of the Fire Department, or in his/her absence, his/her\nrepresentative, may order any buildings that are in close proximity thereto to be removed or otherwise disposed of, for the\npurpose of checking such structure fire.\nSection 8-8.  Spectators at fire to obey orders.\nEvery person in the immediate vicinity of a fire, shall be subject to any obedient to any lawful order of the Chief or any\nfirefighter in extinguishing the fire and removing the protecting property, and any person who shall neglect or refuse such\norders shall be guilty of a misdemeanor.\nARTICLE 3. FIREWORKS.\n(Ord. 1792, Article 3, repealed and reenacted, eff. 7/1/05)\nSection 8-9.   Fireworks - Casting, throwing or firing.\nIt shall be unlawful for any person to cast, throw or fire any fireworks of any kind within the corporate limits of the City.\n (Ord. 1792, eff. 7/1/05; Ord. 1267, Sec. 1, 5/21/85)\nSection 8-10.  Fireworks - Exhibition and possession.\nIt shall be unlawful for any person to exhibit or have in his/her possession with intent to use, give away or sell or offer for\nsale, any fireworks of any kind. (Ord. 1792, eff. 7/1/05; Ord. 1267, Sec. 1, 5/21/85)\nSection 8-11.   Fireworks - Defined. (Ord. 1898, Sec. 8-11 repealed and reenacted, eff. 5/28/10)\n(1) “Fireworks” as used in Sections 8-9, 8-10, and 8-11.1 shall mean any article, device, or substance of a combustible or\nexplosive composition, or any substance or device prepared for the purpose of producing a visible or audible effect by\ncombustion, explosion, deflagration, or detonation.  Fireworks include, but are not limited to, blank cartridges, toy pistols,\ntoy canes, or toy guns in which explosives are used where the explosive content of the device or cap exceeds sixteen\nmilligrams of pyrotechnic composition per item; firecrackers; torpedoes; sky rockets; Roman candles; cone and cylindrical\nfountains; spinning wheels; ground or aerial spinners; illuminating torches and colored fire in any form that utilizes a\npyrotechnic composition; explosive auto alarms; chasers; toy propellant devices and toy smoke devices; cigarette loads;\ntrick matches; trick noisemakers; any device containing an explosive or flammable compound; any tablet or device\ncontaining an explosive or flammable compound; any tablet or device containing an explosive substance, and any other\ndevice of like construction.\n(2) “Fireworks” shall not include:\n(a) Toy caps which do not contain more than sixteen milligrams of pyrotechnic composition per item , or toy pistols,\ntoy canes, toy guns, or other devices for use with such caps.\n(b) Party poppers containing not more than sixteen milligrams of pyrotechnic composition per item that is friction\nsensitive; and snappers containing not more than one milligram of explosive composition per item.\n(c) Highway flares, railway fuses, ship distress signals, smoke candles, or any other emergency signal devices only\nwhen used for emergency purposes.\n(d) Dipped sticks and sparklers, the total pyrotechnic composition of which does not exceed one hundred grams, of\nwhich the composition of any chlorate or perchlorate shall not exceed five grams.  However, it shall be unlawful for\nany person under sixteen years of age to possess or use dipped sticks or sparklers unless such person is under adult\nsupervision.  It shall further be unlawful for any person under sixteen years of age to purchase dipped sticks or\nsparklers, or for any person to knowingly sell dipped sticks or sparklers to any person under sixteen years of age.\n(e) Snake and glow worm pressed pellets of not more than two grams of pyrotechnic composition and packaged in\nretail packages of not more than twenty-five units.  However, it shall be unlawful for any person under sixteen years\nof age to possess or use such snake or glow worm pressed pellets unless such person is under adult supervision.  It\nshall further be unlawful for any person under sixteen years of age to purchase snake or glow worm pressed pellets,\nor for any person to knowingly sell snake or glow worm pressed pellets to any person under sixteen years of age.\nSection 8-11.1 Seizure of fireworks.\nPersonnel of the City’s Police and Fire Departments are authorized to seize, destroy or otherwise dispose of all fireworks\nused or possessed in violation of Sections 8-9 and 8-10 of this Code.   (Ord. 1792, eff. 7/1/05; Ord. 1963, eff. 6/28/02, Ord.\n1726, 6/13/03)\nSection 8-12.  Exemption from prohibitions.\nThe provisions of Sections 8-9, 8-10, and 8-11.1 shall not apply to any public or private demonstration or display of\nfireworks of any kind so long as a permit shall first be obtained from the Fire Chief.  The Fire Chief shall determine that\nsuch demonstration or display will be conducted in a manner that is not deemed to be hazardous to life or property.  In\norder to ensure compliance with said permit, the demonstration shall be conducted under Fire Department supervision.  \n(Ord. 1792, eff. 7/1/05; Ord. 1267, Sec. 4, 5/21/85)\nSection 8-13.   Penalty for violation.\nAny person who violates Sections 8-9 or 8-10 shall, upon conviction, be sentenced as provided in Section 1-8 and subject\nto the terms of Section 8-12.  (Ord. 1792, eff. 7/1/05; Ord. 1267, Sec. 5, 5/21/85)\n"
}