{
    "chapter": "Chapter 12 - Municipal Utilities",
    "content": "Chapter 12 - Municipal Utilities\nARTICLE 1.  UTILITY BILLING.\nSections:   \n12-1                             Initiation of utility service.   \n12-2                             Utility billing.   \n12-3                             Termination of utility service.  \n12-4                             Discontinuance of utility service.  \n12-4.1                          Complaints and related matters.   \n12-4.2                          Utility rates and finances.   \nARTICLE 2.  ELECTRICITY.    \n \n12-5                             National Electrical Code - Adoption by Reference.   \n12-6                             Modifications and additions.   \n12-7                             Penalty for violation.   \n12-8                             Contractor to furnish plans to Power and Light Department.   \n12-9                             Disconnecting wires in emergency.   \n12-10                           Illegal acts.   \n12-11                           Meter deposits; meter ownership.   \n12-12                           Rates for electrical energy.   \n12-13                           Establishment of Electric Light and Power Fund; sources.  \n12-14                           Purposes of Electric Light and Power Fund.   \n12-15                           City to pay for service.   \n12-16                           Electric system to pay own expenses.   \n12-17                           Connection and extensions.   \n12-18                           Compliance with regulations; discontinuance of service for violation.   \n12-19                           Granting rights-of-way and right to alter vegetation.   \n12-20                           Avoiding compliance with Article or payment of charges.   \n12-21                           Establishment of the Arkansas River Power Authority as a separate governmental entity.   \n12-22                           Successor to the non-profit corporation.   \nARTICLE 3. NATURAL GAS.  \n \n12-23                           Article title and citation.   \n12-24                           Trinidad Municipal Natural Gas Department and office of Superintendent created.  \n12-25                           Trinidad Municipal Natural Gas Department – operation and maintenance.  \n12-26                           Service classifications, rates, charges, and regulations – adoption of tariff.  \n12-27                           Natural Gas Fund – creation; purposes.   \n12-28                           Natural gas system to be self-sufficient.   \n12-29                           Tampering with gas system devices prohibited.\n12-30                           Applicability of Article; exception.   \nARTICLE 4.  SEWERS.  \n  \n12-46                           Purpose, policy, definitions and abbreviations.   \n12-47                           Deposit of objectionable wastes unlawful.\n12-47.1                        Discharge of untreated, polluted waters unlawful. \n12-47.2                        Discharge of waters into sanitary sewer prohibited.  \n12-48                           Disposal facilities to conform to Article.   \n12-49                           Prohibited discharges; exceptions.  \n12-50                           Prohibited wastes; control of discharge.  \n12-51                           Interceptors required; construction standards; maintenance of interceptors required.\n\n12-52                           Connection with sewer system – When required.\n12-52.1                        Sewer construction – Apportioning cost as to property benefitted.  \n12-52.2                        No permit to connect sewers until assessments paid.   \n12-53                           Sewage service rates.   \n12-54                           Sewer main taps.   \n12-55                           Sewer system extensions.   \n12-56                           General requirements for main extensions.   \n12-57                           Elements in planning, constructing and financing main extensions.   \n12-57.1                        Additional requirements.   \n12-57.2                        Violations; liability.   \nARTICLE 5.  WATER.  \n    \n12-58                           Definitions.   \n12-59                           Water Department created; duties of City Manager; power of City Council.   \n12-60                           Customer to abide by contract.   \n12-61                           Use of water during fire alarm prohibited.   \n12-62                           Water use restrictions.   \n12-63                           Priority of City users over outside users.   \n12-64                           Standpipes and fire lines.   \n12-65                           Metered service.  \n12-66                           Location of water meters.   \n12-67                           Plant Investment Fee.   \n12-68                           Charge for private fire hydrants.   \n12-69                           Water main taps.\n12-70                           Water system extensions.   \n12-71                           General requirements for main extensions.  \n12-72                           Elements in planning, constructing and financing main extensions.\n12-73                           Exemption from front foot charges.   \n12-74                           Water service rates - Schedule.   \n12-75                           Regulations part of contract.\n12-76                           Unlawful acts.   \n12-77                           Right of City to shut off water in mains; precautionary measures by customer; Nonliability of City.   \n12-78                           Right of entry to repair; notice to owner to make repairs.\n12-79                           Using water in violation of sprinkling restrictions.   \n12-80                           Using water or appurtenances without authority.   \n12-81                           Polluting water in waterworks; obstructing conduits.   \n12-82                           Polluting water source prohibited.   \n12-83                           Injuring or damaging waterworks property.   \n12-84                           Covering up curb box.   \n12-85                           Permit to re-sell water.   \nCHAPTER 12.  MUNICIPAL UTILITIES.  \n  \nARTICLE 1.         UTILITY SERVICE AND BILLING.   \n(Ord. 1867, Article 1 repealed and re-enacted, eff. 11/28/08)  \nSection 12-1. Initiation of utility service.    \n \n    (1) Application for utility service.  \n \n    (a) All applications for electrical, natural gas, sewer, and/or water service from the City shall be made in writing to\nthe Finance and Accounting Department prior to the provision of utility service to the applicant(s). If convenient,\neach applicant shall apply in person. The application for utility service shall generally conform to Form No. 1\nattached to this Section 12-1 and shall indicate the type(s) of service requested, the date on which service connection\nis desired, and any other information required by the City. The City shall require each applicant to provide some\nform of identification. The application itself shall in no way obligate the City to provide utility service to the\napplicant(s).\n    (b) Applications for utility service shall meet the following signature requirements:  \n \n    (i) The application must be signed by adults over eighteen (18) that reside at the premises for which utility\nservice is requested.  \n \n    (ii) If the applicant is the owner of rental property, the application must be signed by all owners of record of\nsuch property.    \n    (iii) If the premises for which utility service is requested are to be used for commercial rather than residential\npurposes, the application or applications must either be signed by all of the tenants of such location, or by all of\nthe owners of record.    \n    (iv) If the applicant is a corporation, the application must be signed by a person duly authorized to act on\nbehalf of the corporation.  \n \n    (v) If the applicant is a partnership, the application must be signed by all partners.  \n \n    (c) For large commercial and industrial applicants, a special written agreement may be required in addition to the\napplication for utility service.    \n    (d) An application for utility service shall not be approved if the applicant is delinquent in the payment of any\nutility bills to the City at the time of application.    \n    (e) Delinquency in payment for utility service rendered to a previous occupant of the premises to be served, and\nunpaid charges for services or facilities not ordered by the present or prospective customer, shall not constitute a\nsufficient cause for refusal of services to an applicant; provided, however, the City may decline to provide utility\nservice at the same premises for the use of a delinquent customer by subterfuge in any manner. Subterfuge includes,\nbut is not restricted to, an application for service at a given location in the name of another party by an applicant\nwhose account is delinquent and who continues to reside at the premises.    \n    (f) An application for utility service at premises not currently connected to the City’s distribution system, or a\nrequest for an increase in utility service at premises currently connected to the City’s distribution system, shall be\nconsidered an extension of the City’s distribution system and shall be subject to the terms and conditions of any\napplicable extension policy adopted by the City.  \n    (2) Utility service deposits.  \n \n    (a) Every application for utility service shall be accompanied by a deposit to serve as a guaranty of future payment\nas set forth by the Finance and Accounting Department and approved by the City Manager.  \n \n    (b) The City may, at any time, require any utility customer to pay a deposit if the customer has received one (1) or\nmore discontinuance notifications and the customer’s account has become delinquent. The amount of the deposit\nshould be equal to two (2) times the average monthly utility bill.  \n \n    (c) An applicant who has, at any time, previously had utility service from the City discontinued for non-payment\nshall be required to make a deposit equal to twice the normal deposit, as set forth by the Finance and Accounting\nDepartment and approved by the City Manager, or equal to two times the average monthly bill for those utility\nservices which are requested, whichever is greater.    \n    (d) Monies collected as utility service deposits shall be placed in a trust fund to be used for the sole purpose of\nguaranteeing any unpaid utility bills when utility service is disconnected. When utility service is terminated, any\nremaining deposits shall first be applied to any outstanding utility bill owed by the customer. If such outstanding\nbills are satisfied, the remaining deposit, if any, shall be refunded to the customer.    \n   \n    (e) Any customer of the City's electrical, natural gas, sewer, and/or water service who has maintained an active\nservice account in good standing for such utility service(s) for a continuous period of eighteen (18) months shall have\nthe deposit for each type of utility service refunded in the form of a credit applied against the customer’s utility\naccount during the billing cycle immediately following the completion of the eighteen (18) month period. A\ncustomer's utility account shall be considered in good standing if the customer has not had utility service\ndisconnected for non-payment or is not currently delinquent.\n      \n    (f) In the event that any customer receiving a deposit credit pursuant to Section 12-1(2)(e) subsequently terminates\nany utility service, and later re-establishes that utility account for electrical, natural gas, sewer and/or water service,\nthe customer shall not be subject to the applicable utility service deposit(s) payable at the re-establishment of such\nutility service.\n   \n    (g) In the event that any customer receiving a deposit credit pursuant to Section 12-1(2)(e) terminates any utility\nservice, and later re-establishes that utility account but has not had an active utility account for a long period of time,\nit is necessary to re-establish good standing and the customer shall be subject to the applicable utility service\ndeposit(s) payable at the re-establishment of such utility service.      \n    \n    (3) Notification to the City. Any customer starting the use of service without first notifying the City and enabling the City\nto read the meter will be held responsible for any amount due for service to the premises from the time of the last reading\nof the meter, as shown by the City’s records.   (Ord. 1991, Sec. 12-1 repealed and reenacted, 10/16/15).\n§ 12-1, Form No. 1: Application Form\nAPPLICATION FOR UTILITY SERVICE\nRESIDENTIAL\nOption 1\nCOMMERCIAL\nOption 1\nDATE\nmm/dd/yyyy\nOWN\nOption 1\nRENT\nOption 1\nLANDLORD\nNAME\nSERVICE ADDRESS\nMAILING ADDRESS\nTELEPHONE(HOME)\nTELEPHONE(WORK)\nSection 12-2. Utility billing.\n(1) Consolidated bill for utility service. The City shall consolidate into one (1) bill all rents, rates, taxes, assessments, and\nassociated charges for electrical, natural gas, sewer, and water service, and remit said bill to each customer monthly. For\nbilling purposes, the term “month” shall mean the period between any two consecutive regular readings by the City of the\nmeters at the customer’s premises, such readings to be taken as nearly as may be practicable every thirty (30) days.\nHowever, the City reserves the right to require the payment of bills for service at more frequent intervals. In such event,\nmeters will be read at the intervals specified by the City. If the City is unable to read a meter after reasonable effort, the\ncustomer will be billed on an estimated usage based on the best available information.\n(2) Contents of utility bill. All bills remitted to customers for metered service furnished shall show:\n(a) Net amount due for the previous one-month period, plus any delinquent balance, plus any accrued penalty\ncharges;\n(b) Dates and meter readings beginning and ending the period during which service was rendered;\n(c) A distinct marking to identify an estimated bill;\n(d) An appropriate rate or rate code identification;\n(e) Last date payable after which the bill becomes past due; and\n(f) All other essential facts upon which the bill is based.\n(3) Utility bill due date. The consolidated bill remitted to each City customer shall become due and payable within twenty\n(20) days after the billing date. If the total amount listed in the bill is not paid by 5:00 p.m. on the fifth (5 th ) day after the\ndate it becomes due as indicated in the billing statement, a penalty fee of 1.5 percent of the unpaid balance shall be added\nto such unpaid balance.\n(4) Customer’s receipt of utility bill. The bill will be considered as received by the customer when mailed to, or left at, the\npremises where service is used or at some other location that has been mutually agreed upon. Final bills, special bills, and\nbills for connection or reconnection are due upon presentation. If the customer fails to receive a bill, the City, upon\nrequest, will issue a duplicate.\n(5) Failure to receive a utility bill. The customer is presumed to be aware of the customer’s liability for payment of bills for\nutility service, and failure to receive a utility bill shall not relieve the customer of the obligation to inquire of the City as to\nthe amount.\n(6) Installment payments. Any customer shall be permitted to make installment payments if a bill includes amounts from\npast billing periods arising solely from events under control of the City such as meter malfunctions, billing errors, utility\nmeter reading errors, or failure to read the meter. Any installment payments under the provisions of this rule may extend\nFORM OF IDENTIFICATION PRESENTED\nSOCIAL SECURITY NO.\nUTILITY SERVICE(S) REQUESTED\nELECTRIC\nNATURAL GAS\nWATER\nSEWER\nCOMMENCEMENT DATE\nmm/dd/yyyy\nSIGNATURE(S)\nSubmit\nover a period equal in length to the period during which the errors were accumulated, and shall bear no interest.\n(7) Budget Billing Plan. Utility customers may elect to pay monthly bills for service on a Budget Billing Plan subject to the\nterms and conditions set forth herein. (Ord. 1940, Sec. 12-2(7), repealed and reenacted, eff. 6/28/13)\n(a) Any customer electing the Budget Billing Plan shall pay a monthly amount equal to the minimum of one-eleventh\n(1/11th) of the total utility bills for the most recent twelve (12) months, adjusted to fully reflect any rate increases that\nmay have become effective during said twelve (12) month period. Said monthly payment shall be made for the\nfollowing eleven (11) successive months with the final or twelfth (12th) month’s payment being a settlement amount\nequal to the difference between the total payments made during the prior eleven (11) months and the actual amount\ndue for purchases for the twelve (12) month period. If the settlement amount is a credit balance the City shall issue a\ncredit against the customer’s settlement month utility bill. If the settlement amount is a balance owed by the\ncustomer, the total balance shall be due and payable on the due date indicated on the bill for the settlement month.\n(b)T o be eligible to participate in the Budget Billing Plan, a customer shall meet the following requirements:\n(i) A customer shall have been served by the City at such customer’s current premises for a period of at least\ntwelve (12) consecutive months.\n(ii) The customer shall owe no amounts to the City for electrical, natural gas, sewer, or water service, except for\nthe current bill.\n(iii) The customer shall execute a standard form “Agreement for Budget Billing Plan” at least fifteen (15) days\nprior to the beginning of the Budget Billing Plan year.\n(c) Normal collection procedures shall be applicable if a customer fails to pay the budget billing amount in any\nmonth when due. If the customer fails to pay the budget billing amount following due notice by the City in\naccordance with Section 12-4, the customer shall be removed from the Budget Billing Plan, the entire outstanding\namount of the account shall be due and payable, and utility service to the customer may be discontinued.\n(d) If utility service is discontinued for any reason to a customer on the Budget Billing Plan, the customer shall be\nremoved from the Plan and the entire outstanding amount of the account shall be due and payable.\n(e) The monthly budget billing amount may be adjusted, at the option of the City, for any increase in the City’s rates\nof two percent (2%) or more. Said monthly budget billing amount may also be adjusted at the option of the City if the\ncustomer’s use of electrical, natural gas, sewer, and/or water service increases greater than ten percent (10%). In\nsuch cases, the utility department will notify the utility customer of the need for adjustment.\n(f) The customer may elect to terminate the Budget Billing Plan at any time by notifying the City in writing and by\npaying in full the entire outstanding amount of the account.\n(g) If a customer is removed from the Budget Billing Plan for any reason, the customer shall not be eligible to\nparticipate in the plan again for one (1) year.\n(8) Customer disputes. A customer disputing the correctness of any utility bill should follow the rules governing\ncomplaints as set forth in Section 12-4.1.\nSection 12-3. Termination of utility service.\n         \n    It shall be the responsibility of a customer seeking to terminate utility service to request the City to read the meter.\n Failure to do so shall render the customer liable for payment of all utilities registering by the meter from the date of the\nlast meter reading until such time as the City learns of the termination and is able to read the meter, or is otherwise\nadvised of the meter reading.   \nSection 12-4. Discontinuance of utility service.      \n    (1) Notice of discontinuance.    \n    (a) If any bill for utility services remains unpaid for more than thirty (30) days following the payment due date of the\nbill, utility service may be disconnected with appropriate notification. The City shall not discontinue the utility service of\nany customer for violation of any rule of the City and/or for nonpayment of any amount due for utility service except upon\nwritten notice mailed by first class mail to the last known address of the customer, or delivered to the customer, at least\nthirty (30) days after the issued unpaid bill and at least fifteen (15) days in advance of the proposed discontinuance date,\nadvising the customer as to what rule has been violated and/or the amount past due and the date by which the same shall\nbe paid in order to avoid discontinuance. In the event the customer has previously executed a third-party notification form\nindicating a third party to whom notices of discontinuance are to be sent, written notice also shall be mailed by first class\nmail or delivered at least fifteen (15) days in advance of the proposed discontinuance date to said third party. The notice of\ndiscontinuance shall be conspicuous in nature and in easily understood language. The heading of the notice of\ndiscontinuance shall be in block capital letters. The heading shall contain, at a minimum, the following warning:    \n    THIS IS A FINAL NOTICE OF DISCONTINUANCE OF UTILITY SERVICE AND CONTAINS IMPORTANT\nINFORMATION INVOLVING YOUR LEGAL RIGHTS AND REMEDIES.    \n    The heading shall also contain the same warning in Spanish (below), with an additional sentence at the end of the\nwarning stating in Spanish that, if the customer is unable to read the notice, the customer should seek assistance with\ntranslation:    \n    ESTE ES UN AVISO DE DISCONTINUAR SUS SERVICIOS DE UTILIDADES Y CONTIENE INFORMACIÓN\nIMPORTANTE SOBRE SUS DERECHOS Y RECURSOS LEGALES. SI NO SE PUEDE LEER ESTE AVISO EN INGLÉS, ES\nNECESARIO QUE ALGUIEN LO TRADUZCA.    \n    (Ord. 1991, Sec 12-4 (1)(a), repealed and reenacted, 10/16/15)    \n  (b) At a minimum, said notice shall advise the customer:  \n  (i)  How to contact the City to resolve any dispute with respect to the amount or date due, and/or with respect to\nviolation of any rule.  \n  (ii)  That the customer is entitled to a hearing in person, prior to a discontinuance of service, at a reasonable time\nand place within ten (10) days of the date of the notice of discontinuance before an impartial hearing officer, to\nprotest or dispute the grounds provided for the proposed discontinuance.  \n  (iii)  That the customer has a right to call witnesses and present evidence at the hearing; that the customer has the\nright to review records and evidence against the customer prior to the hearing; that the customer has the right to be\nrepresented by an attorney at the hearing; that the customer has the right to cross-examine any witness appearing on\nbehalf of the Finance and Accounting Department at the hearing; and that the customer is entitled to have an\ninterpreter present at the hearing if same is requested at the time the request for hearing is made.  \n  (iv)  That the customer who is unable to pay for service as regularly billed by the City may avoid termination of\nservice by paying the current month’s bill in full and entering into a reasonable installment plan with the City to pay\nany past-due balance in no more than six (6) equal monthly installments.  \n  (v)  That in the event the customer is unable to pay for service as regularly billed by the City, or is able to pay for\nsuch service but only in reasonable installments, and there is a medical certification delivered to the City indicating\nthat termination of service would be especially dangerous to the health or safety of the customer or a permanent\nresident of the customer’s household, that there will not be discontinuance of service for sixty (60) days from the\ndate of the medical extension.  \n  (c) If the customer does not request a hearing by the date on which the request must be made, and the required payment\nis not made by the proposed date of discontinuance, utility service shall be subject to discontinuance.  \n  (d) If the customer requests a hearing, a hearing shall be scheduled and held as soon as practicable following such\nrequest.  The impartial hearing officer shall be the City Manager and/or the City Manager’s designee.  The hearing shall be\nconducted informally and recorded, said recording to be kept for a period of ninety (90) days.  Within five (5) workdays\nafter the hearing, the hearing officer shall issue a written decision and a statement of the reasons for the decision.  Such\ndecision shall be based entirely on the evidence presented at the hearing.  Utility service shall not be discontinued until\nafter the hearing officer has rendered his or her decision.  \n  (e) Utility service shall not be discontinued:    \n   (i) If all current utility bills are paid when due and all past due amounts are being amortized by reasonable\ninstallment payments.  The due date of the bill must specifically be indicated on the bill and the due date shall be no\nearlier than twenty (20) days subsequent to the mailing or delivery of the bill.  “Current bill” means that portion of\nthe bill which is not twenty (20) days past due.  The minimum reasonable installment payment is that which pays a\ncurrent bill in full and at least one-sixth (1/6  th  ) of any past-due balance.  A reasonable installment payment plan\nmay require that a past-due balance be paid off in no more than six (6) equal monthly installments.   \n   (ii) between 12:00 Noon on Friday and 8:00 a.m. the following Monday, or between 12:00 Noon on the day prior to\nand 8:00 a.m. on the day following any federal holiday or City-observed holiday.   \n   (iii)  during any period when discontinuance of service would be especially dangerous to the health or safety of the\nresidential customer or a permanent resident of the customer’s household, and such customer established that he or\nshe is unable to pay for the service as regularly billed, or he or she is able to pay for such service but only in\nreasonable installments.   \n   Discontinuance of service that would be especially dangerous to the health or safety of the residential customer or a\npermanent resident of the customer’s household means that discontinuance of service would aggravate an existing\nmedical condition or create a medical emergency for the customer or a permanent resident of the customer’s\nhousehold.  Such shall be deemed to be the case when a physician licensed by the State of Colorado makes a\ncertification thereof in writing and said certification is received by the City.   \n   In the event a medical certification, as aforesaid, is delivered to or received by the City, the non-discontinuance of\nservice as herein prescribed shall be effective for sixty (60) days from the date of said medical certification.  One (1)\nthirty (30) day extension of non-discontinuance of service pursuant to this Section 12-4(c)(1)(iii) may be effected by\ndelivery to or receipt by the City of a second medical certification, as aforesaid, prior to the expiration of the initial\nsixty (60) day non-discontinuance period.  A residential customer may invoke the provisions of this Section 12-4(c)\n(1)(iii) no more than once during any period of twelve (12) consecutive months.   \n   (iv)  until the City has made a reasonable effort to give notice of the proposed discontinuance in person or by\ntelephone both to the customer (or to a resident of the customer’s household 18 years of age or over) and to any third\nparty who is listed by the customer on a third-party notification form.   \n   (v)  in the event a customer at any time tenders full payment of any utility bill by cash or bona fide check to a\nservice representative.   \n  (f) Any customer who is mailed a notice of discontinuance shall be assessed a Ten Dollar ($10.00) fee to cover\nadministrative costs in addition to the original amount of the utility bill and any penalty assessed.  \n  (g) Wherever reference is made herein to a notice or other document being mailed or delivered, that phrase shall mean\nthat the notice or other document is either deposited in the United States mails, or physically delivered to the address of\nthe addressee, and does not necessarily include actual physical receipt by the addressee.  \n  (2) Discontinuance under hazardous conditions or meter bypass.  These rules regarding discontinuance of service shall\nnot apply where a meter bypass of any kind is discovered on a customer’s service meter, or where any hazardous condition\nexists on a customer’s premises, or in the case of a customer utilizing utility service in such a manner as to make it\ndangerous for occupants of the premises, thus making an immediate discontinuance of service necessary.  In such\ncircumstances, utility service will be immediately disconnected and will not be reconnected until the customer pays the\nfollowing charges to the City:  \n  (a)  A service charge calculated to compensate the City for all reasonable expenses incurred on account of such\ncondition, including, but not limited to, costs of investigation, disconnection, reconnection, and service calls, but in\nno event less than $40.00; and  \n   \n  (b)  The cost of repairing or replacing any damaged utility equipment; and  \n   \n  (c)  The actual or estimated charges not previously billed to the customer as a result of any tampering, bypassing, or\nunauthorized metering.  \nSection 12-4.1.  Complaints and Related Matters.   \n(1) Scope.     This section sets forth rules governing appeals from the application of any immediate shut-off policy, the\nhandling of complaints of utility customers, and related matters, including the opportunity for such persons to be heard.\n These rules are made in the best interests of the City and its utility customers and shall be liberally construed to secure the\njust, speedy, and inexpensive determination of matters presented under the provisions of applicable law and these rules.\n These rules are intended to be fair and simple, and to settle disputes without complex procedures.  \n(2) Definitions.  \n  (a)  “Customer” shall mean any person who directly receives electrical, natural gas, sewer, and/or water service\nfrom the City.  \n  (b)  “Presiding officer” shall mean the City Manager and/or the City Manager’s designee.  \n   \n  (c)  “Outside customers” shall mean and include electrical, natural gas, sewer, and/or water service customers of the\nCity who or which are served outside the corporate jurisdictional limits of the City.  \n  (3) Forms.     The attached forms are not a part of these rules, but they should be followed whenever possible and\nare intended as a guide.  \n  (4)  Deviation from rules.  So long as not contrary to law, deviation from these rules may be permitted for good\ncause shown or if compliance therewith is found to be impossible, impracticable, or unreasonable, and to promote\nfairness in dealings between the City and its customers.  \n(5)  Pleadings.  \n  (a)  Pleadings hereunder before the City are called “Petitions,” “Formal Complaints,” “Motions,” “Notices,” and\n“Responses.”  A responsive pleading should be filed within ten (10) days, but the presiding officer, in order to\npromote fairness and a full hearing, may make such rulings as are necessary, desirable, or useful to a full and proper\nhearing.  \n  (b)  Pleadings should be typewritten or legibly handwritten on an 8 ½” x 11” sheet of paper.  Pleadings should be\nproperly filed with the City and signed by an authorized person.  A pleading shall state the name and address of the\nparty, identify the proceeding, and set forth a clear and concise statement of the matters relied upon as a basis for\nsuch pleading, together with an appropriate prayer when relief is sought.  \n   \n  (c)  The presiding officer may permit any pleading to be amended or corrected, or any omission therein to be\nsupplied.  Defects which do not affect important rights of a party shall be disregarded.  \n   \n  (d)  No party shall be required to be represented by an attorney.  Pleadings of a party represented by an attorney\nshall be signed by said attorney, and shall set forth his or her attorney registration number, address, and telephone\nnumber.  The signature of an attorney is a certification that he or she has read the pleading; that to the best of his or\nher knowledge, information, and belief there is good ground to support it; and that it is not interposed for purposes\nof delay.  \n(6)  Parties and non-parties. A person who desires to assist in the just and reasonable determination of a proceeding, and\nwho has been permitted by the presiding officer, may be permitted to do so; however, such person may only present legal\nargument, either orally or in writing as permitted by the presiding officer.          \n(7) Representation of parties. An individual who is a party to a proceeding and who wishes to appear by himself may\nrepresent only his own individual interest in said proceeding.  A business entity of any type that is a party to a proceeding\nmay be represented by its owner or any officer, manager, or duly-authorized employee.  A party to a proceeding, other than\na party appearing by himself, may be represented by an attorney, but need not be.          \n(8) Changes affecting outside customers.  When the City proposes to change any base rate, charge, or service to outside\ncustomers, it shall proceed to do so in the manner provided in Article 3.5 of Title 40, C.R.S.          \n(9) Immediate shut-offs. When the City immediately shuts off service to a customer without prior notice, such customer\nmay immediately appeal such action to the City Manager by filing a formal complaint generally conforming to Form No. 2\nattached to these rules.  The City Manager shall designate a hearing officer to hear and determine complaints filed under\nthese rules, and said hearing officer shall immediately determine any such complaint.  \n(10)  Informal complaints and formal complaints.  \n   \n  (a) Informal complaints.  \n  (i)  An informal complaint is one that may be resolved without formal order.  Customers must use the\ninformal complaint procedure prior to filing a formal complaint with the City Manager, except for a complaint\nbased upon an immediate shut off under Section 12-4.1(9), which precludes the use of the informal complaint\nprocedure, or unless a proposed increase in rates to outside customers is involved.  \n   \n  (ii)  An informal complaint should be made in writing, or it should be reduced to writing at the earliest\npossible moment, and contain such facts and other information, including supporting data and documents, to\nstate adequately the circumstances by which any act or thing done or omitted to be done by the City has\nviolated any provision of law or any rule or regulation of the City.  \n   \n  (iii)  An informal complaint shall be referred to the utility Superintendent or the Superintendent’s designee,\nand said Superintendent or designee shall attempt to resolve such complaint, within the law and rules and\nregulations of the City, as soon as reasonably practicable.  If the said informal complaint is not resolved within\nthirty (30) days after filing, the same shall be deemed denied.  \n   \n  (iv)  No anonymous informal complaint shall be considered.  \n   \n  (b) Formal complaints.  \n   \n  (i)  When an informal complaint is not resolved to the satisfaction of the complainant, it may be appealed by\nfiling a formal complaint with the City Manager.  A formal complaint filed under this rule shall not be\nentertained unless said complaint is signed.  If a formal complaint does not substantially comply with these\nrules, it can be rejected or dismissed for that reason alone.  \n   \n  (ii)  Prior to appealing to the City Manager, the complainant must comply with the informal complaint\nprocedures set forth in Section     12-4.1(10)(a) above.  Nothing said or offered during settlement negotiations\nof an informal complaint may be used in any complaint to the City Manager against any party who made the\nstatement or offer.  \n   \n  (iii)  The formal complaint shall be in writing, and generally shall conform to Form No. 2 attached to these\nrules.  The formal complaint shall set forth sufficient facts and other information to state adequately the\ncircumstances upon which the complaint is based.  The complaint may be amended at any time up to ten (10)\ndays before the hearing, if a hearing is held.  \n(11) Consolidation.  Two or more proceedings may be consolidated where it appears that the issues are substantially\nsimilar and that the rights of the parties will not be prejudiced by such consolidation.  \n(12)  Hearings and notice of hearings.  A formal complaint to the City Manager shall be set for hearing at the earliest\npracticable time.  A formal complaint may be withdrawn by the complainant at any time, and it shall be dismissed where it\nhas been set for hearing and the complainant fails to appear at the time, place, and date set for hearing without just cause.\n The City shall provide written notice of a hearing on a formal complaint by mailing a copy of the notice setting the matter\nfor hearing at least ten (10) days before the first day of hearing, unless shortened by the City Manager or other presiding\nofficer, to (i) each party to the proceeding as of the date of mailing; (ii) any other person who, in the opinion of the City\nManager or presiding officer, would be interested in or affected by the proceeding involved in the hearing; and (iii) any\nperson who has asked to receive notice of the hearing.  The Notice of Hearing shall state the time, place, and date of the\nhearing.  \n(13) Conduct of hearings.  \n  (a)  Hearings on formal complaints shall be conducted by the presiding officer.  Hearings shall be held in the City\nCouncil Chambers, or at such place or places in the City as may be designated in the Notice of Hearing.  Any person\nwho is disruptive, abusive, or disorderly at a hearing may be excluded from the hearing.  Any hearing shall be\nrecorded at the request of any party, including the City; the cost of such recording shall be borne by the party who\nrequested that the hearing be recorded.  \n   \n  (b)  A witness, before being permitted to testify, shall be required to swear or affirm that the testimony he or she is\nabout to give is true.  No witness who refuses to so swear or affirm shall be permitted to testify.  \n   \n  (c)  In order to expedite the hearing, the presiding officer may limit the number of parties who shall be permitted to\ncross-examine witnesses or argue motions or objections.  \n(14) Admissibility of evidence. The presiding officer shall not be bound by the technical rules of evidence, and no\ninformality in any proceeding or in the manner of taking testimony shall invalidate any order, decision, rule, or regulation\nmade, approved, or confirmed.  However, to the extent practicable, the Colorado Rules of Evidence applicable in civil non-\ninjury cases in the district courts of Colorado will be followed in order to promote uniformity in the admission of evidence.\n Notwithstanding the foregoing, when necessary to ascertain facts affecting the substantial rights of parties to the\nproceeding, evidence not admissible under such rules may be received and considered if such evidence possesses probative\nvalue commonly accepted by reasonable and prudent persons in the conduct of their affairs.  \n(15) Burden of going forward and burden of proof.  \n  (a)  In formal complaint proceedings, the burden of going forward and the burden of proof shall be on the\ncomplainant.  After the complainant has gone forward, any party who appears in support of the position of the\ncomplainant shall go forward.  Then the City or its representative, followed by any party who appears in support of\nthe position of the City, shall go forward.  The complainant shall then have the right to present rebuttal evidence.  \n   \n  (b)  In proceedings other than formal complaint proceedings, the burden of going forward and the burden of proof\nshall be as determined by the presiding officer.  \n(16) Additional Guidelines. At any hearing, the presiding officer may be guided by the Rules of Procedure of the Public\nUtilities Commission of the State of Colorado on any of the following subjects if it will help reach a fair and just solution:  \n   \n  (a)  Shortening or lengthening of time for pleadings or for action on pleadings.  \n   \n  (b)  Striking improper matter from pleadings.  \n   \n  (c)  Opening statements, procedure of hearings, and conduct of hearings.  \n   \n  (d)  Continuances or conduct of hearings in the absence of the party.  \n   \n  (e)  Definition of terms.  \n   \n  (f)  Granting permission to customers to appear as a party.  \n   \n  (g)  Permitting non-parties to testify.  \n   \n  (h)  Holding pre-hearing conferences to expedite hearings or settle issues.  \n   \n  (i)  Stipulations and whether they shall be approved or not approved.  \n   \n  (j)  Documentary evidence.  \n   \n  (k)  Interim orders and whether they should be issued.  \n   \n  (l)  Written briefs or statements and whether they should be accepted.  \n   \n  (m)  Whether a hearing shall be reopened and under what circumstances.  \n(17) Remedies. No customer may make complaint to any agency or court about any matter within the scope of these rules\nwithout first following the procedures and exhausting his or her remedies as set forth in these rules.\nSection 12-4.2.  Utility rates and finances.     \n  (1)  The City Council shall from time to time fix, establish, maintain, and provide for the collection of rates, fees, and\ncharges for electricity, natural gas, sewer, and water service, and any other utility services furnished by the City.  \n  (2)  Such rates, fees, and charges shall be sufficient, in the City Council’s judgment, to provide good service to the\ncustomers, pay all bonded indebtedness, pay legally required refunds, cover the cost of operation, maintenance, additions,\nextensions, betterments, and improvements, provide a reasonable return on the City’s investment in utility properties and\ncapital investments, and reimburse the general fund for administrative services and overhead provided and incurred by\nthe City on behalf of each utility, together with a sum which, in the City Council’s judgment, is equivalent to that which\nwould have been obtained from taxation and/or a franchise fee assessment if the utility were privately operated.  \n  (3)  The provisions of this section shall be subject to the performance by the City of all covenants and agreements made\nby it in connection with the issuance, sale, or delivery of any bonds of the City, payable out of the revenues derived from\nthe operation of its electricity, natural gas, sewer, water, and any other utilities, whether such revenue bonds are\nheretofore or hereafter issued. (Ord. 1924, eff. 12/20/11)  \nARTICLE 2.  ELECTRICITY.    \nSection 12-5.        National Electrical Code - Adoption by reference.    (Ord. 1865, repealed and reenacted, eff.\n6/27/08)   \n   The NFPA 70: National Electrical Code / International Electrical Code Series, 2008 Edition, published by the National\nFire Protection Association, Inc., One Batterymarch Park, Quincy, Mass., 02169-7471, be and the same is hereby adopted\nby reference and incorporated as fully as if set out at length herein, except as modified in Section 12-6 of this Code.  One\ncomplete copy of the 2008 Edition of the NFPA 70: National Electrical Code / International Electrical Code Series shall be\nkept on file in the Office of the City Clerk, which copy shall be available for review by the public. (Ord. 1856 eff., 6/27/08)   \nSection 12-6.        Modifications and additions  .  (Ord. 1865, repealed and reenacted, eff. 6/27/08)   \nThe said Code is subject to the following modifications:   \n(1)  Section 230.24 (B)(1) of the National Electrical Code (first two (2) paragraphs) shall be superseded by the following\nlanguage:   \n   Vertical Clearance from Ground: Service drop conductors where not in excess of 600 volts, nominal, shall have the\nfollowing minimum clearance from final grade:   \n   12 feet (3.66m) - at the electric service entrance to buildings, or at the drip loop of the building electric entrance, or above\nareas of sidewalks accessible only to pedestrians, measured from final grade or other accessible surface only for service-\ndrop cables supported on and cabled together with a grounded bare messenger and limited to 150 volts.  (Ord. 1856 eff.,\n6/27/08)   \n(2) The following additions to said Code are hereby adopted:  \n \n   (a) Masts extending over three feet (3') above roof penetrations shall be guyed by not less than two guys.  The angle\nbetween guys shall not be less than forty-five degrees (45  E  ) if practicable. (Ord. 1856, eff., 6/27/08)   \n     \n   (b) Masts shall be no less than two inch (2\") diameter galvanized rigid steel conduit (RGS). (Ord. 1856 eff.,\n6/27/08)   \n     \n   (c) Meter sockets shall be located not higher than five feet six inches (5'6\") above finished grade level. (Ord. 1856\neff., 6/27/08)   \n     \n   (d) Diagram 12-6, Service Mast Diagram, is incorporated herein and made a part of this Section. (Ord. 1856 eff.,\n6/27/08)   \nSection 12-7.        Penalty for violations.    \nAn person, firm, or corporation violating any of the provisions of this Code shall be deemed guilty of a misdemeanor, and\neach such person, firm or corporation shall be deemed guilty of a separate offense for each and every day or portion\nthereof during which any violation of the provisions of this Code is committed, continued, or permitted, and upon\nconviction of any such violation, such person, firm or corporation shall be punished by a fine of not more than One\nThousand Dollars ($1,000.00) or by imprisonment for not more than ninety (90) days, or by both such fine and\nimprisonment. (Ord. 1856 eff. 6/27/08, Ord. 1790 eff., 7/1/05)   \nSection 12-8.        Contractor to furnish plans.    \nAny electrical contractor applying for a wiring permit, for new construction, from the State Electrical Inspector shall\nfurnish the plans and specifications for the proposed work to the City's Power and Light Department.   \nSection 12-9.        Disconnecting wires in emergency.    \nEvery person owning or controlling electrical wires and apparatus for the transmission of light, heat or power shall, in time\nof fire or in case of severe storm, wherein lives or property may be endangered by the operation of such wires and\napparatus, upon the order of the Superintendent of Power and Light or his/her designee, disconnect such wires as are\ndesignated by such official; such person failing to comply with such order shall be guilty of a misdemeanor and for each\nhour such order is not complied with shall constitute a separate offense.   \nSection 12-10.      Illegal acts.    \nAny person who shall violate any of the provisions of this Article and any occupant or owner of premises where electrical\nwiring or apparatus is used or to be used, who shall refuse to allow or shall prevent or interfere with the Electrical\nInspector or his assistants in the discharge of their duties under this Article shall be guilty of a misdemeanor.  (Ord. 1958,\nSec. 7-18.)   \nSection 12-11.      Meter deposits; meter ownership.    \n(1)  Every customer applying for electrical service shall be required to make a meter deposit at the following rates and pay\nthe service charge on meter connects as set forth below:  \n   (a)  $  30.00 - Residential   \n   (b)  $  50.00 - Students   \n   (c)  $  50.00 - Temporary service for construction of new homes.   \n   (d)  $  75.00 - Stores, office buildings, etc.   \n   (e)  $500.00 - Large power customers   \n   (f)   $250.00 - Restaurants, bars and taverns   \n   (g)  $  10.00 - Service charge on meter connects.   \n(2)  Where the deposit is found to be less than the average monthly bill it may be increased at the discretion of the Power &\nLight Superintendent to an amount sufficient to adequately properly protect the City, upon written notice to the customer\nthirty (30) days in advance.   \n(3) REPEALED (Ord. 1512, eff. 8/12/95)   \nSection 12-12.      Rates for Electric Service, Power, and Energy. (Ord. 3061, Sec. 12-12, amended, eff. 1/13/23)\n(1)   RESIDENTIAL ELECTRIC SERVICE:\n(a)   Applicability:  Available for single-family units and individually metered multi-family units within the utility’s\nservice area for the purpose of lighting, cooking, household appliances, and space heating.   Single-family units and\nindividually metered multi-family units shall be considered as buildings or units used solely as residences.\n Residences used for commercial purposes shall be billed at the commercial rate, unless the residential and\ncommercial services are arranged to allow separate metering of the residential portion.  \n \n(b)   Character of service: Alternating current, 60Hz, single-phase, 120/240 volts.\n(c)  Monthly Rate:   The established rate for electric service, power, and energy delivered shall be as follows, and shall be\nreflected on utility bills issued on and after June 1st through the last day of September for Summer rates and on and after\nOctober 1st through the last day of May for Winter rates:\n                                                                      Summer                           Winter   \n                                                                      (June-September)          (Oct-May)   \n                                Monthly Charge:        $14.00                               $14.00  \n                               First 600 KWH            $0.1453/KWH                $0.1453/KWH  \n                                Over 600 KWH           $0.1453/KWH                $0.12530/KWH  \n  \n(d)   Power Cost Adjustment (“PCA”):  When applicable, a power cost adjustment (“PCA”), as specified in subsection (7)\nherein, shall be applied to all kilowatt hours billed for the current month.\n(e)   Tax Adjustment:  All rates are net and subject to applicable taxes.\n(f)   Multi-family Dwelling Units:   Where two or more dwelling units are served through one meter, this rate shall apply by\nmultiplying the above    KWH blocks of the rate and the minimum charge by the number of dwelling units so served.\n(2)   ELECTRIC WATER HEATER SERVICE:\n(a)   Applicability:  Available for individual permanently installed storage type electric water heaters of thirty (30)\ngallons or more capacity and of a type approved by the utility.  Service hereunder shall be supplied through a\nseparate meter.  Each element within the water heater will be non-inductive and controlled by a separate thermostat.\n The upper thermostat and element will be interconnected with the lower thermostat and element to permit\noperation of only one element at any time.\n \n(b)   Character of service:  Alternating current, 60HZ, single-phase, 240 volt. \n \n(c)   Monthly Rate: The established rate for electric service, power, and energy delivered shall be as follows, and shall\nbe reflected on utility bills issued on and after June 1st through the last day of September for Summer rates and on\nand after October 1st through the last day of May for Winter rates:\n                                                                                                                   Summer                         Winter   \n                                                                                                                   (June-September)         (Oct-May)   \n                                                                              Monthly Charge:       $3.50                               $3.50  \n                                                                              All KWH                      $0.1415/KWH         $0.1215/KWH  \n   (d)  Power Cost Adjustment (“PCA”):  When applicable, a power cost adjustment (“PCA”), as specified in subsection\n(7) herein, shall be applied to all kilowatt hours billed for the current month.   \n     \n   (e)  Tax Adjustment:  All charges are net and subject to applicable taxes.   \n   (3)  GENERAL ELECTRIC SERVICE:   \n   (a)  Applicability:  Available for commercial and non-residential customers for lighting and other electric services\nwhere the service is taken through one meter and does not require in excess of 50 KVA of transformer capacity.   \n     \n   (b)  Character of Service:  Alternating current, 60Hz, single-phase, 120 volts or 120/240 volts; three-phase, three-\nwire, 240 volts; three-phase, four-wire, 120/208 volts.   \n     \n   (c)  Monthly Rate:   The established rate for electric service, power, and energy delivered shall be as follows, and\nshall be reflected on utility bills issued on and after June 1  st  through the last day of September for Summer rates\nand on and after October 1  st  through the last day of May for Winter rates: (Ord. 1939, Sec. 12-12(3)(c), repealed\nand reenacted, eff. 6/14/13)   \n                                                                                                          Summer                            Winter   \n                                                                                                           (June-September)          (Oct-May)   \n                                                                    Monthly Charge:        $24.00                               $24.00  \n                                                                    First 1,500 KWH        $0.1524/KWH                 $0.1524/KWH\n                                                                   Over 1,500 KWH        $0.1524/KWH                  $0.1324/KWH\n  \n (d)  Power Cost Adjustment (“PCA”):  When applicable, a power cost adjustment (“PCA”), as specified in subsection\n(7) herein, shall be applied to all kilowatt hours billed for the current month.   \n     \n   (e)  Tax Adjustment:  All charges are net and subject to applicable taxes.   \n     \n   (f)  Multiple Meters: All metering points shall be billed as separate customers.   \n     \n(4)  LARGE LIGHT AND POWER:   \n   (a)  Applicability:  Available for commercial and industrial customers using electricity for lighting and power\npurposes through one point.   \n     \n   (b)  Character of Service:  Alternating current, 60Hz, single-phase, 120 volts or 120/240 volts; three-phase, three-\nwire, 240 volts; three-phase, four-wire, 120/208 volts; or at available distribution voltages.   \n     \n   (c)  Minimum Charge:  Demand charge, but not less than eighty percent (80%) of the highest demand of the\npreceding eleven (11) months or 50 KW, whichever is higher.   \n     \n   (d)  Monthly Rate:   The established rate for electric service, power, and energy delivered shall be as follows, and\nshall be reflected on utility bills issued on and after June 1  st  through the last day of September for Summer rates\nand on and after October 1  st  through the last day of May for Winter rates:   \n                                                                                                                  Summer                        Winter   \n                                                                                                                   (June-September)       (Oct-May)   \n                                                                          Monthly Charge:        $50.00                              $50.00  \n                                                                          Energy:   \n                                                                          First 10,000 KWH        $0.1242/KWH        $0.1242/KWH \n                                                                          Over 10,000 KWH        $0.1242/KWH        $0.1142/KWH  \n                                                                           Demand (30 minute integrated):  \n                                                                           All KW                                 $11.00/KW        $ 8.50/KW  \n \n   (e)  Multiple Meters:  All metering points shall be billed as separate customers.   \n     \n   (f)  Primary Metering Discount:  When service is taken at distribution voltage, without transformation, a three\npercent (3%) discount will be allowed in both the energy and demand measurements.   \n     \n   (g)  Power Cost Adjustment (“PCA”):  When applicable, a power cost adjustment (“PCA”), as specified in subsection\n(7) herein, shall be applied to all kilowatt hours billed for the current month.   \n     \n   (h)  Tax Adjustment:  All charges are net and subject to applicable taxes.   \n(5)  SECURITY LIGHTING:   \n(a)   Applicability:  Available for area lighting, in private areas and grounds, for protective and safety purposes only, where\nthe City installs high-pressure sodium (“HPS”) or light-emitting-diode (“LED”) type lighting fixtures in sizes determined\nby the City as appropriate for the area to be lit.\n \n(b)   Character of Service:   Dusk-to-dawn operation of utility owned HPS or LED fixtures.\n(c) Installation Fees and Connect/Disconnect Fees: A non-refundable fee for the initial installation of utility-supplied poles\nshall be Eighty Dollars ($80.00). The amount necessary for the costs of the wire, connections, and hardware, including the\nfixture, shall be calculated by the Power & Light Director as of January 1st each year and added to the non-refundable fees\nset forth above. Installation fees are due and payable at the time the customer makes application for a security light.\nWhere a utility-supplied pole and hardware exists at an address and a customer wishes to initiate service, a Twenty-Five\nDollar ($25.00) connect fee shall be assessed. Should a customer wish to disconnect a security light, a Twenty-Five Dollar\n($25.00) disconnect fee shall be charged.\n(d)  Monthly Rate:\nLamp Charge\n \n$/mo.\nPCA kWh\n175 W \nMV\n14.80\n67\n200 W \nMV\n16.00\n76\n400 W \nMV\n31.10\n153\n30 W\nLED\n9.25\n12\n48 W\nLED\n10.00\n18\n107 W\nLED\n20.10\n41\n108 W\nLED\n20.15\n41\n110 W\nLED\n20.25\n42\n150 W\nHPS\n14.25\n58\n400 W\nHPS\n31.00\n153\n(e)  Power Cost Adjustment (“PCA”):  When applicable, a power cost adjustment (“PCA”), as specified in subsection (7)\nherein, shall be applied to all kilowatt hours billed for the current month.   \n   (f)  Tax Adjustment:  All charges are net and subject to applicable taxes.   (Ord. 3055, Sec. 12-12 (5), repealed and\nreenacted 11/15/22)\n(6)  STREET LIGHTING:   \n   (a)  Applicability:  Available for municipal, county, and state street lighting on public roads, streets, and other public\nareas and grounds, for protective and safety purposes only.   \n   (b)  Character of Service:  Dusk-to-dawn operation of government agency specified street lamps and poles that are utility\ninstalled, owned, and operated.   \n   (c)  Monthly Rate:     \n                                                    Monthly Charge:                        $24.00\n                                                    Energy:\n                                                   All KWH                                    $0.1564/KWH\n   (d)  Power Cost Adjustment (“PCA”):  When applicable, a power cost adjustment (“PCA”), as specified in subsection (7)\nherein, shall be applied to all kilowatt hours billed for the current month.   \n   (e)  Tax Adjustment:  All charges are net and subject to applicable taxes.   \n(7)  CUSTOMER-OWNED GENERATION OF ELECTRICITY.\n  (a)  Applicability:  Available for qualified service customers who own, operate or maintain their own eligible renewable\nenergy generation equipment as defined by C.R.S. 40-2-124, including but not limited to, photovoltaics, fuel cells and\nmicro-turbines, in parallel with the City’s electric system in accordance with this Chapter.  Residential customer-owned\ngeneration systems shall be limited to a maximum capacity of ten (10) kilowatts, except as provided in Subsection (b)\nbelow. \n  (b)  Residential systems with a capacity greater than ten (10) kilowatts may be permitted following a case-by-case review\nof the proposed system specifications by the Power & Light Utility Director or his/her designee and may be subject to\nadditional conditions or requirements.  The City may, at its sole discretion, approve or deny systems larger than ten (10)\nkilowatts for residential customers.  If interconnection is denied, the City will provide a written technical or economic\nexplanation of such denial to the customer.\n  (c)   Qualified service customers who opt to install and use a customer-owned residential generation system must:\n                  (1)  Submit a complete written application to the Power & Light Utility Director or his/her designee, on a form\nprovided by the City, notifying the City of the customer’s intent to own, operate, and maintain his or her own eligible\nrenewable energy generation equipment; and\n                  (2)  Enter into a non-transferrable interconnection agreement on a form provided by the City; and\n                  (3)  Pay the applicable application fee.\n  (d)  Once approved for use of a customer-owned residential generation system, a customer will remain on the service\nuntil such time that the customer submits a written request for a change in service or until the City discontinues said\nservice.\n  (e)  Net metering:  Applies to all customer-owned residential generation systems installed prior to the effective date of\nthis section and on and after the effective date of this section.\n                  (1)  The Power & Light Utility will net meter all electric power and energy produced by the customer-owned\nresidential generation system.  Net metering shall be, for billing purposes, the net consumption as measured at the service\nmeter.  Consumption will be measured monthly, and, in the event the net metering is negative, as when the customer’s\ngeneration system production is greater than the customer’s consumption, the net negative consumption will be calculated\nusing the monthly Avoided Cost Rate from ARPA; that credit will be applied toward the monthly electric bill, at one (1)\nkWh for each kWh generated above the customer’s consumption.\n  (f)  Customer-owned residential generation systems must have a compatible City-furnished meter. \n  (g)  Fees and Net-Metering Credits shall be set as follows:\n            (1)  Every customer applying for electrical service shall be required to make a meter deposit in accordance with\nSection 12-1(2).   In addition to the required meter deposit, customers shall be required to pay an initial special equipment\nfee which represents the cost of the special meter required to be installed to service the account less the cost of a typical\nresidential meter.\n            (2)  The customer will be billed the applicable customer service charge each month, including those months when\nnegative or no net electric consumption by the customer occurs, without discount or credit for customer generation\nequipment. \n           (3)  The City of Trinidad will charge the customer an additional Customer-owned Residential Generator System\nAdministrative Fee per month for administrative expenses and additional meter costs that are incurred.\n           (4)  All energy consumption from the City of Trinidad’s grid will be billed at the standard Residential Electric Service\nRate.  The customer will be credited the net difference between owner-generated energy and the City of Trinidad supplied\nenergy under circumstances where the customer generation equipment supplied more than the energy needs (kWh)\nconsumed by the customer generator.  The credit will be calculated using the Residential Electric Service Rate less the\nAvoided Cost Rate as indicated on ARPA’s wholesale invoice to the City.\n(8)  POWER COST ADJUSTMENT (“PCA”):   \n   (a)  Any bill may be adjusted for variations in the cost of power to the utility.  Such power cost adjustments (“PCAs”) may\nbe recommended from time to time by utility staff and may be authorized by the City Council.  The City Council may\nauthorize a PCA in the event that significant revenue changes are necessary because of unexpected increases in the cost of\npower, including energy and demand costs; or because of other emergencies that are estimated to be greater than a ten\npercent (10%) deviation in fiscal year power costs budgeted.   \n   (b)  A PCA shall be calculated as follows:   \n                                                          PCA = (Total Projected Cost – Budgeted Expense)   \n                                                                         (Estimated kWh Sales for Application Period)   \n   where “A” equals the energy cost per kilowatt hour (“KWH”) billed during the preceding month by the Arkansas River\nPower Authority, and “B” equals any energy cost adjustment billed during the preceding month by the Arkansas River\nPower Authority.   \n   (c)  If authorized by the City Council, a PCA shall be effective for a period not to exceed twelve (12) months.  After such\nperiod, the PCA shall automatically expire unless re-authorized by the City Council.  When applicable, a PCA shall be\napplied to all kilowatt hours billed in the current month.\n  \nSection 12-13.      Establishment of Electric Light and Power Fund; sources.   \n   There is hereby established a fund to be known and maintained as the \"Electric Light and Power Fund\", to be derived as\nfollows:   \n   (1)  All gross revenues and income from the operation of the electric light and power system;   \n   (2)  All funds arising from the sale of by-products;   \n   (3)  All profits from the sale of appliances and apparatus;   \n   (4)  All funds arising from the sale of materials and equipment removed from the system and no longer required for\noperation;   \n   (5)  Interest on monies invested from funds resulting from the operation of the system; and   \n   (6)  All other funds derived either from the operation or ownership of the electric light and power system.  (Ord. 948,\nSec. 1.)   \nSection 12-14.      Purposes of Electric Light and Power Fund.    \n(1)  There shall be first paid the necessary costs and expenses of the maintenance and operation of the Municipal Electric\nLight and Power System, including necessary repairs and replacements.  Included in the term \"operation\" shall be such\nsums as may be needed for salaries, wages, material, equipment, insurance, bank charges, commercial expenses,\npromotion, payment in lieu of tax to the General Fund in annual amounts not to exceed five percent (5%) of gross receipts,\nnew business and general miscellaneous expenses incurred in connection with the system.   \n(2) REPEALED (Ord. 1512, eff. 8/12/95)   \n(3)  After the payments and deductions specified in Subsection (1) and (2), the remaining part of said revenues and income\nshall be known as \"Net Revenues\".  Such net revenues shall be deposited each month in an account with a national bank,\nor authorized depository, which is a member of the Federal Deposit Insurance Corporation, for such future purposes as\nmay be determined by the budgeting process of the City.  (Ord. 1235, 2/15/83.)  \nSection 12-15.      City to pay for service.     \n   The City will furnish no free service and so long as the City shall use electricity for street lighting and other municipal\npurposes it shall pay monthly into the Electric Light and Power Fund a fair and reasonable amount for such service, and in\ndetermining what shall be a fair and reasonable amount, the City Council shall take into consideration what other cities in\nColorado, similarly situated, pay for like service.  In no event shall the City pay a greater amount than would be charged a\nprivate consumer.  (Ord. 948, Sec. 2.)   \nSection 12-16.      Electric system to pay own expenses.    \n   All costs and expenses incurred in connection with or incident to the operation and maintenance of the Electric Light and\nPower System shall be paid exclusively from the revenues of the System, and in no event shall any of such costs or\nexpenses be paid out of or charged to the general fund or tax levies of the City, either directly or indirectly.  (Ord.  948, Sec.\n4.)   \nSection 12-17.      Connections and extensions.    \n   \n (1) All customers shall apply in writing to the Power and Light Department before any connection can be made.  The\ncustomer shall bear the expenses of all standard connections. (Ord. 1668, eff., 6-29-01)   \n (2)       If any extensions are required in an area, the costs of such installations are to be charged to the customer or\ncustomers requiring the same. (Ord. 3090, Sec. 12-17(2) amended, eff. 1/26/24)\n (3) Customers who are permitted by the City to have their electric services placed underground, shall be charged\nwith the expense of opening and closing the trench, the meter pedestal and ground level handhole, including the\nconduit, wire, connections, labor and equipment charges. (Ord. 1668, eff., 6-29-01)   \n (4) There shall be no extension of any electrical service without the approval of the Superintendent or his/her\ndesignee, and no one shall be employed to make the connection or installation except the person duly authorized by\nthe City to perform such work. (Ord. 1668, eff., 6-29-01)   \nSection 12-18.      Compliance with regulations; discontinuance of service for violation.    \n   The provisions of this Article and the rules and regulations established by the Superintendent of Light and Power\nshall be considered a part of the contract with every customer who is supplied with electricity by the Department,\nand every such customer by consuming energy shall be deemed to express his/her assent to be bound thereby.\n Whenever any of the regulations or any other provision of this Code is violated, service may be discontinued.   \nSection 12-19.      Granting rights-of-way and rights to alter vegetation.    \n   Before any customer may be served, the owner of the land shall grant to the City a right-of-way for connecting wire\nover or under the land served, and the right to make all reasonable alterations or repairs on vegetation or any other\nobstacle that may hinder the attachment of safe connections and maintenance of all electrical wiring appurtenances.\n All of the rights-of-way over or under land shall be given free of charge. (Ord. 1668, eff., 6-29-01)   \nSection 12-20.      Avoiding compliance with Article or payment of charges.    \n   It shall be unlawful for any person to do anything in any manner whatsoever to evade, avoid, or defeat any of the\nprovisions of this Article, or to obtain electrical energy in any manner whatsoever without due and proper payment\ntherefor.   \n       \nSection 12-21.      Establishment of the Arkansas River Power Authority as a separate governmental\nentity.    \n   Contingent only upon similar authorizing action being taken by each of the other Municipalities, the City shall\ncontract with the other Municipalities to establish a separate governmental entity to effect the development of\nelectric energy resources and production and transmission of electric energy in whole or in part for the benefit of the\ninhabitants of the contracting Municipalities, the governmental entity to be known as the Arkansas River Power\nAuthority (\"Authority\") by the execution and delivery of the ORGANIC CONTRACT ESTABLISHING THE\nARKANSAS RIVER POWER AUTHORITY AS A SEPARATE GOVERNMENTAL ENTITY (\"Organic Contract\") in the\nform of said Organic Contract presented to this meeting and a copy of which shall be retained on file by the City\nClerk; and the Mayor and City Clerk are hereby authorized and directed to execute said Contract on behalf of the\nCity. (Ord.  1154, 1979.)   \nSection 12-22.      Successor to the non-profit corporation.    \n   Upon the effective date of the Organic Contract, the Authority is acknowledged and recognized as the successor to\nthe Non-Profit Corporation and the City does hereby approve, consent and agree that all contracts, agreements,\nindemnifications, obligations, undertakings or other instruments (\"Existing Documents') which this Municipality has\nheretofore entered into with or on behalf of the Non-Profit Corporation shall, where applicable, be assigned and\ntransferred to the Authority by the Non-Profit Corporation and shall after such transfer and assignment remain in\nfull force and effect according to their respective terms and conditions which the Existing Documents shall include;\nand the Mayor is hereby authorized to execute any consents to such assignment which may be requested by the\nAuthority. (Ord. #1154, 1979.)   \nARTICLE 3.  NATURAL GAS.   \n   (Ord 1866, Article 3 repealed and re-enacted entirely, eff. 11/28/08)   \nSection 12-23.            Article title and citation.   \nThis Article shall be known as the “Natural Gas Code” of the City, and may be cited as such.  \nSection 12-24.            Trinidad Municipal Natural Gas Department and office of Superintendent\ncreated.   \n  (1)  The Trinidad Municipal Natural Gas Department and the office of the Superintendent of the Trinidad Municipal\nNatural Gas Department are hereby created.  \n  (2)  As used herein:  \n   (a)  Department  shall mean the Trinidad Municipal Natural Gas Department.   \n   (b)  Superintendent  shall mean the Superintendent of the Trinidad Municipal Natural Gas Department.   \nSection 12-25.            Trinidad Municipal Natural Gas Department — operation and maintenance.    \n   (1)  The City Manager shall have the right and authority to hire all necessary employees for the proper maintenance\nand operation of the Trinidad Municipal Natural Gas Department.   \n   (2)  The Superintendent of the Department shall have the power and authority to establish rules and regulations\nconsistent with the adopted tariff for the proper operation and maintenance of such Department, subject to the\nsupervision and direction of the City Manager and subject to the approval of the City Council.   \nSection 12-26.            Service classifications, rates, charges, and regulations — adoption of tariff.   \n(Ord. 3088, Sec. 12-26, Repealed and re-enacted, eff. 1/26/24)\n \n(1)  All service classifications, rates, charges, and regulations regarding the Trinidad Municipal Natural Gas\nDepartment’s provision of natural gas service shall be set forth in a gas tariff to be adopted by ordinance.\n(2)  The tariff entitled “City of Trinidad, Colorado, Trinidad Municipal Natural Gas Department, Gas Tariff No. 2”\nattached hereto is hereby adopted by reference and shall become effective on March 1, 2024.\n(3)  One copy of the currently effective gas tariff shall be kept on file with the City Clerk and shall be available for\npublic inspection during regular business hours.\n(4)  All changes to the tariff shall be adopted by ordinance, which ordinance shall adopt by reference the appropriate\ntariff sheet(s) to be revised.\n \nSection 12-27.            Natural Gas Fund — creation; purposes.    \n(1)  There is hereby established and created a fund to be known and maintained as the “Natural Gas Fund,” to be\nderived as follows: all gross revenues and income from the operation of the natural gas system; all funds arising from\nthe sale of by-products; all profits from the sale of appliances and apparatus; all funds arising from the sale of\nmaterials and equipment removed from the system and no longer required for operation of the system; and all other\nfunds derived either from the operation or ownership of said natural gas system as it now exists and as it may be\nimproved and extended.   \n(2)  The Natural Gas Fund is irrevocably pledged for the purposes and payments herein set forth, to-wit:   \n    (a)  Out of such fund there shall be first paid the necessary costs and expenses of the efficient and economical\nmaintenance and operation of the City’s natural gas system, including necessary repairs and replacements.  Included\nin the term “operation” shall be such sums as may be needed for salaries, wages, materials, equipment, insurance,\nbank charges, commercial expenses, promotion, payment in lieu of tax to the General Fund in annual amounts not to\nexceed five percent (5%) of gross receipts, new business, and general miscellaneous expenses incurred in connection\nwith the system.  \n    (b)  After the payments and deductions specified in Subsection (2)(a) herein, the remaining part of said revenues\nand income shall be known as “Net Revenues.” Such net revenues shall be deposited monthly or otherwise in an\naccount with a national bank, or authorized depository which is a member of the Federal Deposit Insurance\nCorporation, for such future purposes as may be determined by the budgeting process of the City.   \n Section 12-28. Natural gas system to be self-sufficient.    \n   All incidental costs and expenses incurred in connection with or incident to the operation and maintenance of the\nCity’s natural gas system shall be paid exclusively from the revenues of the system, and in no event shall any of such\ncosts or expenses be paid out of or charged to the General Fund or tax levies of the City, either directly or indirectly,\nexcept, however, that the City shall pay for natural gas service to City facilities.   \nSection 12-29.            Tampering with gas system devices prohibited.    \nIt shall be unlawful for any person to violate any of the rules and regulations provided and established for the\nTrinidad Municipal Natural Gas Department, or to in any manner tamper with the measuring devices and the meters\nof the Department, or to in any manner seek to defraud the City in the use of gas.   \nSection 12-30.            Applicability of Article; exception.    \n   (1)  The provisions of this Article shall be applicable to all users of the City’s natural gas system.   \n   (2)  The Superintendent of the Trinidad Municipal Natural Gas Department, with the approval of the City Council,\nmay waive or vary the provisions of this Article so that any facility or building owned by the United States, the State\nof Colorado, or any other political subdivision may be serviced by the Trinidad Municipal Natural Gas Department;\nprovided, however, that safety measures shall not be waived or changed without the adoption of amendments to this\nArticle by the City Council.  Any such gas service so supplied under this provision shall be paid by the user and no\ncost whatsoever shall be borne by the Department.     \nARTICLE 4.  SEWERS.    \nSection 12-46.   Purpose, policy, definitions and abbreviations.    \n   (a)  Purpose and policy  .  This Article sets forth uniform requirements for direct and indirect contributors into the\nwastewater collection and treatment system for the City and enables the City to comply with all applicable state and\nfederal laws required by the Clean Water Act of 1977 and the General Pretreatment Regulations (40 CFR Part 403).   \n   (b)  Definitions  .  For the purpose of this Article certain words and terms used herein are defined as follows:   \nACT or THE ACT means the Federal Water Pollution Control Act, also known as the Clean Water Act, as amended,\n33 USC § 1251, et. seq.               \nADMINISTRATIVE AUTHORITY means the City Manager or his or her authorized representative or such other City\nofficial or employee authorized to enforce the provisions of this Code and the ordinances of the City.   \nANALYSIS PROCEDURES means the Guidelines Establishing Test Procedures for the Analysis of Pollutants:  Final\nRule; 40 CFR Part 136.   \nAUTHORIZED REPRESENTATIVE OF INDUSTRIAL USER means:   \n                a. A principal executive officer of at least the level of vice president, if the industrial user is a corporation;   \n                 b. A general partner or proprietor if the industrial user is a partnership or proprietorship, respectively;   \n                  c. A duly authorized representative of the individual designated above if such representative is responsible\nfor the overall operation of the facilities from which the indirect discharge originates.   \nBIOCHEMICAL OXYGEN DEMAND (BOD) means the quantity of oxygen utilized in the biochemical oxidation of\norganic matter under standard laboratory procedures in five (5) days at twenty degrees Centigrade (20°C), expressed\nin parts per million/milligrams per liter.   \nBUILDING DRAIN means that part of the lowest horizontal piping of a drainage system which receives the discharge\nfrom soil, waste, and other drainage pipes inside the walls of the building and conveys it to the building sewer,\nbeginning five feet (5’) outside the inner face of the building wall.   \nBUILDING SEWER means the extension from the building drain to the public sewer or other place of disposal.   \nCATEGORICAL INDUSTRY means any new or existing industry subject to Section 307 of the Clean Water Act.   \nCITY means the City of Trinidad, Colorado.   \nCITY MANAGER means the manager of the City of Trinidad, or his designee.   \nCOMPOSITE SAMPLE means a combination of individual samples of water or wastewater taken at selected\nintervals, generally hourly, for some specified period, to minimize the effect of the variability of the individual\nsample.  Individual samples may have equal volume or may be proportional to the flow at the time of sampling.   \nDIRECT DISCHARGE means discharge of treated or untreated wastewater directly to the waters of the State.   \nDISCHARGE RATE means that volume of effluent from an industrial or commercial discharger which has been\ndetermined by the Utilities Superintendent to be representative of the process effluent from that industrial or\ncommercial operation.  Such effluent shall be based upon metered water usage unless, in the opinion of the Utilities\nSuperintendent, significant amounts of water are diverted and not discharged into the wastewater treatment system.\n  \nDISCHARGER means any person who discharges or causes the discharge of wastewater directly or indirectly to the\nPOTW.   \nDOMESTIC (SANITARY) WASTES means liquid wastes:   \n                   a.   From the noncommercial preparation, cooking and handling of food;   \n                   b. Containing human excrement and similar matter from the sanitary conveniences of dwellings,\ncommercial buildings, industrial facilities and institutions.   \nENVIRONMENTAL PROTECTION AGENCY means the United States Environmental Protection Agency, or where\nappropriate, the administrator or other duly authorized official of the agency.   \n \nEXISTING USER means an industrial user which is or was in operation at the time of promulgation of applicable\nFederal categorical pretreatment standards.   \nFLOW means volume of wastewater per unit time.   \nGARBAGE means solid wastes from the domestic and commercial preparation, cooking and dispensing of food, the\nprocessing of food by-products, the processing of agricultural products and the handling, storage and sale of\nproduce.   \nGRAB SAMPLE is a single dip-and-take sample collected, over a period of time not to exceed 15 minutes, at a\nrepresentative point in the discharge system.   \nINDIRECT DISCHARGE means the discharge or the introduction of nondomestic pollutants from any source\nregulated under Section 307 (b), (c) or (d) of the Act, into the POTW (40 CFR 403.3(i)).   \nINDIVIDUAL (PRIVATE) SEWAGE DISPOSAL SYSTEM means a septic tank or similar self-contained receptacle or\nfacility which collects and/or treats or otherwise disposes of wastewater and which is not connected to the POTW.   \nINDUSTRIAL USER means any sources of indirect discharge (40 CFR 403.3(j)).   \nINDUSTRIAL WASTES means the liquid wastes from industrial processes as distinct from domestic sewage.  Any\ndomestic waste mixed with an industrial waste is then considered an industrial waste.   \nINTERFERENCE means a discharge which, alone or in conjunction with a discharge or discharges from other\nsources, inhibits or disrupts the POTW, its treatment processes or operations or its sludge process, use or disposal;\nand therefore, causes a violation of any requirement of the POTW’s NPDES permit or prevents sewage sludge use or\ndisposal in compliance with specified applicable federal statutes, regulations or permits.   \nNATIONAL PRETREATMENT STANDARD means any regulation containing pollutant discharge limits promulgated\nby the EPA in accordance with Section 307(b) and (c) of the Act, which applies to industrial users.  This term\nincludes prohibitive discharge limits established pursuant to 40 CFR Section 403.5.   \nNATURAL OUTLET means any outlet into a watercourse, pond, ditch, lake or other body of surface water or\ngroundwater.   \nNEW SOURCE means any source in which construction is commenced after publication of an applicable\npretreatment standard provided that any of the conditions are met as detailed in 40 CFR 403.3 (m) and 40 CFR\n403.6 (b).   \nNPDES (national pollutant discharge elimination system) means the federally instituted program for issuing,\nconditioning and denying permits for the discharge of pollutants from point sources into the navigable waters or\ngroundwaters of the contiguous zone and the oceans pursuant to Section 402 of the Act.   \nNPDES (national pollutant discharge elimination system) PERMIT means a permit issued under the national\npollutant discharge elimination system for discharge of wastewaters to the navigable water of the United States\npursuant to the Act.   \nPASS THROUGH means a discharge which exits the POTW into the receiving stream in quantities or concentrations\nwhich, alone or in conjunction with a discharge or discharges from other sources, is a cause of a violation of any\nrequirement of the POTW’s NPDES permit.   \nPERSON means any individual, firm, company, association, society, corporation, group or governmental agency.   \npH means the logarithm of the reciprocal of the weight of hydrogen ions, in grams per liter of solution.   \n POLLUTANT means any substance which reduces the ability of waters to meet applicable federal, state or local\nwater quality standards.   \nPOLLUTION means the manmade or man-induced alteration of the chemical, physical, biological and radiological\nintegrity of water.   \nPRETREATMENT or TREATMENT means the reduction of the amount of pollutants, the elimination of pollutants\nor the alteration of the nature of pollutant properties in wastewater to a less harmful state prior to or in lieu of\ndischarging or otherwise introducing such pollutants into a POTW. The reduction or alteration can be obtained by\nphysical, chemical or biological processes or process changes by other means, except as prohibited by 40 CFR\nSection 403.6(d).   \nPRETREATMENT REQUIREMENTS means any substantive or procedural requirement related to pretreatment,\nother than a natural pretreatment standard imposed on an industrial user.   \nPRETREATMENT STANDARDS means all applicable federal rules and regulations implementing Section 307 of the\nAct, as well as any nonconflicting standards or regulations; the more stringent thereof shall be applied.   \nPUBLIC SEWER means a sewer in which all owners of abutting properties have equal rights, which is placed in a\npublic right-of-way or dedicated easement, which was constructed according to City specifications for public sewers\nwhich were current at the time of its installation or accepted as substantially equivalent in writing by the City, and\nwhich is controlled by public authority.   \nPUBLICLY OWNED TREATMENT WORKS (POTW) means a treatment works as defined by Section 212 of the Act\nwhich is owned in this instance by the City.  This definition includes any public sewers that convey wastewater to the\nPOTW treatment plant, but does not include pipes, sewers or other conveyances not connected to a facility providing\ntreatment.  For the purposes of this Article, POTW also includes any public sewers that convey wastewaters to the\nPOTW from persons outside the City who are, by contract or agreement with the City, users of the City’s POTW.   \nRECEIVING WATERS means lakes, rivers, streams or other watercourses which receive treated or untreated\nwastewater.   \nSANITARY SEWER means a sewer which carries sewage and to which storm, surface and groundwaters are not\nintentionally admitted, including the pipe or conduit system and appurtenances, for the collection, transportation,\npumping and treatment of sewage.  This definition also includes the terms PUBLIC SEWER, SEWER SYSTEM,\nSEWER and COLLECTION LINE.   \nSEWAGE means a combination of the water-carried wastes from residences, business buildings, institutions and\nindustrial establishments.   \nSEWER means a pipe or conduit for carrying sewage.   \nSHALL and WILL are mandatory; MAY is permissive.   \nSIGNIFICANT INDUSTRIAL USERS means:   \n                     a.  Any discharger subject to categorical pretreatment standards;    \n                     b. Any other industrial user that discharges an average of twenty-five thousand (25,000) gallons per day\nor more of process wastewater (excluding sanitary, noncontact cooling and boiler blowdown wastewaters) or that\ncontributes a process wastestream which makes up five percent (5%) or more of the average dry weather hydraulic or\norganic capacity of the POTW; or     \n                     c. Any industrial user that has a reasonable potential for adversely affecting the POTW’s operation or for\nviolating any pretreatment standard or requirement.    \nSLUDGE means the accumulated solids separated from liquids (such as water or wastewater) during processing, or\ndeposits on the channels of receiving waters, or the precipitate resulting from chemical treatment, coagulation or\nsedimentation of water or wastewater.   \nSLUG or SLUGLOAD means any discharge of water, sewer or industrial wastes which, in concentration of any give\nconstituents or in quantity of flow, exceeds for any one (1) period of duration longer than fifteen (15) minutes more\nthan five (5) times the average twenty-four-hour concentration, quantities or flow during the normal operation.   \nSTATE means the State of Colorado.   \nSTORM SEWER or STORM DRAIN means a sewer which carries stormwaters and surface waters and drainage, or\nother facilities used for the drainage of stormwater; but excludes sewage and polluted industrial wastes.   \nSUBDIVIDER or DEVELOPER means any person who plats and improves undeveloped land for the purpose of\nindustrial, commercial or residential use; or redevelops land or property for industrial, commercial or residential\nuse.   \nSUSPENDED SOLIDS or TOTAL SUSPENDED SOLIDS (TSS) means the total suspended matter, expressed in\nmilligrams per liter, that floats on the surface of, or is suspended in water, wastewater or other liquids and which is\nremovable by laboratory filtering in accordance with procedures set forth in 40 CFR Part 136.   \nTOTAL TOXIC ORGANIC POLLUTANTS means the sum of organic compounds found by use of the methods below,\nin an industrial user’s wastewater discharge at a concentration greater than the method detection limit.  Total toxic\norganic pollutants are measured using the methodologies, quality control techniques, sample container requirements\nand sample preservation techniques which must be followed as published in Guidelines Establishing Test Procedures\nfor the Analysis for Pollutants (Final Rule; 40 CFR Part 136).   \nTOXIC POLLUTANT means any pollutant or combination of pollutants listed as toxic in regulations promulgated by\nthe administrator of the Environmental Protection Agency under the provision of CWA 307(a).   \nUSER means any person who contributes, causes or permits the contribution of wastewater into the City’s POTW.   \nUTILITIES SUPERINTENDENT means the Superintendent of Water, Gas and Sewer.   \n(c)  Abbreviations  .  The following abbreviations shall have the designated meanings:  \n \nBMR\nBaseline monitoring report\nBOD\nBiochemical oxygen demand\nCFR\nCode of Federal Regulations\nCWA\nClean Water Act 33 USC 1251, et. seq.\nEPA\nEnvironmental Protection Agency\nmg/l\nMilligrams per liter\nNPDES\nNational pollutant discharge\nelimination system\nPOTW\nPublicly owned treatment works\nRCRA\nResource Conservation Recovery Act\n42 USC 3251, et. seq.\nSER\nState Effluent Regulations\nSWQS\nState Water Quality Standards\nTSS\nTotal suspended solids\nUSC\nUnited States Code\nSection 12-47.  Deposit of objectionable wastes unlawful.    \n   It is unlawful for any person to place, deposit or permit to be deposited in an unsanitary manner, upon public or\nprivate property within the City or in any area under the  jurisdiction of the City, any human or animal excrement,\ngarbage or other objectionable waste.   \nSection 12-47.1.  Discharge of untreated, polluted waters unlawful.    \n   It is unlawful to discharge to any natural outlet within the City, or in any area under the jurisdiction of the City, any\nsanitary sewage, industrial wastes or other polluted waters, except where an NPDES permit has been issued and\nsuitable treatment has been provided in accordance with the Act.   \nSection 12-47.2.  Discharge of waters into sanitary sewer prohibited.    \n   No person shall make connection of downspouts, foundation drains, areaway drains or other sources of surface\nrunoff or groundwater to a building sewer or building drain which in turn is connected directly or indirectly to a\npublic sanitary sewer unless such connections are approved by the Utilities Superintendent, for the purpose of\ndisposal of polluted surface drainage, unless such drainage is prohibited by SER and/or SWQS.   \nSection 12-48.  Disposal facilities to conform to Article.    \n   Except as provided in this Article, it is unlawful to construct or maintain any privy, privy vault, septic tank,\ncesspool, inceptor or other facility intended or used for the disposal of sewage.   \nSection 12-49.  Prohibited discharges; exceptions.    \n   (a)  General.  As per 40 CFR 403.5(a), the discharge of any pollutant to a POTW which causes interferences is\nprohibited.  The discharge of any waters containing toxic or poisonous solids, liquids or gases in sufficient quantity,\neither singly or by interaction with other wastes, to contaminate the sludges of the City wastewater treatment\nfacilities, to injure, interfere with or pass through any sewage treatment process, to constitute a hazard to humans or\nanimals, to create a public nuisance, or to create a public nuisance, or to create any hazard in the receiving waters of\nthe wastewater treatment plant, is prohibited.   \n   (b)  Except as provided in this Article, no person shall discharge or cause to be discharged any of the following\ndescribed waters or wastes to any public sewer:   \n   (1)  Any liquid or vapor having a temperature higher than sixty-five degrees Centigrade (65°C) (150°F) at the point\nof entry to the public sewer or heat in amounts which will inhibit biological activity in the wastewater treatment\nplant resulting in interference, but in no case heat in such quantities that the temperature at the treatment plant\ninfluent exceeds forty degrees Centigrade (40°C) (104°F);   \n   (2)  Any pollutant, including oxygen demanding pollutants, released in a discharge of such volume or strength as to\ncause interference in the operation or maintenance of the wastewater treatment plant;   \n   (3)  Any water or waste which contains more than ten (10) mg/l or petroleum oil, non-biodegradable cutting oil or\nproducts of mineral oil origin in any single grab sample using the EPA gravimetric method;   \n   (4)  Any water or waste which contains grease, oil or any other substances that will solidify or become discernibly\nviscous at temperatures between zero degrees Centigrade (0°C) (32°F) and sixty-five degrees Centigrade (65°C)\n(150°F).;   \n   (5)  Waters containing sand and other inorganic particulate matter which will result in a settleable solids\nconcentration greater than twenty-five (25) milliliters per liter in the discharge;   \n   (6)  Materials in sufficient amounts which may cause or do cause excessive coloration or light absorbency\nincluding, but not limited to, dye wastes and vegetable   \n   tanning solutions;   \n   (7)  Noxious or malodorous solids, liquids or gases, which either singly or by interaction with other wastes, are\ncapable of creating a public nuisance or hazard to life or are or may be sufficient to prevent entry into a sewer for its\nmaintenance and repair;   \n   (8)  Garbage that has not been ground or comminuted to such a degree that all particles will be carried freely in\nsuspension under flow conditions normally prevailing in the public sewers, with no particle greater than one-fourth\n(1/4) inch in any dimension;   \n   (9)  Radioactive wastes or isotopes of such half-life or concentration that they do not comply with the provisions for\n Disposal by Release into Sanitary Sewer Systems  in the latest edition of Rules and Regulations Pertaining to\nRadiological Control, published by the Colorado Department of Health;   \n   (10)  Wastewaters at a flow rate or containing such concentrations or quantities of pollutants that exceed, for any\ntime period longer than fifteen (15) minutes, more than five (5) times the average twenty-four-hour concentration,\nquantities or flow during normal operation shall be defined as a  slug  and are prohibited;   \n   (11)  No user shall ever increase the use of process water, or in any way attempt to dilute a discharge as a partial or\ncomplete substitute for adequate treatment to achieve compliance with the limitations contained in the federal\ncategorical pretreatment standards, or in any other pollutant-specific limitation developed by the City or State;   \n   (12)  Any toxic substances in amounts exceeding standards promulgated by the administrator of the United States\nEnvironmental Protection Agency pursuant to Section 307(a) of the Act, and chemical elements or compounds,\nphenols or odor-producing substances, or any other substances which are not susceptible to treatment, which may\ninterfere with the biological processes or efficiency of the treatment system, that will pass through the system or that\ncreate toxicity in the City’s discharge as measured by the NPDES whole effluent toxicity test;   \n   (13)  Solid or viscous wastes which will or may cause obstruction to the flow in a sewer or otherwise interfere with\nthe property operation of the wastewater treatment system.  Prohibited materials include, but are not limited to,\ngrease, garbage, cement, dirt, rocks, animal guts or tissues, paunch manure, bones, hair, hides or fleshings, entrails,\nwhole blood, feathers, ashes, cinders, sand, spent lime, stone or marble dust, metal, glass, straw, shavings, grass\nclippings, rags, spent grains, spent hops, waste from refining or processing of fuel or lubricating oil, and similar\nsubstances;   \n   (14)  Liquids, solids or gases which by reason of their nature or quantity are, or may be, sufficient either alone or by\ninteraction with other substances to cause fire or explosion or be injurious in any other way to the sewage facilities or\nto the operation of the system.  At no time shall two successive readings on an explosion hazard meter, at the point of\ndischarge into the sewer system, be more than five percent (5%) nor any single reading over ten percent (10%) of the\nLower Explosive Limit (LEL) meter.  No pollutants shall cause any wastestream to exhibit a closed cup flashpoint of\nless than one hundred forty degrees Fahrenheit (140°F) (60°C) using the test methods specified in 40 CFR 261.21;   \n   (15)  Any waste which will cause corrosion or deterioration of the treatment system.  All wastes discharged to the\npublic sanitary sewer system must have a pH value in the range of six point zero (6.0) to nine point zero (9.0)\nstandard units.  Prohibited materials include, but are not limited to, concentrated acids, sulfides, chloride or fluoride\ncompounds and substances which will react with water to form acidic products;   \n   (16)  Any waters or waste containing suspended solids of such character and quantity that unusual attention or\nexpense is required to handle such materials at the wastewater treatment plant;   \n   (17)  Any water or waste containing any of the following substances shall meet effluent limitations as defined by\nState Effluent Regulations and/or State Water Quality Standards.  \n \nPollutant\nLimitation\nTemperature\n65°C/150°F\nOil and grease (petroleum or      mineral oil origin) 10 mg/L\nExplosive vapors\nOne reading max = 10% LEL\nTwo successive readings = 5% LEL\n<140°F or 60°C closed cup flashpoint\npH\nMin. 6.0 standard units\nMax. 9.0 standard units\nTotal toxic organic pollutants\nSER/SWQS\nTetrachloroethane\nSER/SWQS\nEthylbenzene\nSER/SWQS\nXylene\nSER/SWQS\nToluene\nSER/SWQS\nor as otherwise established in the user’s sewer use permit, whichever maximum concentration is less;   \n(18a)  The following local limitations are established to prevent pass through and interference and to protect\nreceiving water and sludge quality: \nPollutant\nDaily Maximum Allowable      Industrial Load\nCadmium\nSER/SWQS\nCopper\nSER/SWQS\nHexavalent Chromium\nSER/SWQS\nLead\nSER/SWQS\nMercury\nSER/SWQS\nNickel\nSER/SWQS\nSilver\nSER/SWQS\nZinc\nSER/SWQS\nor as otherwise established in the user’s sewer use permit, whichever maximum concentration is less.   \n   These Maximum Daily Industrial Loadings shall be allocated through Significant Industrial User permits, and the\ntotal loading to all permitted industrial users shall not exceed the limits shown.  All industrial users shall monitor\nand report daily flows as required by their sewer use permit.  In addition, the Utilities Superintendent may develop\nspecific discharge limitations for any other toxic or inhibiting pollutant which may be determined to be of sufficient\nquality to cause POTW interference, pass through, endanger the health and safety of the POTW personnel or the\ngeneral public, produce environmental harm, cause a POTW permit violation or render the POTW’s sludges\nunacceptable for economical reclamation, disposal or use.   \n   (18b)  The following daily maximum allowable industrial loadings shall be allocated through individual sewer use\npermits.  The total loading to all permitted industrial users shall not exceed:   \n   Pollutant          Daily Maximum Allowable      Industrial Load   \n   BOD                   2,750 lbs./day   \n   TSS                     250 mg/l   \n  \n   or as otherwise established in the user’s sewer use permit, whichever maximum concentration is less.   \n   (19)  Any material or substance entering into the public sewer which interferes with the treatment process, even if it\nis within the concentration limits stated in Subsection (19) and (20) above, may be prohibited upon written notice by\nthe Utilities Superintendent;   \n   (20)  Any material or substance not specifically mentioned in this section which in itself is corrosive, irritating or\nnoxious to human beings and animals, or which by interaction with other water or waste in the public sewer system\nwould produce undesirable effects or create any other condition deleterious to structures, treatment processes and\nquality of the receiving stream, is prohibited;   \n   (21)  Any materials, chemicals or compounds listed by the EPA as toxic, hazardous or explosive or which are\notherwise listed by national prohibited discharge standards;   \n   (22)  Any waters or wastes that result in toxic gases, vapors or fumes within the POTW in a quantity that may cause\nacute worker health and safety problems are prohibited.   \nSection 12-50.  Prohibited wastes; control of discharge.    \n   (a)       Regulatory actions.  If wastewaters containing any substance described in Section 12-49 are discharged or\nproposed to be discharged into the sewer system or the City or to any sewer system tributary thereto, the Utilities\nSuperintendent may take any action necessary to:   \n   (1)  Prohibit the discharge of such wastewater by issuing a cease and desist order to the discharger identifying the\ndischarge violation and the Utility Superintendent’s intentions for resolving the matter, which may include, but is\nnot limited to, plugging the sewer service;   \n   (2)  Require a discharger to demonstrate that in-plant modifications will reduce or eliminate the discharge of such\nsubstances in conformity with this Article.  Such in-plant modifications shall be performed at the expense of the\ndischarger;   \n   (3)  Require pretreatment, including storage facilities or flow equalization necessary to reduce or eliminate the\nobjectionable characteristics or substances so that the discharge will not violate these rules and regulations;   \n   (4)  Require the person making, causing or allowing the discharge to pay any additional cost or expense incurred by\nthe City for handling and treating excess loads imposed on the treatment system;   \n   (5)  Temporarily suspend the discharger’s sewer use permit or impose temporary restrictions on discharges where\ncontinued discharges would jeopardize the ability of the treatment system to meet water quality standards, threaten\ndamage to the sewer system, or cause a nuisance or unsafe condition to occur;   \n   (6) Take such other remedial action as may be deemed to be desirable or necessary to achieve the purpose of this\nArticle.   \n   (b)       Protection from accidental discharge.  Each industrial user shall provide protection   \n   from accidental discharge of the prohibited materials or other wastes regulated by this Article.  Facilities to prevent\naccidental discharge of prohibited materials shall be provided and maintained at the owner’s or operator’s own cost\nand expense.  Detailed plans showing facilities and operating procedures to provide this protection shall be\nsubmitted to the Utilities Superintendent for review, and shall be approved by him or her before construction of the\nfacility.  Review and approval of such plans and operating procedures shall not relieve the industrial user from the\nresponsibility to modify his or her facility as necessary to meet the requirements of this Article.   \n   (c)       Reporting of accidental discharge.  An accidental discharge of prohibited materials or other wastes regulated\nby this Article shall be reported by telephone immediately upon such a discharge to the Superintendent of\nWastewater Treatment.  Within five (5) days following an accidental discharge, the user shall submit to the\nSuperintendent a detailed written report describing the cause of the discharge and the measures to be taken by the\nuser to prevent similar future occurrences.  Such notification shall not relieve the user of any expense, loss, damage\nor other liability which may be incurred as a result of damage to the POTW, fish kills or any other damage to persons\nor property; nor shall such notification relieve the user of any fines, civil penalties or other liability which may be\nimposed by this Article or other applicable law.   \n   (d)       Notice to employees.  A notice shall be permanently posted on the user’s bulletin board or other prominent\nplace advising employees whom to call in the event of an accidental discharge or prohibited wastes to the public\nsewer.  Employers shall insure that all employees who may cause or suffer such an accidental discharge to occur are\nadvised of the emergency notification procedure.   \nSection 12-51. Interceptors required; construction standards; maintenance of interceptors required.\n   \n   (a)       All establishments where food is prepared for sale, including restaurants, carry-out facilities, butcher shops\nand similar establishments, shall install and maintain a grease interceptor.  All interceptors shall be of a type and\ncapacity approved by the City, and shall be located as to be readily and easily accessible for cleaning and for City\ninspection at all times.   \n   (b)       Grease, oil and sand interceptors shall also be provided when, in the opinion of the administrative authority,\nthey are necessary for the proper handling of liquid wastes containing oil or grease in excessive amounts, sand and\nother harmful ingredients; except that such interceptors shall not be required for private living quarters or dwelling\nunits.  All interceptors shall be of a type and capacity conforming to the Uniform Plumbing Code, as currently\nadopted by the City and approved by the administrative authority and shall be located as to be readily and easily\naccessible for cleaning and inspection.   \n   (c)       Grease, oil and sand interceptors shall be constructed of impervious materials capable of withstanding\nabrupt and extreme changes in temperature.  They shall be of substantial construction, watertight and equipped with\neasily removable covers which, when bolted in place, shall be gastight and watertight.   \n   (d)       All grease, oil and sand interceptors shall be maintained by the owner, at his or her expense, in continuously\nefficient operation at all times.   \nSection 12-52.  Connection with sewer system – When required.    \n   All residences, factories, mills, business houses, warehouse or any other houses having sewage matter to dispose of\nand situated on the line of any street or alley where there is a public sewer, shall be connected by the owner of the\nproperty or by his agent with such public sewer when possible or whenever required to do so by the Board of Health\nor declared of record by the City Council, and such declaration is placed on the record of proceedings of the City.  The\nCity Council, in its discretion may adopt policies pertaining to the allowance of Individual Sewage Disposal Systems\nwhich shall not be inconsistent with state laws and regulations or this Code.   \nSection 12-52.1.  Sewer construction – Apportioning cost as to property benefitted.    \n   (1)  The cost of all sewers laid in the streets or alleys shall be paid for by direct assessment upon the lots abutting\nthe sewers in proportion to their frontage upon such streets or alleys.   \n   (2)  The cost of all sewers or drains at street or alley intersections or crossings shall be paid for wholly by the City.   \nSection 12-52.2.  No permit to connect sewers until assessments paid.    \n   No permit shall be granted for the construction of any private drain or sewer heretofore constructed until the\nassessment or the assessments against such lot or lots from which such private drain or sewer is connected, shall first\nbe paid.   \nSection 12-53.      Sewage service rates.    \n(1) There shall be assessed and charged the following sewer service rates:\n(a) RESIDENTIAL\n(I) Applicability. Applicable for sewage service within the corporate limits of the City to all residential\ncustomers.\n(II) Monthly minimum per living unit in any month water service is furnished by the City shall be thirty-eight\ndollars and fifty cents ($38.50).\n(III) A monthly incremental charge will be assessed based upon water consumed in the dwelling as measured\nthrough the water service meter. The rate shall be two dollars and thirty-three cents ($2.33) per 1000 gallons of\nwater consumed up to a maximum of 7,500 gallons or seventeen dollars and fifty cents ($17.50).  This charge\nshall be in addition to the monthly minimum charge above.\n(IV) For the user of sewer service of less than a month, the charge shall be as follows:\n0 to 15 days---------------no monthly minimum\n16 to 31 days--------------full monthly minimum plus the monthly incremental charge\n(b) NON-RESIDENTIAL\n(I) Applicability. Applicable for sewage service within the corporate limits of the City to all commercial and\nindustrial and association customers served by a water meter and not using processed water in a\nmanufacturing, bottling or canning operation.\n(II) The charge per month shall be based upon the monthly minimum sewer charge by water meter size set\nforth in the below.\nWater Meter Size   Monthly Minimum Monthly Charge\n5/8” meter\n7,500 gallons\n$38.50\n3/4” meter  \n7,500 gallons\n$38.50\n1” meter \n7,500 gallons\n$38.50\n1 ½” meter \n13,125 gallons\n$68.04\n2” meter\n26,250 gallons\n$118.57\n3” meter \n52,500 gallons\n$219.63\n4” meter  \n93,750 gallons\n$378.43\n6” meter\n210,000 gallons\n$826.00\n8” meter\n375,000 gallons\n$1,461.25\n                \n(III) A monthly incremental charge of three dollars and eighty-four cents ($3.84) per 1000 gallons will be\nassessed based upon 85% of the same month's metered water usage, above the minimum allowable water\nconsumption identified in Paragraph II above. If a sewer flow meter is in place, the same billing calculations\nwill be applied. This charge shall be in addition to the monthly minimum charge above.\n(IV) For the user of sewer service of less than a month, the charge shall be as follows:\n0 to 15 days---------------no monthly minimum\n16 to 31 days--------------full monthly minimum plus the monthly incremental charge\n(c) RURAL RESIDENTIAL.\n(I) Applicability. Applicable for sewage service to all residential customers outside the corporate limits of the\nCity.\n(II) A monthly minimum sewer service charge per living unit in any month shall be fifty-two dollars and fifty\n($52.50).\n(III) A monthly incremental charge will be assessed based upon water consumed in the dwelling as measured\nthrough the water service meter. The rate shall be two dollars and thirty-three cents ($2.33) per 1000 gallons of\nwater consumed up to a maximum of 7,500 gallons or seventeen dollars and fifty cents ($17.50). This charge\nshall be in addition to the monthly minimum charge above.\n(IV) For the user of sewer service of less than a month, the charge shall be as follows:\n0 to 15 days---------------no monthly minimum\n16 to 31 days--------------full monthly minimum plus the monthly incremental charge\n(d) RURAL COMMERCIAL AND INDUSTRIAL\n(I) Commercial, Industrial and Association.\n(A) Applicability. Applicable for sewage service outside the corporate limits of the City to all commercial,\nindustrial and association customers served by a water utility service and connected to City sewer services, and\nnot using processed water in a manufacturing, bottling or canning operation.\nThe charge per month shall be based upon the monthly minimum sewer charge by water meter size set forth\nbelow.\nWater Meter Size   Monthly Minimum Monthly Charge\n3/4” meter  \n7,500 gallons\n$52.50\n1” meter \n7,500 gallons\n$52.50\n1 ½” meter \n13,125 gallons\n$118.57\n2” meter\n26,250 gallons\n$219.63\n3” meter \n52,500 gallons\n$421.75\n4” meter  \n93,750 gallons\n$739.38\n6” meter\n210,000 gallons\n$1,634.50\n8” meter\n375,000 gallons\n$2,905.00\n                            \n(II) The per month charge shall be the greater of the monthly minimum charge by water meter size set forth in\nthe table in Paragraph I above or 85% of the same month's metered use calculated at six dollars and eighty\ncents ($6.80) per one-thousand (1,000) gallons.\n(III) For the user of sewer service of less than a month, the charge shall be as follows:\n0 to 15 days---------------no monthly minimum\n16 to 31 days--------------full monthly minimum plus the monthly incremental charge\nOrd. 3076, Sec. 12-53(1)(a)(b)(c) and (d), repealed and reenacted, eff. 5/12/23)\nSection 12-54. Sewer main taps.\n(1) Before a City sewer service shall be allowed or approved for any premises in any territory, area or\nsubdivision, developed or undeveloped, there shall be made an initial sewer service charge to compensate the\nCity partially for the treatment facilities and mains required to provide service. Such a charge, generally\nreferred to as the Plant Investment Fee, shall be as follows based on water meter size:\nSEWER PLANT INVESTMENT FEE\nIn-City \nOutside City\n5/8” meter - $ 2,000\n5/8” meter - $3,000\n3/4” meter - $ 2,000\n3/4” meter - $3,000\n1” meter - $ 3,333 \n1” meter - $5,000\n1 ½” meter - $ 6,667 \n1 ½” meter- $10,000\n2” meter - $10,667\n2” meter - $16,000\n3” meter - $23,333\n3” meter - $35,000\n4” meter - $42,000\n4” meter - $63,000\nThe Plant Investment Fee for a 6\" water meter or larger will be individually calculated based on anticipated\nsewer volume discharged to the sewer system, the characteristics and/or strength of the sewer discharged, and\nsewer system impacts. (Ord. 3069, Sec. 12-54(1), repealed and reenacted, eff. 3/31/23)\n   (2)  These charges are exclusive of the actual costs in physically tapping the sewer main by City forces or private\nplumbing contractors.   \n   (3)  Any sewer user with an existing tap wishing to increase the size of his/her service shall be charged a Plant\nInvestment Fee equal to the difference in Plant Investment Fee charges between the old size and the new size tap.\n The tap on the sewer main shall be the basis of the Plant Investment Fee.   \n   (4)  Abandonment of a sewer tap shall not entitle the owner to a Plant Investment Fee refund.   \n   (5)  Where a tap is made on the main serving a business or industry established and operating within the legally\ndefined perimeter of the Trinidad Industrial Park, the Sewer Plant Investment Fee shall be the same as that for a like\ntap inside the City.   \n   (6)  All Plant Investment Fees shall be placed in a special fund and the monies from the Plant Investment Fees will\nbe used only for replacement or construction of capital facilities.   \n   (7)  All taps on City sewer mains shall be done by licensed Master Plumbers and shall be charged to the person\nrequesting the tap.   \n   (8)  All taps on City sewer mains shall be issued by the Wastewater Superintendent, who shall determine the point\nof tap, minimum size of tap, sewer main extensions, manhole placement and improvements as needed.  Copies of the\npermit shall be issued to the Plumbing Contractor and the City Building Inspector.   \n   (9)  All service lines from the main sewer line to the property served shall be vitreous clay pipe or PVC pipe\nconforming to ASTM (latest issue) D1784 for PVC compounds with the requirements of ASTM (latest issue) D3034\nType PSM for PVC sewer pipe and fittings.  The service lines shall be installed by City forces or by a Colorado\nlicensed Master Plumber with all work so performed and materials installed meeting the requirements of Standard\nSpecifications provided by the City Engineering Department and Utilities Departments herein adopted by reference\nand shall be available upon request.   \n   (10)  Property to be served must be adjacent to City Mains and must be served directly therefrom.   \n   (11)  No sewer service shall be connected from the service of one (1) building to any other building, vehicle, trailer,\nmobile home or other structure or facility, fixed or mobile.   \n   (12)  Any complex of buildings containing ten (10) or more separate dwelling units, whether the same be\napartments, houses, duplexes, or otherwise, but not including sleeping rooms, and owned by any one (1) person or a\nlicensed trailer coach park are located on one (1) contiguous tract of ground owned by one (1) person, shall be\nallowed to install one (1) or more service lines and may make such taps from these service lines as are approved by\nthe City Engineering Department and Wastewater Superintendent  from plans submitted in advance of construction.\n No additional taps shall be made on these service lines until revised plans are submitted and approved.  No tap shall\nbe made to sell or give away to any agency, corporation or person.  It is further provided that in the event any part of\nsuch tract owned by such person is sold or disposed of, the purchaser of said part may request individual service\nlines provided that all applicable ordinances are complied with including but not limited to, Uniform Building Code,\nZoning Ordinances, and Uniform Plumbing Code.   \n   (13)  If the City initiates a main installation for replacement of or substitution for an existing City Main, the City\nshall bear the cost of the transferring taps and \"tying over\" the customers' service lines.   \n   (14)  Where a sewer tap has been granted and where such service is abandoned, either by non-use for a period of\ntwo (2) years or longer, or because of deterioration of the sewer service line and/or the building being served is\nrazed, the customer's service shall be disconnected, capped or closed and the applicable Sewer Plant Investment Fee\nmust be repaid unless a waiver or time extension is granted to the owner/customer by the Wastewater\nSuperintendent.   \nSection 12-55.      Sewer system extensions.    \n   (1)  The City shall make or cause to be made such extensions or replacements to the collection system of the sewer\nfacilities as it deems necessary and feasible to serve any dwelling, commercial or industrial establishments, or\nproperty situated within the service area of the City utilities.  Such extensions or replacements shall be made in\naccordance with the provisions of Section 12-54.   \n   (2)  All sewer main extensions of the City utility systems are to be under the exclusive control and ownership of the\nCity.  Upon written request, and the furnishing of satisfactory evidence that the request for a main extension is\njustified, the City will either make the extension or cause the extension to be made in accordance with the provisions\nof this Chapter.  The City shall have sole discretion in making main extensions and construction of appurtenant\nfacilities both inside and outside the corporate limits of the City.   \nSection 12-56.      General requirement for main extensions.    \n   (1)  All requests for main extensions, whether they be for a single customer or developer of an area, shall be\nsubmitted to the City in writing so that the City Engineering and Wastewater Superintendent, and other departments\nas may be required, may review and consolidate their planning.  Plans shall be approved in advance of any\nconstruction.   \n   (2)  All new sewer services shall be served from mains only, and from mains adjacent to the property being served.\n  \n   (3)  Design of within-city extensions shall be done by the City Engineer.  Developers of outside-city properties shall\nsubmit plans for approval that shall include such information as street widths, lot size, street names, utility\neasements, and utility design, and other information as may be required by City departments.   \n   (4)  Agreements on cost-sharing distribution shall be worked out prior to construction, and, rather than assessment\nof a front foot cost, the developer of an area may elect to include price of the utilities in the cost of the lot.   \n   (5)  Owners of properties either inside or outside the City requiring the construction of new mains in order to be\nserved by the utilities shall bear the cost of such main extensions.  Cost shall include design, supervision, piping,\nmanholes and appurtenances.   \n   (6)  Mains shall be laid only in platted streets or in recorded right-of-way easements with provisions for access to\nmaintain the facilities.   \n   (7)  The City shall bear the cost of main extensions only under the following circumstances:   \n                      (a)  Lines laid by the City for the exclusive use as transmission or trunk lines, or lines laid for       general\nsystem upgrading, or multiple feeding for greater reliability, shall be at City expense.       A person allowed to tap such\nlines shall pay to the City a front foot cost as though the main       were laid for his/her service. \n                      (b)  Lines laid to municipal development such as parks or city owned industrial parks shall be at city\nexpense.   \n   (8)  No services will be provided for unplatted properties located within the City.   \nSection 12-57.      Elements in planning, constructing and financing main extensions.   \n   (1)  The location, route, and length of main extensions shall be determined by the City Engineer and the\nWastewater Superintendent, based upon convenience, economy, service requirements and capabilities, and ultimate\nrequirements of the City utility system.  The size, materials, piping, manhole placing, and other engineering\nconsiderations shall be determined by the City Engineer and Wastewater Superintendent for inside-city extensions.  \nOutside-city extensions by developers shall be designed by competent personnel subject to approval of the design by\nthe City Engineer and the Sewer Superintendent.   \n   (2)  No sewer main shall be laid within the city service area within the public right of way smaller than eight (8\")\ninches in diameter.   \n   (3)  No tap shall be allowed on a main to serve a property until the main is extended to the far property line, unless\nthe owner of the property signs an agreement approved in form by the City Attorney that he/she will pay the front\nfoot costs for such main extension to or beyond his/her far property line.  Such agreement shall contain the total\namount of monthly payment installments to be made not to exceed twelve (12) months without authorization of City\nCouncil.  City Council may waive this requirement if it finds and determines that no practical or useful purpose\nwould be served by extending the main to the far property line or beyond.   \n   (4)  A main may be extended to serve a single customer, a group of customers, a \"pocket\" consisting of a house or\nhouses between developed areas, or a development.  At the option of the City, and depending on the availability of\ncity funds for investment in new mains, any of the following means of financing may be arranged:   \n   (a)  If the City elects to lay a main either with City forces or by contract at city expenses, no service shall be allowed\nto any customer until front foot costs are paid for that property or until arrangements are agreed to for deferred\npayment.   \n   (b)  Main extensions to serve a subdivision, development, or area generally will be financed by the person\ndeveloping the property. Within the development, all costs of the mains shall be absorbed in the development costs,\nincluding those at street and alley intersections, between the property line of the development and the attachment to\nexisting City mains.  Front foot costs may be recovered by the developer by a reimbursement contract over a period\nof fifteen (15) years.  Each contract shall be individually negotiated with a developer and approved by the City\nCouncil, but may contain such provisions as:   \n   (I)  Payments to developer of front foot charges by new customers wishing service off the mains.\n   (II)  Payment to the developer by the City of front foot charges and Plant Investment Fee charges collected from\nwithin the development, but in no case to refund to the developer more than seventy-five percent (75%) of the cost of\nthe mains plus interest at one-half percent (½%) per month for the balance of the seventy-five percent (75%)\noutstanding over the fifteen (15) year period.   \n   (5)  In submitting a main extension proposal, a developer, before doing the design, shall submit two (2) copies of a\npreliminary plat on which the City Engineer and the Wastewater Superintendent can indicate hydrant locations,\nvaluing, points of connection to existing City mains, existing lines or structures, and other pertinent factors\ncontrolling line sizing and grades.  Two (2) copies of the final plat shall be submitted for approval to the City\nEngineer and Wastewater Superintendent.   \n   (6)  Upon completion of the development project, the developer shall furnish the Engineering Department and\nWastewater Superintendent with Mylar or linen as-built plats.  Upon approval of the materials and construction by\nthe City Engineer and Wastewater Superintendent, these privately constructed mains shall become the property of\nthe City.   \n   (7)  The City may assume all or a portion of the cost of replacement of undersized or deteriorated mains which the\ncity deems to have served their useful purpose.  At its discretion, the City may assume all or a portion of the cost of\nmain extensions to properties within City limits already having sewer service.   \nSection 12-57.1.  Additional requirements.    \n   No statement contained in this Article shall be construed to interfere with any additional requirements that may be\nimposed by the health officer, State Health Department or EPA.  All categorical industrial users shall comply with the\ncategorical pretreatment standards set out in 40 CFR Chapter I, subchapter N, parts 405-471.  The City reserves the\nright to establish by ordinance more stringent limitations or requirements on discharges to the wastewater disposal\nsystem if deemed necessary to comply with the general purpose and policy presented in this Article.   \nSection 12-57.2.  Violations; liability.    \n   Any person violating any of the provisions of this Chapter shall become liable to the City for any expense, loss or\ndamage occasioned the City by reason of such violation.   \nARTICLE 5.  WATER.     \nSection 12-58.      Definitions.     \nAs used herein:    \n    (1)  City Forces  shall mean the City of Trinidad employees.    \n    (2)  City Water Department  shall mean the Water Department of the City of Trinidad, Colorado.    \n    (3)  Developer/customer  shall mean an applicant for extension of facilities to supply domestic, commercial,\nindustrial or fire protection water service to property comprised of a platted subdivision, a group or groups of platted\nor re-subdivided lots, a land tract, etc., upon which more than one (1) residential, commercial, or industrial\nestablishment is erected.    \n    (4)  Front-foot costs  shall mean an assessment per front foot of property or lot(s) owned by a customer to which\nwater service is made available by main extension.  The per front foot assessment is determined by apportioning the\nmain extension cost including design, supervision, valuing, fire hydrants, and appurtenances.  The City shall have\nsole discretion in determining the frontage or frontages which shall serve as the bases for apportioning the cost of a\nmain extension, subject to State law provisions.    \n    (5)  Plumbing  shall mean the practice, materials, and fixtures used in the installation, maintenance, extension and\nalteration of all piping, fixtures, plumbing appliances and plumbing appurtenances in connection with any of the\nfollowing:  sanitary drainage or storm facilities and venting systems and the public or private water supply systems,\nwithin any building, structure or conveyance.    \n    (6)  Private main  shall mean main constructed within the public right of way prior to the enactment of this\nChapter by a person or persons to serve property or properties.  Said main was contracted for or installed directly by\nthe customer in lieu of a City main of standard and approved size, location and materials.    \n    (7)  Privately constructed main  shall mean any main connected to and becoming a part of the City utility system\nwhich main was constructed directly by private funds and located in public right of way.  Said main was designed or\napproved by the City and its installation inspected by the City Inspector.  The size, materials and location were\napproved by the City and equal to that which would have been provided by the City.    \n    (8)  Service area  shall mean that area of land, whether it be a lot or lots, tract or parcel of land, or other divisions\nof land for the purpose, whether immediate or for future building development, either industrial, commercial or\nresidential, but excluding agriculture or farm land, which is subject to annexation on the date of the enactment of\nthis Chapter or in the foreseeable future is economically feasible to develop and supply water from the City as shall\nbe determined in the discretion of the City Council for growth and expansion of the City and its water supply.  The\nservice area as defined herein shall be that area of land within a radius of one and one-half (1 ½) miles from the\ncorporate limits of the City, except, however, the City Council shall have the power to prescribe such other legally\ndefined service area by resolution as it may deem necessary and in the best interest of the City.    \n    (9)  Single customer  shall mean an applicant for extension of facilities to supply domestic, commercial,  industrial,\nor fire protection water service for one (1) lot or building site, for a single family dwelling, or a multiple family\ndwelling, a commercial or industrial building, or other establishment, whether existing or to be erected.    \n    (10)  Superintendent  shall mean the department head or official in charge of the Water Department or the person\ndesignated by the City Manager to be in charge of the water works system of the City.    \n    (11)  Transmission mains  shall mean water mains which are used exclusively for the transmission of water and not\nfor distribution to single customers.  Unless otherwise designated by the City, these mains are fourteen inches (14”)\nand larger.  The direct connection of single customer service lines is not permitted except in the circumstance that a\ntap was existing or committed prior to the enactment of this Chapter.    \n    (12)  Water association  shall mean an association, partnership, co-partnerships and bodies political and corporate\nincluding one (1) or more persons or corporations or other legal entity formed to distribute water to others in order\nto contract with the City for municipal water services.  \nSection 12-59.      Water Department created; duties of City Manager; Power of City Council.     \n    There is hereby created a Water Department for the City. The City Manager is authorized to hire such employees\nand to perform all acts that may be necessary for the prudent, efficient, and economical management and protection\nof the Water Department.  The City Council shall have the power to prescribe rates, rules and regulations by\nresolution as it may deem necessary.  Rates for outside customers not living in the corporate limits of the City shall\nbe set by ordinance.    \nSection 12-60.      Customer to abide by contract.     \n    The Water Department agrees to furnish water for a certain specified price.  If any customer violates his/her\ncontract with the City or permits water to be taken without the knowledge or consent of the Water Department\nhe/she shall be required to pay double the price of water so used, and the City reserves the right to shut off the\nsupply for abuses of water privileges.  When the water has been turned off for violation thereof, the water will not be\nturned on again until all water rent and penalties have been paid.    \nSection 12-61.      Use of water during fire alarm prohibited.  \n    During all alarms of fire the use of hose and all outlets where a constant flow of water is maintained is forbidden.    \nSection 12-62.      Water use restrictions.\n    In the case of water shortage, scarcity, or conservation purposes, the City Council may be resolution    \n    place any restrictions that it deems necessary upon the use of water for irrigation, sprinkling, or outdoor use. (Ord.\n1741, eff., 12-12-03)  \nSection 12-63.      Priority of City users over outside users.     \n    Use of water outside the corporate limits of the City shall be subject to the paramount rights of users within the\ncorporate limits.  In case there shall be insufficient water to provide for users both within and without the corporate\nlimits, the City may reduce, curtail or shut off the users outside the corporate limits during such period of water\nshortage or scarcity.    \nSection 12-64.      Standpipes and fire lines.     \n    Regular customers of the City Water Department, using water for domestic or industrial purposes, wishing to\ninstall fire lines to serve fire sprinkler systems in commercial, industrial or public buildings to be used exclusively for\nthe fighting of fires shall be permitted, upon approval of plans by the City Engineer, the Water Superintendent and\nthe Fire Chief, to connect to the City mains at their own expense.  Use of water from standpipes and fire lines shall be\nfor the purpose of fighting fires only.    \nSection 12-65.      Metered service.     \n   All water service shall be metered.    \nSection 12-66.      Location of water meters.     \n    (1)  Residential meters shall be located at the property line in fibre, CMP, or concrete pipe pits with double-lid\npattern cast iron meter box covers.  The meter shall be cradled in a copper meter yoke with a stop valve, with the top\nof the meter within the top four inches (4\") of the fibre, CMP or concrete pipe.  If, because of concrete or asphalt\npaving or because some structure interferes, on approval of the Water Superintendent, the meter may be placed\nelsewhere in an accessible place.  All water services shall have curb stops in stop boxes at some point between the\ncurb line and the property line.  Curb stops shall have stop boxes in good condition that are conspicuous and\naccessible.  It shall be the responsibility of the property owner/developer to pay for the above mentioned meter pit,\nmeter yoke, curb stop and miscellaneous materials as outlined in Section 12-69 (1) as applicable.    \n    (2)  Commercial or industrial meters shall be located at the property line, if possible, in a vault suitable for the\nmeter size.  Vaults shall have an eleven inch (11”) lid placed so the meter register can be easily read, and a flange or\nmanhole cover that can be removed for access to the meter.  As with residential meters, commercial or industrial\ninstallations placed indoors or in inaccessible locations shall have remote reading registers.  All commercial or\nindustrial services shall have either curb stops between the curb line and property line or, in services over two inches\n(2”) in diameter, a shut-off valve in a vault or valve box that can be operated from the ground surface with a two inch\n(2”) square extension handle.    \n    (3)  Services to water customers off the transmission line shall have curb stops in stop boxes in good condition,\nconspicuous and accessible.  Outside-City property owners shall be responsible for protection of their meters from\nfrost and physical damage, and shall maintain their service lines to the meter in such a condition as to prevent\nwastage of water of water-caused damage.  All work done on outside-City water services from the main to the water\nmeter shall be done by a plumber licensed in the State, by City forces, by a contractor working for the City or by a\ncontractor working for a developer. All work so performed shall be under City inspection.    \n    (4)  Cost of relocating a meter setting shall be borne by the customer unless the move is caused by a public works\nproject.    \n    (5)  It shall be unlawful for any person to open, interfere with, injure, or deface, or in any way impair the working\nof any water meter.  It shall also be unlawful for any person, other than a City employee of the Water Department, to\nremove any meter from its setting, except for removal of an outside-City meter by a licensed plumber for repairs by\nthe City.    \nSection 12-67.      Plant Investment Fee.     \n    Before a City water service shall be allowed or approved for any premises in any territory, area or subdivision,\ndeveloped or undeveloped, there shall be an initial water service charge to compensate the City partially for the base\nwater supply, treatment facilities and mains required to provide service. Such a charge, generally referred to as the\nPlant Investment Fee, shall be as follows:\n   (1) Water Plant Investment Fee - Inside City\n5/8” tap\n$ 3,000.00\n3/4\" tap\n$ 3,000.00\n1\" tap\n $ 5,000.00\n1-1/2\" tap\n $10,000.00\n2\" tap\n$16,000.00\n3\" tap\n$35,000.00\n4\" tap\n $63,000.00\n \n    The Plant Investment Fee for a 6\" or larger tap will be individually calculated based on water demands and water\nsystem impacts.\n            (a) Where a tap is made on the main to serve any non-metered private fire hydrant, fire sprinkler system, or\nstandpipe, and a smaller tap is made for metered domestic, commercial or industrial use, the Plant Investment Fee\nshall be based on the size of the metered tap.\n            (b) These charges are in addition to the actual costs in physically tapping the main by City forces.\n      (2) Water Plant Investment Fee - Outside City\n5/8” tap\n$ 4,500.00\n3/4\" tap\n $ 4,500.00\n1\" tap\n $ 7,500.00\n1-1/2\" tap\n $15,000.00\n2\" tap\n$24,000.00\n3\" tap\n $52,500.00\n4\" tap\n$94,500.00\n \nThe Plant Investment Fee for a 6\" or larger tap will be individually calculated based on water demands and water\nsystem impacts.\n(a) Where a tap is made on the main to serve any non-metered private fire hydrant, fire sprinkler system, or\nstandpipe, and a smaller tap is made for metered domestic, commercial or industrial use, the Plant Investment Fee\nshall be based on the size of the metered tap.\n(b) These charges are in addition to the actual costs in physically tapping the main by City forces.\n(Ord. 3068, Sec. 12-67(1) and (2) repealed and reenacted eff. 3/31/23) \n    (3)  Any water user with an existing tap wishing to increase the size of his/her service shall be charged a Plant\nInvestment Fee equal to the difference in Plant Investment Fee charges between the old size and the new size tap.\n The tap on the water main shall be the basis of the Plant Investment Fee.  Abandonment of a tap shall not entitle the\nowner to a Plant Investment Fee refund.    \n    (4)  Where a tap is made on a main serving a business or industry established and operating within the legally\ndefined perimeter of the Trinidad Industrial Park, then the Water Plant Investment Fee shall be the same as that for\na like tap inside the City.  (Ord. 1169, 5/20/80.)    \n    (5)     (a) All Plant Investment Fees resulting from authorized taps inside the corporate limits of the City shall be\nused only for replacement or construction of water system capital facilities.    \n    (b) The monies derived from Plant Investment Fees and additional payments received pursuant to Resolution No.\n1036 resulting from authorized taps outside of the corporate limits of the City shall be placed into a restricted\naccount to be used solely for the purpose of furthering the development of the City’s water rights, including any\npossible water rights acquisition and the engineering and legal expenses associated with conversion of agricultural\nrights to municipal and industrial uses.  (Ord. 1360, Sec. 2, 9/5/89./ Ord. 1580, eff. 3-14-98)    \n    (6)  Repealed (Ord. 1661, eff. 4-13-01)    \n   (7)  The City Council shall, not later than its last regularly scheduled meeting of the month of April of each year,\nreview the Plant Investment Fee and make a determination as to the adequacy of the fee to meet purpose which it\nserves and increase or decrease the fee as circumstances require.  (Ord. 1169, 5/20/80.)   \nSection 12-68.            Charge for private fire hydrants.    \n   (1)  Private nonmetered fire hydrants (those not belonging to the City but served from City mains) may be\nauthorized if the City water supply is adequate and City mains four inches (4\") or larger are available to be tapped.\n All costs in tapping the main and installing the fire hydrants shall be paid by persons wanting this service, and a\npayment of Sixty-Two and 50/100 Dollars ($62.50) per year for each hydrant shall be paid in advance to the\nConsolidated Billing Department of the City.   \n   (2)  All plans for such installations shall be approved in advance of construction by the City Engineer and Water\nSuperintendent.   \n   (3)  Unless a private fire hydrant is on a metered service, water shall not be used from the hydrant for any purpose\nother than to fight fires.   \nSection 12-69.            Water main taps.    \n   (1)  All taps on the City mains shall be done by City forces and shall be charged to the person requesting the tap.\n Materials will be charged at City cost plus fifteen percent (15%) to cover handling equipment at the current\ndepartmental rate, and labor at the hourly rates paid by the City.  Sales taxes shall be charged where applicable.  Said\nfee shall be payable upon completion of the work.   \n   (2)  All service lines from the main to the meter shall be Type K soft copper.  Service lines from the main to the\nproperty line shall be installed by City forces, by a contractor working for the City, by a plumber licensed in the State\nor by a contractor working for a developer.  All work so performed shall be under City inspection.   \n   (3) Where a meter location other than at a property line is authorized, the City or a City licensed contractor shall\nconstruct the service from the main to the property line.  A City licensed contractor or the property owner shall\ncontinue the service line from the property line to the building.   \n   (4)  The owner or lessee of any premises to which any water connection shall be made to City mains shall keep all\npipes and fixtures from the water main to the meter in good repair and protected from frost to prevent the wastage of\nwater.   \n(5)  If no emergency exists, upon notification of the owner or lessee by a Water Department employee that his/her\nservice line is leaking, he/she shall have five (5) days in which to obtain a plumber to repair the leak.  In the event of\nnoncompliance, the City may turn the water service off at the meter, the stop box, or the corporation stop.  Any\nexpenses the City may incur in turning the service off shall be borne by the customer.   \n   (6)  If, in establishing a new grade for a street, the grade is lowered more than one foot (1'), causing the water\nservice to have less than three feet (3') of burial, the City shall replace the line, except that if the changing of the\ngrade is part of an improvement district project the charges shall be borne by the project.   \n   (7)  Property to be served must be adjacent to City mains and must be served directly therefrom.   \n   (8)  No tap shall be made in a City main until the applicable Plant Investment Fee and front foot costs for mains\nhave been paid or deferred payment arranged.  No service shall be provided from a tap until all service charges by the\nCity have been paid or deferred payment arranged.     \n   (9)  No water service line shall be connected from the service of one (1) building to any other building, vehicle,\ntrailer, mobile home or other structure or facility, fixed or mobile.   \n   (10)  Any complex of buildings containing ten (10) or more separate dwelling units, whether the same be\napartments, homes, duplexes, or otherwise, but not including sleeping rooms, and owned by one (1) person or a\nlicensed trailer coach park owned by one (1) person, if the said buildings or trailer coach park are all located on one\n(1) contiguous tract of ground owned by one (1) person shall be allowed to install one (1) or more metered service\nlines, and may make such taps from these service lines as are approved by the City Engineer and Water\nSuperintendent from plans submitted in advance of construction.  No additional taps shall be made on these service\nlines until revised plans are submitted and approved.  No tap shall be made to sell or give away water to any agency,\ncorporation or person.  It is further provided that in the event any property or properties owned by such person, shall\nbe sold or disposed of, and such property or properties shall not have a separate service line, the new owner must\nimmediately install a separate service line.   \n   (11)  If an owner has a bona fide tap on a City main not adjacent to the property served, and a new main is installed\nadjacent to the property, the City will relocate the tap to the main charging the owner for cost of materials and cost of\nkilling the old service at the main.  No Plant Investment Fee will be charged.   \n   (12)  If the City initiates a main installation for replacement of an existing City main, the City shall bear the cost of\ntransferring taps and \"tying over\" the customers' service lines.   \n   (13)  Where tapped couplings are provided in the laying of a water main, no connection shall be made to these\nfittings until the applicable Plant Investment Fee and front foot costs have been paid.   \n   (14)  Where water service is abandoned and/or the building being served is razed, the customer's service shall be\ndisconnected from the main at the customer's expense and the corporation stop capped and closed.  If the line is not\nof Type K soft copper, service will not be re-established until the line is replaced at owner's expense.  Service will not\nbe re-established for any use other than that originally authorized unless approved in advance by the City.  \nSection 12-70.            Water system extensions.    \n   (1)  The City shall make or cause to be made such extensions or replacements to the distribution system of the\nwater facilities as it deems necessary and feasible to serve any dwelling, commercial or industrial establishment, or\nproperty situated within the service area of the City utilities.  Such extensions or replacements shall be made in\naccordance with the provisions of Sections 12-71 and 12-72.   \n   (2)  All water main extensions of the City utility systems are to be under the exclusive control and ownership of the\nCity.  Upon written request, and the furnishing of satisfactory evidence that the request for a main extension is\njustified, the City will either make the extension or cause the extension to be made in accordance with the provisions\nof this Chapter.  The City shall have sole discretion in making main extensions and constructing appurtenant\nfacilities both inside and outside the corporate limits of the City.  \nSection 12-71.            General requirements for main extensions.    \n   (1)  All requests for main extensions, whether they be for a single customer or developer of an area, shall be\nsubmitted to the City in writing so that the City Engineer and Water Superintendent and other departments as may\nbe required, may review and consolidate their planning.  Plans shall be approved in advance of any construction.   \n   (2)  All new water services shall be served from mains only, and from mains adjacent to the property being served.\n  \n   (3)  Design of within-City extensions shall be done by the City Engineer and Water Superintendent.  Developers of\noutside-City properties shall submit plans for approval that shall include such information as street widths, lot size,\nstreet names, utility easements, and utility design, and other information as may be required by City departments.   \n   (4)  Agreements on cost-sharing distribution shall be worked out prior to construction, and, rather than assessment\nof a front foot cost, the developer of an area may elect to include price of the utilities in the cost of the lot.   \n   (5)  Owners of properties either inside or outside the City requiring the construction of new mains in order to be\nserved by the utilities shall bear the cost of such main extensions.  Cost shall include design, supervision, valving, fire\nhydrants, and appurtenances.   \n \n   (6)  Mains shall be laid only in platted streets or in recorded right of way easements with provisions for access to\nmaintain the facilities.   \n   (7)  The City shall bear the cost of main extensions only under the following circumstances:   \n               (a)  Where the City requires a larger main for purposes of system improvement or system extension not\nrequired by proper hydraulic sizing of lines to serve a customer or a developer's present and anticipated needs in\ncompletely developing his/her property, the City shall pay the estimated cost of over sizing over design requirements\nnot to exceed the oversize over the cost of an eight inch (8\") water main.    \n                 (b)  Lines laid by the City for the exclusive use as transmission or trunk lines, or lines laid for general\nsystem upgrading to provide better pressure, or multiple feeding for greater reliability, shall be at City expense.  A\nperson allowed to tap such lines shall pay to the City a front foot cost as though the main were laid for his/her\nservice.   \n                 (c)  Lines laid to municipal development such as parks or City owned industrial parks, shall be at City\nexpense.   \n   (8)  No services will be provided for unplatted properties located within the City.   \nSection 12-72.            Elements in planning, constructing and financing main extensions.    \n   (1)  The location, route, and length of main extensions shall be determined by the City Water Superintendent based\nupon service requirement capabilities, and ultimate requirements of the City utility system.  Generally, properties\nshall be serviced from mains in the street fronting the property and water mains laid within the City's corporate\nlimits within the public right-of-ways shall be no smaller than six inches (6\") in diameter.   \n   (2)  The size, materials, valving, fire hydrant placement and other main extension requirements shall be\ndetermined by the City Water Superintendent for extensions within the corporate limits of the City.  Extensions of\nsuch water system beyond the City corporate limits shall be designed subject to approval by the City Water\nSuperintendent, prior to the authorization of such work and materials.   \n   (3)  The American Water Works Association (AWWA) Standards, 1995 Edition, published by the American Water\nWorks Association, 6666 West Quincy Ave., Denver, Colorado 80235 is hereby adopted by reference and\nincorporated fully as if set out at length herein.  Not less than two (2) copies of the said 1995 edition of the AWWA\nStandards as set forth above shall be kept on file in the Office of the City Clerk, and the Office of the City Water\nSuperintendent.   \n    (4)  No tap shall be allowed on a main to serve a property until the main is extended to the far property line, unless\nthe owner of the property signs an agreement approved in form by the City Attorney that he/she will pay the front\nfoot costs for such main extension to or beyond his/her far property line.  Such agreement shall contain the total\namount of monthly payment installments to be made not to exceed twelve (12) months without authorization of City\nCouncil.  City Council may waive this requirement if it finds and determines that no practical or useful purpose\nwould be served by extending the main to the far property line or beyond.    \n    (5)  A main may be extended to serve a single customer, a group of customers, a \"pocket\" consisting of a house or\nhouses between developed areas, or a development.  At the option of the City, and depending on the availability of\nCity funds for investment in new mains, any of the following means of financing may be arranged:    \n    (a)  If the City elects to lay a main either with City forces or by contract at City expense, no service shall be allowed\nto any customer until front foot costs and Plant Investment Fee are paid for that property or until arrangements for\ndeferred payment have been agreed to.    \n    (b)  Main extensions to serve a subdivision, development, or area generally will be financed by the person\ndeveloping the property.  Within the development, all costs of the mains shall be absorbed in the development costs,\nincluding those at street and alley intersections, between the property line of the development and the attachment to\nexisting City mains.  Front foot costs may be recovered by the developer by a reimbursement contract over a period\nof fifteen (15) years.  Each contract shall be individually negotiated with a developer and approved by the City\nCouncil, but may contain such provisions as:    \n    (I)  Payments to developer of front foot charges by new customers wishing service off the mains.   \n    (II)  Payment to the developer by the City of front foot charges and Plant Investment Fee charges collected from\nwithin the development, but in no case to refund to the developer more than seventy-five percent (75%) of the cost of\nthe mains plus interest at one-half percent (½%) per month for the balance of the seventy-five percent (75%)\noutstanding over the fifteen (15) year period.    \n    (6)  In submitting a main extension proposal by a developer, before doing the hydraulic design, the developer shall\nsubmit two (2) copies of a preliminary plat on which the Engineering Department and the Water Superintendent can\nindicate hydrant locations, valving, points of connection to existing City mains, existing lines or structures, and other\npertinent factors controlling lines sizing and grades.  Two (2) copies of the final plat shall be submitted for approval\nto the City Engineer and Water Superintendent.    \n    (7)  Upon completion of the development project, the developer shall furnish the Engineering Department with\nMylar or linen as-built plats.  Upon approval of the materials and construction by the City Engineer and the Water\nSuperintendent, these privately constructed mains shall become the property of the City.    \n    (8)  The City may assume all or a portion of the cost of replacement of undersized or deteriorated mains which the\nCity deems to have served their useful purpose.  At its discretion, the City may assume all or a portion of the cost of\nmain extensions to properties within City limits already having water service.    \nSection 12-73.      Exemption from front foot charges.     \n    All properties abutting existing City mains prior to the enactment of this Chapter shall be exempt from front foot\ncharges, except as otherwise provided in this Chapter.  At the City's discretion, payment for main extension and Plant\nInvestment Fees may be in cash, or by a ten percent (10%) down payment with the balance handled as a utility bill by\nconsolidated billing apportioned over no more than ten (10) years, with a handling charge of one-half percent (½%)\nper month on the unpaid balance.  The outstanding balance shall constitute a lien on the property served.    \nSection 12-74.      Water service rates - Schedule.     \n(1) (a) Residential and Small Commercial.    \n  \n(I) Applicability. Applicable for water service within the corporate limits of the City to all services with a smaller than\none and one-half inch (1 ½”) meter.\n(II) Minimum charge per month for up to 7,500 gallons of water:\n5/8” meter\n$24.75\n3/4” meter\n$24.75\n1” meter\n $24.75\n \n(III) All water usage shall be billed at $3.30 per 1,000 gallons over the minimum of 7,500 gallons per month, in\naddition to the minimum monthly charge identified in Paragraph II above.\n (b) Large Commercial and Large Residential.\n(I) Applicability. Applicable for water service within the corporate limits of the City to all services with a one and one\nhalf-inch (1-1/2”) meter or larger.\n(II) Minimum charge per month:\n1 ½” meter\n(13,125 gallons)\n $43.32\n2” meter (26,250\ngallons)\n $86.63\n3” meter  (52,500\ngallons)\n$173.25\n4” meter (93,750\ngallons)\n $309.38\n6” meter (210,000\ngallons)\n $693.00\n8” meter (375,000\ngallons)\n$1,237.50\n(III) In addition to the minimum charge per month, as identified in Paragraph II above, all water usage shall be\nbilled at three dollars and thirty cents ($3.30) per 1,000 gallons over the minimum allowed consumption associated\nwith the meter size.\n(c) Rural Residential and Small Commercial\n(I) Applicability. Applicable for water service outside the corporate limits of the City to all services with a smaller\nthan one and one-half inch (1 ½”) meter.\n(II) Minimum charge per month for up to 7,500 gallons of water:\n5/8” meter\n $41.25\n3/4” meter\n $41.25\n1” meter\n $41.25\n \n(III) In addition to the minimum charge per month, as identified in Paragraph II above, all water usage shall be\nbilled at $5.50 per 1,000 gallons over the 7,500 gallons minimum.\n(d) Rural Large Commercial, Industrial and Association.\n(I) Applicability. Applicable for water service outside the corporate limits of the City to all services with a one and\none-half inch (1-1/2”) meter or larger.\n(II) Minimum charge per month:\n1 ½” meter\n(13,125 gallons)\n$86.63\n2” meter (26,250\ngallons)\n$173.25\n3” meter (52,500\ngallons)\n$346.50\n4” meter (93,750\ngallons)\n$618.75\n6” meter\n(210,000 gallons)\n$1,386.00\n8” meter\n(375,000 gallons)\n$2,475.00\n \n (III) In addition to the minimum charge per month, as identified in Paragraph II above, all water usage shall be\nbilled at six dollars and sixty cents ($6.60) per 1,000 gallons over the minimum allowed consumption associated\nwith the meter size.\n(Ord. 3075, Sec. 12-74(1), repealed and reenacted, eff. 5/12/23)\n  (2)  Connection and disconnection fee.    \n    (a)  In any case where any water service of any kind is connected or disconnected by the City or its authorized\nagents, thereof shall be paid a fee of Ten Dollars ($10.00) for said connection or disconnection if the work is done\nduring normal working hours.  If done other than during normal working hours, or on weekends or holidays, the fee\nshall be Twenty Dollars ($20.00) for the connection.    \n    (b)  The said fee shall be paid within seven (7) days after the work is done upon proper invoice or statement to the\ncustomer.  (Ord. 1220, 4-13-82).    \nSection 12-75.      Regulations part of contract.     \n    All regulations contained in this Article shall be considered a part of the contract of every person taking water from\nthe waterworks of the City, and every person taking water shall be considered as having expressly consented to be\nbound thereby.    \nSection 12-76.      Unlawful acts.     \n    It shall be unlawful for any person to use or take water from the City waterworks without a permit therefor, or to\nmake any fraudulent representation for the purpose of obtaining water, or for any person to take or use water from\nthe waterworks for a different purpose than that provided in the customer's permit, or for any person to violate any\nof the regulations set forth in this Article.    \nSection 12-77.      Right of City to shut off water in mains; precautionary measures by customer;\nNonliability of City.     \n   The City reserves the right at any time, without notice, to shut off the water in its mains for the purpose of making\nrepairs, extensions or for other necessary purposes, and all persons having boilers or other appliances on their\npremises depending on the pressure of the pipes to keep them supplied with water, are hereby cautioned against\ndanger from these sources, and are required to provide, at their own expense, suitable safety appliances to protect\nthemselves against such danger.  In any event, it is expressly provided that no claim whatever shall be made against\nthe City by reason of any damage resulting from water having been cut off, either through accident or necessity. (Ord.\n1958, Sec. 29-42.)    \nSection 12-78.      Right of entry to repair; notice to owner to make repairs.     \n    The Superintendent or such other person as may be directed by the Superintendent shall be authorized to enter\nand have free access at all reasonable hours to premises to ascertain the location or condition of all hydrants, pipes\nor other fixtures attached to said water works.  In the event he/she finds that water is wasted on account of\nnegligence or for want of repairs, and if such waste is not immediately remedied, the water leading to such premises\nshall be turned off.  It shall be the duty of such officer if he/she discovers any defect in a private pipe between the\nCity main pipe and the stopcock to give notice in writing to be left at the premises, if occupied, and if not occupied,\nwith the owner or his/her agent, and if the necessary repairs are not made within five (5) days thereafter, unless an\nemergency exists requiring a shorter time period, the water shall be turned off.    \nSection 12-79.   Using water in violation of sprinkling restrictions.    \n    It shall be unlawful for any person to use the water for irrigation, sprinkling or any other purposes in violation of\nrestriction on such use imposed by City Council pursuant to Section 12-62.  \nSection 12-80.      Using water or appurtenances without authority.     \n    It shall be unlawful for any person to use the water from any part of the waterworks or to open any fire plug,\nstopcock, or valve, or other fixture appertaining to such works, after the same has been shut off as provided in this\nArticle or otherwise without lawful authority, or let or shut off water into or from any pipe, without lawful authority.  \n \nSection 12-81.      Polluting water in waterworks; obstructing conduits.     \n    It shall be unlawful for any person to throw or cast or put any substance into any reservoir, storage tank, stream,\ntrench, pipe, drain, ditch or conduit, used in and necessary for the construction, maintenance and operation of the\nwaterworks, and which substance shall tend to fill up such reservoir, or to fill up or obstruct the flow of water in any\nsuch stream, trench, pipe, ditch, conduit, or to throw, cast, or put into any such reservoir, trench, stream, ditch, pipe,\nor conduit, any toxic or unwholesome substance that shall tend to pollute the water therein.    \nSection 12-82.      Polluting water source prohibited.     \n    It shall be unlawful for any person to throw or cast into a stream or any source from which water for the City\nwaterworks is taken, for five (5) miles above the point which it is taken, any filthy or other substance that shall tend\nto pollute the water therein.  (Ord. 1958, Sec.  29-49.)    \nSection 12-83.      Injuring or damaging waterworks property.     \n   It shall be unlawful for any person to injure or deface, impair or destroy any part of any appurtenances of the\nwaterworks or any property belonging to the waterworks or used in connection therewith.  (Ord. 1958, Sec. 29-51.)   \nSection 12-84.      Covering up curb box.    \n   It shall be unlawful for any person to build over or cover up any curb box or stopcock belonging to the City\nwaterworks or used in connection therewith.  (Ord. 1958, Sec. 29-52.)   \n    Section 12-85.      Permit to re-sell water.    \n  \n(1) Any person wishing to re-sell water obtained from the City Water Utility shall first obtain an annual permit from\nthe City Manager to re-sell water and pay a fee of $125.00. The permit shall expire one year after its issuance. The\npermittee may apply for a renewal within ninety (90) days before the expiration date. The permit for resale of water\nis required in addition to any of the other permits required for water connections prescribed by this chapter. The City\nManager shall not issue a water resale permit without first finding that:\n(a) The applicant has already obtained the required permit for main connections with City Water Utility;\n(b) The applicant has obtained product insurance to protect and hold the city harmless in the event there is any\ndamage or injury resulting from the quality of the water sold to and resold by the permit holder; and\n(c) The estimated quantity of water to be resold will not be of such a volume to interfere with the water service to be\nprovided to existing water utility customers.\n (Ord. 3075, Sec 12-85(1) repealed and reenacted eff. 5/12/23)\n   (2) The issuance of such permit shall be conditioned on the following: (Ord. 1603, eff., 3-27-99)   \n   (a) The applicant observes all Colorado Department of Health Regulations, and city and county health\nrequirements; and (Ord. 1603, eff., 3-27-99)   \n   (b) The applicant signs an agreement evidencing the understanding that this permit can be suspended if required\nby the water needs of the City. (Ord. 1603, eff., 3-27-99)   \n   (3)  Failure to satisfy any of the conditions set forth in subsection (2) shall constitute grounds for the revocation of\nthis permit by the City Manager.  (Ord. 1603, eff., 3-27-99)   \n   (4) Any person who resells water obtained from the City Water Utility without obtaining the required permit, shall\nbe guilty of a misdemeanor, and shall also be subject to termination of his/her residential and/or commercial water\nservice. (Ord. 1603, eff., 3-27-99)   \n   (5) Any person who resells water obtained from the City Water Utility must have an additional meter installed on\nhis/her residential and/or commercial water tap to separately measure the volume of water used for resale purposes.\nSuch person shall be charged a base amount of $16.50 per 1,000 gallons used for resale purposes. (Ord. 3075, Sec 12-\n85(5) repealed and reenacted eff. 5/12/23)\n   (6) The resale of water shall be limited to residents of Las Animas County.  No out-of-county sales shall be\npermitted.  Water shall be resold for residential and domestic use only.  No water shall be resold for commercial,\nindustrial, or fire-fighting purposes. (Ord. 1699, eff., 8-30-02)   \n   (7) Water resold in quantities greater than those identified in the water resale contract and or water re-sale permit\nshall be subject to a surcharge of no less than the rate as identified above in the W-4 Rural Large Commercial,\nIndustrial and Association rate in addition to the base amount above. (Ord. 1699, eff., 8-30-02)  \nSection 12-86.  Backflow Prevention and Cross-Connections      \n  (1)  Definitions  \n   Unless the context specifically indicates otherwise, the meanings of   terms used in this Chapter shall be as follows:\n  \n   a.       \"Approved backflow prevention assembly\" means a backflow prevention assembly described in Foundation\nfor Cross-Connection Control and Hydraulic Research's (FCCC&HR)   most current \"list of approved backflow\nprevention assemblies\" or American Society of Sanitary Engineers (ASSE).   \n   b.       \"Backflow\" means the undesirable reversal of the direction of flow of water or mixtures   of water and other\nliquids, gases, or other substances into the distribution pipes of the potable   water supply from any source(s) caused\nby backpressure and/or backsiphonage.     \n   c.       \"Backflow preventer\" means a device designed to prevent backflow created by   backpressure or\nbacksiphonage.   \n    d.         \"Backpressure\" means backflow caused by a pump, elevated tank, boiler or means that   could create an\nelevated pressure within the nonpotable system greater than the supply pressure.   \n   e.         \"Backsiphonage\" means the flow of water or other liquids, mixtures or substances into   the distribution\npipes of a potable water supply system from any source other than its intended   source caused by negative or sub-\natmospheric pressure in the potable water supply system.   \n   f.        \"Certified cross-connection control technician\" means a person who has the responsibility for the testing,\noperation and maintenance of cross-connection control devices and is certified as specified in accordance with the\nprovisions of Article 11 of the Colorado Primary Drinking Water  Regulations.  \n   g.         \"Colorado Cross-Connection Control Manual\" means the most recent edition of a manual that has been\npublished by the state addressing cross-connection control practices which will be   used as a guidance document for\nthe utility in implementing a cross-connection control program  as outlined in Section 12-86(2)  \n   h.         \"Containment\" means the installation of an approved backflow prevention device, or   method, on the water\nservice line(s), so that water delivered to the service line cannot return to   the City potable water distribution system\ndue to any backpressure and/or backsiphonage   condition which might arise.   \n   i.          \"Contamination\" means an impairment of the quality of the potable water by sewage, industrial fluids or\nwaste liquids, compounds or other materials to a degree which creates an   actual hazard to the public health through\npoisoning or through the spread of disease.   \n   j.          \"Cross-connection\" means any physical arrangement whereby a public water supply is   connected, directly\nor indirectly, with any other water supply system, sewer, drain, conduit, pool,   storage reservoir, plumbing fixture or\nother device which contains, or may contain, contaminated   water, sewage or other waste or liquid of unknown or\nunsafe quality which may be capable of   imparting contamination to the public water supply as a result of backflow.\nBypass   arrangements, jumper connections, removable sections, swivel or changeover devices, four-way   valve\nconnections, and other temporary or permanent devices through which, or because of   which, backflow could occur\nare considered to be cross-connections.   \n    k.       “City Manager” means the City Manager of the City of Trinidad or, if this person is not available, his or her\nsubordinate designated   by the City Manager in writing.    \n    l.        \"Hazard degree” means an evaluation of the potential risk to public health and the   adverse effect of the\nhazard upon the potable water system.    \n    m.   \"Isolation\" means a backflow device installed on a branch of the internal plumbing to   protect the customer's\nwater system.    \n    n.  \"Non-potable water\" means water that is not safe for human consumption or that is of questionable quality.   \n   o.         “Plumbing Codes” means the most recent edition of the plumbing codes that has been published by\nInternational Code Council and adopted by city ordinance.     \n   p.       \"Pollution” means the presence of any foreign substance (organic, inorganic, radiological   or biological) in\nthe water that may degrade the water quality so as to constitute a hazard or  impair its usefulness.  \n   q.   \"Potable water\" means water free from impurities in amounts sufficient to cause disease   or harmful\nphysiological effects. The bacteriological, chemical and radiological quality shall   conform with State of Colorado\nDepartment of Public Health and Environment Primary Drinking  Water Regulations.  \n   r.   \"Utility\" means the City of Trinidad's Water Department, a water activity enterprise of  the City of Trinidad.  \n   s.        \"Water service connection\" means the customer's water service connection from   the point of tap on the\npublic potable water system;  to the point where the service line enters the customer's structure (residential or\nbusiness) including the customer's stop box or shut-off valve or meter, whichever  comes first, from the utility water\nmain.   There shall   be no unprotected takeoffs from the service line ahead of any meter or backflow prevention  \ndevice located at the point of delivery to the customer's water system. Service connection shall   also include any\nother temporary or   emergency water service connections from a fire hydrant or any connection to the public potable\nwater system.             \n     (2) Requirements     \n   a.   Implementation and Enforcement of a Cross-Connection Control Program   \n   (I) The City Manager and/or his or her designee  is vested with the authority and responsibility for implementing\nand enforcing an effective cross-  connection control program in accordance with the provisions of this Chapter.   \n   b.         Backflow   Preventers Required At All Service Connections.   \n   (I)  The City Manager and/or his or her designee will identify those customers who are likely to have a cross\nconnection and an approved backflow preventer shall be required to be installed at any uncontrolled water service\nconnection   for the safety and protection of the City’s water supply system and water users connected  to that\nsystem.  \n  (II)       Property owner’s and/or Agent’s of the property shall be required to obtain a Backflow Service Permit (BSP)\nprior to the installation of the backflow prevention device.  The installation of the backflow preventer must be\nperformed by a licensed plumber or certified cross connection control technician.  The city reserves the right to\nimpose a fee for the issuance of the Backflow Service Permit.    \n   c.       The City Manager and/or his or her designee shall have the authority to specify the type of backflow preventer\nto be  installed at each service connection. The decision with respect to the type of backflow  preventer that will be\nrequired in any specific situation shall be based upon:   \n   (I)  The degree of hazard   posed by the facility connected or to be connected to the City water supply system.   \n   (II) The degree  of hazard shall be determined on a case-by-case basis, depending upon the circumstances of each\n particular case.   \n   (III) In making determinations as to the degree of hazard and the type of device   required, owners shall rely upon\nthe latest published edition of the Colorado Cross-  Connection Control Manual for guidance and may rely upon\nother generally accepted authorities,  including but not limited to the official publications of the American Society of\nSanitary  Engineering and Section 608 of the International Plumbing Codes.  \n  (IV) The City Manager and/or his or her designee may give notice in writing to the customer to install such an\napproved  backflow prevention device at each service connection to the customer's premises.   \n     d.       Inspections   and Testing Procedures     \n   (I)   The City Manager and/or his or her designee has the authority to inspect any system owned and maintained by\na utility customer to determine the extent and degree of hazard.   \n   e.         The City Manager and/or his or her designee  shall notify the utility customer/owner at any premises where\ncontainment backflow  preventers are installed to have certified inspections and operational tests made upon\ninstallation   of the containment device and at least once per year thereafter.   \n   (I) The City Manager and/or his or her designee may require   certified tests at more frequent intervals if the\npotential hazard is deemed to be great enough. These inspections and tests shall be performed by a certified cross-\nconnection control  technician.  \n   f.          The City Manager and/or his or her designee   reserves the right to inspect or require the inspection of\ninstalled backflow   preventers at any time to ensure the devices are in proper working order. The devices shall be  \nrepaired, overhauled or replaced whenever they are found to be defective. These inspections,   tests and repairs shall\nbe at the owners' expense. Records of such tests, repairs and overhaul, including materials and parts changed, shall\nbe filed with the City Manager’s office within ten days of such activities. The Utility shall keep and maintain such\nrecords in accordance with the requirements  of applicable law.    \n   (I)   Containment devices will be tested annually according to the Colorado Revised   Statutes and Colorado\nDepartment of Public Health and Environment Primary  Drinking Water Regulations.  \n  (II)  If such devices are allowed by the City Manager and/or his or her designee as an acceptable alternative to total\ncontainment, isolation devices used to isolate and lower the overall degree of  hazard for a property will be tested on\na schedule determined by the City Manager and/or his or her designee.  \n    (III)   Isolation devices used on lawn irrigation sprinkler devices will be tested upon   installation, repair or\nrelocation, but in any event no less often than once annually.              \n     g.        Policy     \n   (I)  No water service   connection to any premises shall be installed or maintained   unless the water supply is\nprotected as required by Colorado Revised Statutes, the   regulations of the Colorado Department of Public Health\nand Environment and by  this Chapter.    \n    (II)  Water service   to any premises shall be denied or discontinued, as the case may be,  by the Utility if:   \n   (A)  A  backflow preventer required by this Chapter is not installed within the   time period specified; or    \n   (B)  An approved backflow  preventer has been removed or bypassed; or    \n   (C)  An unprotected   cross-connection exists on the premises; or   \n   (D)  An approved   backflow preventer is not maintained.   \n    (III)  Whenever   service is denied or discontinued, it shall not be provided or restored   until the condition or\ndefect identified in subparagraph 12-86(2)(g)(II) has been corrected.    \n    (IV)  The customer’s   system shall be open for inspection at all reasonable times to   authorized representatives of\nthe City Manager and/or his or her designee to determine whether cross-connections  or other structural or sanitary\nhazards, including violations exist.   \n    (V)  When, as a result   of an inspection, a condition involving a violation   results in a health or sanitary hazard is\ndetermined to exist, or a utility customer and/or owner fails to properly test, repair, or otherwise maintain a\nbackflow preventer as required, the City Manager and/or his or her designee shall have the option of immediate  \ndiscontinuance of water service to the premises until the condition has been   corrected, or may specify a date for\ncompliance after which time the City Manager and/or his or her designee   may discontinue service until the\ncustomer has corrected the condition.    \n    h.         Installations of Back   flow Prevention Devices      \n    (I)  At the customer’s expense, backflow   preventers shall be installed immediately downstream of the water  \nservice customer's water meter, whether the meter is a pit set or an interior set. In   all cases, backflow preventers\nmust be installed before the first branch line   leading off the service line.    \n    (II)  With the City Manager and/or his or her designee   approval, a backflow preventer may be installed to isolate\na hazard and lower the degree of hazard for containment.   Such approval shall not   be given unless the City Manager\nand/or his or her designee is convinced that the use of the isolation device will  pose no threat to the public water\nsupply system.   \n    (III)  All backflow preventers   shall be located and installed according to the   manufacturer's specifications and in\naccordance with the   Colorado Cross-Connection Control Manual. The City Manager and/or his or her designee shall\nreview and approve all   plans as to the type, location and installation of backflow prevention devices.    \n    (IV)  Utility customers and/or owners   shall be responsible for the design, installation and maintenance of\nproperly sized and located drains and drain systems whenever the type of   backflow preventer specified or approved\nby the City Manager and/or his or her designee requires a drain.    \n    (V)  Plans   shall not be modified relative to the type, location or installation of any   backflow preventer approved\nby the City Manager and/or his or her designee without the City Manager and/or his or her designee’s prior  \nknowledge and written authorization.    \n    (VI)  If the location  or removal of the backflow preventer results in the meter becoming  contaminated, the\ncustomer shall bear the cost of decontamination.    \n    i.          Device Testing Equipment    \n    (I)  The   acceptability of any testing gauge or apparatus shall be determined by the City Manager and/or his or\ndesignee  .   \n    (II)   Any testing gauge, apparatus or scientific instrument utilized for the testing of   backflow prevention devices\nshall be checked for accuracy at least yearly and be   in calibration as certified by the cross connection technicians\nwho perform the testing. The City Manager and/or his or her designee may require written certificates or other proof\nof calibration  for such items to be filed with the utility.   \n    (III)  At a   minimum, all test gauges must meet ASSE-1064 Standards for Gauges.      \n    (IV)   All Certified Cross-Connection Technicians who perform work in the City shall obtain a contractor’s license\nand   file copies of their licenses.              \n     j.        Listings Identifying Approved Backflow Prevention Devices     \n   (I) Any approved backflow   prevention assembly required shall be of a type and size approved by the City Manager\nand/or his or her designee and listed in the FCCC & HR's List of Approved Backflow Prevention Assemblies,  \nAmerican Society of Sanitary Engineers (ASSE) Series 5000 and/or Colorado Plumbing Codes.     \n   (3)  Compliance Procedures   \n   a.         Installation of Required Devices   \n    (I)  Upon   completion of inspection of the premises, or, in the case of new   construction, on review of the\nconstruction plans, the City Manager and/or his or her designee shall notify the   owner in writing of the type of\ndevice that will be required at each service   connection within the owner's facility.    \n    (II)   The owner shall, at its expense, purchase and install the device and any necessary   plumbing or construction.\nSuch plumbing and construction shall meet all   provisions of the Colorado Cross-Connection Control Manual,\nPlumbing Codes and/or City of Trinidad   design standards and construction specifications and must be   inspected\nand approved by the City Manager and/or his or her designee. The device, including any device installed   prior to the\neffective date of this ordinance, shall be the property of the owner.    \n   b.         Compliance Required   \n   (I)   The utility will take necessary action to ensure compliance with the Colorado Department of Health, Primary\nDrinking Water Regulations, 5 CCR 1003-1, and   more specifically Article 11 thereof, and the Colorado Revised\nStatues, Section  25-1-114, as amended.  \n   (II)   The owner of the premises is required to permit entry to the premises for inspection, testing and maintenance\npurposes at reasonable times. Failure to   permit entry to the premises will result in the premises being regarded as a\nhigh   hazard, and a reduced-pressure-principle device will be required to protect the  City of Trinidad’s water supply\nsystem.  \n    (III)   The owner is required to provide all necessary plumbing and construction needed  for the installation of the\ndevice. Failure to provide such required plumbing and           construction will result in action being taken as provided\nfor in Section 12-86(6).   \n   (IV)  A member of the board of appeals or employee of the       City of Trinidad charged with the enforcement of this\ncode, while acting for the jurisdiction in good faith and without malice in the discharge of the duties required by this\ncode or other pertinent law or ordinance, shall not thereby be rendered liable personally and is hereby relived from\npersonal liability for any damage accruing to persons or property as a result of any act or by reason of an act or\nomission in the discharge of official duties.  Any suit instituted against an officer or employee because of an act\nperformed by that officer or employee in the lawful discharge of duties and under the provision of this code shall be\ndefended by a legal representative of the jurisdiction until the final termination of the proceedings.   The City\nManager or any subordinate shall not be liable for the cost in any action, suit or proceeding that is instituted in\npursuance of the provisions of this code.   \n   (4)  Appeals   \n   a.   Any decision of the City Manager and/or his or her designee concerning the type of backflow preventer required\nwith   respect to any water service connection, may be appealed to the City of Trinidad Board of Building Code\nAppeals, provided the owner files   a notice of appeal to the Office of the City Clerk within 15 days following  the date\nupon issuance of the city’s written notice.  \n   b.   The notice of appeal shall identify the property owner by name, mailing address,   telephone number and email\naddress, if any, and include the address of the owner's facility. In addition, the  notice shall:  \n  (I) Identify the City Manager and/or his or her designee’s decision, which is being appealed; and  \n   (II)  Identify the type of backflow preventer that the owner believes should be installed   at the owner's facility; and  \n \n  (III)  Include the owner's reasons for preferring such backflow preventer, instead of the backflow preventer\ndesignated by the City Manager and/or his or her designee, with or without written   documentation supporting the\nowner's position.   \n  c. After owner’s and/or agent’s  filing of the notice of appeal, the City Clerk, by  written notice specifying the date,\ntime and place of the hearing, shall schedule a hearing. Such  hearing shall be conducted within 20 days following\nthe date upon which the notice of   appeal was filed, unless the owner and the City Manager both agree to a later\nhearing date.   At the hearing, the owner may present testimony, evidence and arguments in support of the   owner's\nposition and the City Manager and/or his or her designee may present testimony, evidence and arguments in support\nof  the City Manager and/or his or her designee’s decision.    \n  d.  The City Manager’s and/or his or her designee’s decision shall be affirmed unless the Board of Building Code of\nAppeals finds that the City Manager’s and/or his or her designee’s decision was arbitrary or capricious or that such\ndecision violates applicable federal,   state or local law. The Board of Building Code of Appeal’s decision shall be\nrendered at the said hearing and the decision shall be  final.  \n   e.   The paramount issue with respect to any appeal will be whether the type of backflow   preventer authorized will\nadequately protect the public water supply system.   \n      f.     Before deciding any appeal, the Board of Building Code of Appeals shall consider:          \n    (I)  W   hether the backflow preventer specified by the City Manager and/or his or her designee is necessary to  \nadequately protect the City's water supply system;    \n    (II)  Whether the backflow preventer preferred by the owner would adequately protect the City's water supply\nsystem;    \n    (III)   Whether the use of the backflow preventer preferred by the owner, when   compared to the backflow\npreventer designated by the City Manager and/or his or her designee, is likely to result  in a material decrease in the\nlevel of protection to the public water supply system.     \n   g.   In cases where an existing structure is being remodeled or reconstructed or where a   change in the use of an\nexisting structure will or may create a greater degree of hazard to the   public water supply system than previously\nexisted, the City Manager may consider:   \n   (I)   Differences in the type of devices and backflow prevention assemblies, when  comparing the type of backflow\npreventer specified by the City Manager and/or his or her designee to the type of  backflow preventer preferred by\nthe owner;   \n   (II)   Differences in the installation and maintenance of the two types of backflow   preventers being compared;   \n   (III)   Other significant differences or practical difficulties associated with the use,   installation and/or\nmaintenance of the backflow preventers being compared;     \n   (IV)   Other relevant life, safety or health concerns raised by the City Manager and/or his or her designee or the\nowner.   \n   (5)         Jurisdictional issues and conflicts:     \n   In the event the provisions of 12-86   are in conflict with the requirements of any plumbing code or regulation\napplicable in the City of Trinidad,   the provisions of 12-86 shall apply to the extent necessary to resolve the conflict\nand shall   be binding upon all plumbing officials performing official duties within the City.   \n   (6)  Violations and Penalties   \n   a.   The City Manager and/or his or her designee shall notify the owner, or authorized agent of the owner, of the\nbuilding or   premises of a violation of this Chapter. The City Manager and/or his or her designee shall set a specific\ntime for the owner to   have the violation removed or corrected. If the owner fails to correct the violation in the  \nspecified time, the City Manager and/or his or her designee may, if in his or her judgment decide the connection\nposes an imminent health hazard,   suspend water service to the building or premises. Additional fines or penalties\nmay also be   invoked following suspension of service.   \n   b.   Violations of this Chapter may be prosecuted in municipal court and, upon conviction   thereof, a violator may\nbe fined at a minimum of $300 and not to exceed $2,650 per violation, per day.   \n   (Ord. 1959, Sec. 12-86, eff. 5/16/14)  \n                      \n"
}