{"document": "Gas Tariff 1", "content": "Gas Tariff No. 1\nCity of Trinidad       ,        Colorado                  \nTrinidad Municipal Natural Gas Department   \nGas Tariff No. 1 \nCommunications regarding this Tariff should be addressed to:  \nCity Manager  \nCity of Trinidad     ,      Colorado             \n135 N. Animas Street            \nP. O. Box 880  \nTrinidad     ,      CO         81082             \n(719) 846-9843  \nTABLE OF CONTENTS      \n  I. Introduction  \n  II. Gas Service Classifications  \n  1.0 Rate Schedule for Residential Sales (\"RS\") Service\n 2.0 Rate Schedule for Commercial Sales (\"CS\") Service\n 3.0 Rate Schedule for Special Contract (\"SC\") Service  \n  III. Rates and Service Charges  \n  IV. Rules and Regulations  \n\n  1.0 Definitions\n 2.0 Meters, Meter Reading, and Billing\n 3.0 Continuity of Service\n 4.0 Requested Alterations to City's Facilities\n 5.0 Customer Use and Facilities\n 6.0 Definition of a Cubic Foot of Gas|\n 7.0 Meter Testing\n 8.0 Gas Supply Charge\n 9.0 Extension Policy\n 10.0 Meter Locations\n 11.0 Pipe Material, Pipe Sizes, and Installation of Piping\n 12.0 Penalty for Violation\n 13.0 Non-liability of City  \nI. INTRODUCTION \n \n This Tariff governs the provision of natural gas service by the Trinidad Municipal Natural Gas Department.  Pursuant to\nthe rates and regulations set forth herein, the Trinidad Municipal Gas Department shall provide natural gas service to all\ncustomers in a manner consistent with standards precluding undue discrimination.  A copy of this Tariff shall remain on\nfile and available for public inspection at the Office of the City Clerk for the City of Trinidad, Colorado.\n Following this Introduction, this Tariff is presented in the following sections:  \n  II.  Gas Service Classifications.  This section sets forth the customer classifications under which the Trinidad\nNatural Municipal Natural Gas Department sells and delivers natural gas to its customers.\n III.  Rates and Service Charges.  This section sets forth the Schedule of Rates and the Schedule of Service Charges\nthat apply to customers of the Trinidad Municipal Natural Gas Department.\n IV.   Rules and Regulations.  This section sets forth the conditions, rules, and regulations applicable to the Trinidad\nMunicipal Natural Gas Department’s provision of natural gas service.  \n  This Tariff shall become effective on the 1st day of December, 2008, pursuant to Ordinance No. 1866 of the City Council\nfor the City of Trinidad, Colorado.\n This Tariff may be revised, amended, supplemented, or otherwise changed from time to time by ordinance of the City\nCouncil for the City of Trinidad, Colorado.  Such changes, when effective, shall have the same force and effect as the\npresent Tariff.  \nII. GAS SERVICE CLASSIFICATIONS \n 1.0 Rate Schedule for Residential Sales (“RS”) Service   \n  1.1 Availability\n Available within the entire territory served by the Trinidad Municipal Natural Gas Department.  \n  1.2 Applicability\n Applicable to residential sales service where service is for domestic purposes only, in single-family units, duplexes,\nindividually metered multi-family units, and multi-family units comprised of no more than three (3) units with a single\nmeter.  Residences used for commercial purposes shall be billed at the Commercial Sales service rate if the commercial\nportion of the residence exceeds 50% of the residence, unless the residential and commercial services are arranged to allow\nseparate metering of residential and commercial portions.  \n  1.3 Rates at Billing Pressure Base\n The charge for service for each month shall be the sum of the following components:\n Metering & Billing Charge.  The Metering & Billing Charge shall be the Metering & Billing Rate as contained on the Rates\nand Service Charges on Sheet No. 6 for each month in which the customer receives service.\n Delivery Charge  . The Delivery Charge shall be obtained by multiplying the Delivery Rate as contained on the Rates and\nService Charges on Sheet No. 6 times the CCF of gas used by the customer during the month.\n Gas Supply Charge.  The Gas Supply Charge shall be obtained by multiplying the Gas Supply Rate as contained on the\nRates and Service Charges on Sheet No. 6 times the CCF of gas used by the customer during the month.  The Gas Supply\nCharge shall be subject to adjustment from time to time as set forth in the Gas Supply Charge Tariff provisions in Section\nIV.8.0 on Sheet No. 19.  \n  1.4 Taxes\n All rates are net and subject to all applicable taxes.  \n  1.5 Rules and Regulations\n All service under this Rate Schedule shall be subject to the Rules and Regulations contained in this Tariff.\n \n 2.0 Rate Schedule for Commercial Sales (“CS”) Service   \n  2.1 Availability\n Available within the entire territory served by the Trinidad Municipal Natural Gas Department.  \n  2.2 Applicability\n Applicable to commercial sales service where service is taken through one meter for commercial purposes to non-\nresidential customers.  Multi-metering of the same service is prohibited unless special conditions exist and approval is\ngranted by the Superintendent, which approval may be conditioned.  \n  2.3 Rates at Billing Pressure Base\n The charge for service for each month shall be the sum of the following components:\n Metering & Billing Charge.  The Metering & Billing Charge shall be the Metering & Billing Rate as contained on the Rates\nand Service Charges on Sheet No. 6 for each month in which the customer receives service.\n Delivery Charge.  The Delivery Charge shall be obtained by multiplying the Delivery Rate as contained on the Rates and\nService Charges on Sheet No. 6 times the CCF of gas used by the customer during the month.\n Gas Supply Charge.  The Gas Supply Charge shall be obtained by multiplying the Gas Supply Rate as contained on the\nRates and Service Charges on Sheet No. 6 times the CCF of gas used by the customer during the month.  The Gas Supply\nCharge shall be subject to adjustment from time to time as set forth in the Gas Supply Charge Tariff provisions in Section\nIV.8.0 on Sheet No. 19.  \n  2.4 Taxes\n All rates are net and subject to all applicable taxes.  \n  2.5 Rules and Regulations\n All service under this Rate Schedule shall be subject to the Rules and Regulations contained in this Tariff.  \n   3.0 Rate Schedule for Special Contract (“SC”) Service   \n  3.1 Availability\n Applicable within the entire territory served by the Trinidad Municipal Natural Gas Department, subject to approval by\nthe City Council.  \n  3.2 Applicability\n Applicable to all consumers designated by the Trinidad Municipal Natural Gas Department as not suited to other\nconsumer rate classes, when a special contract defining the terms and rates for service has been executed by the City and\nthe customer.  \n  3.3 Rate\n The charges for service for each month shall be as contained in the Special Contract Service agreement.  \n  3.4 Taxes\n All rates are net and subject to all applicable taxes.  \n  3.5 Rules and Regulations\n All service under this Rate Schedule shall be subject to the Rules and Regulations contained in this Tariff.  \n   III. RATES AND SERVICE CHARGES \n \nSchedule of Rates \n  Schedule of Rates   \n   Rate      Schedule   \n   Sheet      No.   \n   Type of Charge      Billing\nUnits   \n   Rate/   \n Charge   \n   RS   \n  3  \n  Metering & Billing\nCharge  \n  Per\nCustomer  \n  $11.00  \n   \n   \n  Delivery Charge  \n  CCF  \n  $0.2154  \n   \n   \n  Gas Supply\nCharge  \n  CCF  \n  (Note 1)  \n  CS  \n  4  \n  Metering & Billing\nCharge  \n  Per\nCustomer  \n  $22.65  \n   \n   \n  Delivery Charge  \n  CCF  \n  $0.2154  \n   \n   \n  Gas Supply\nCharge  \n  CCF  \n  (Note 1)  \n  SC  \n  5  \n  Metering & Billing\nCharge  \n  Per\nCustomer  \n  $22.65  \n   \n   \n  Delivery Charge  \n  CCF  \n  $0.2154  \n   \n   \n  Gas Supply\nCharge  \n  CCF  \n  (Note 1)  \nNote 1: The Gas Supply Charge will be determined in accordance with the provisions of Section IV.8.0 of this Tariff.   \nSchedule of Service Charges   \nType of Service\nAmount\nTo transfer service at a specific location from one customer to another customer\nwhere such service is continuous and does not require a premise visit.\n$10.00\nTo institute or reinstitute gas service requiring a premise visit\n$25.00\nTo perform non-gratuitous labor for service work in addition to charges for\nmaterial is as follows:\n \nTrip Charge  \n  (Assessed when no actual service work, other than a general diagnosis of the\ncustomer's problem is performed.)\n$25.00\nFor service work during normal working hours, per man-hour  Minimum\nCharge, one hour \n$25.00\nAn overtime rate will be applicable to non-gratuitous labor for service work\nperformed before and after normal working hours of       8:00 AM to 5:00 PM      \nMonday through Saturday.     The overtime rate shall be, per man hour\n(Minimum Charge, one hour)\n$45.00\nWhen such service work is performed on Sundays and holidays, per man hour\n(Minimum Charge, one hour)\n$90.00\nTo process a check from a customer that is returned to the City by the bank as\nnot payable\n$20.00\nIV.  RULES AND REGULATIONS \n \n The Trinidad Municipal Natural Gas Department shall supply natural gas service to all customers in accordance with the\nfollowing Rules and Regulations.  These Rules and Regulations shall be deemed to be a part of every contract or agreement\nfor service, whether written, oral, or implied, made by the Trinidad Municipal Natural Gas Department.  No agent or\nemployee of the Trinidad Municipal Natural Gas Department has authority to make any promise, agreement, or\nrepresentation that is inconsistent with the provisions of this Tariff.\n 1.0 Definitions\n 1.1 “Applicant” or “Applicants” means an individual or individuals, association, firm, partnership, company, or\ncorporation making application to the City for gas service.\n 1.2 “Billing Pressure Base” means the pressure base at which the City bills its customers for natural gas.  Billing Pressure\nBase is 12.10 p.s.i.a.\n 1.3 “British Thermal Unit” (BTU) means the amount of energy required to increase the temperature of one (1) pound of\nwater one (1) degree Fahrenheit at fifty-nine (59) degrees Fahrenheit.\n 1.4 “Capacity” means the maximum gas volume that any particular segment of the City’s system is capable of carrying\nunder then current operating conditions.\n 1.5 “CCF” means one hundred (100) cubic feet of gas.\n 1.6 “City” means the City of Trinidad, Colorado.\n 1.7 “Commercial Establishment” means any establishment engaged in the operation of a business, whether for profit or\nnot for profit.  Such enterprises include, without limitation, clubs, fraternities, sororities, lodges, hotels, apartment and\nrooming houses, tourist and cottage camps, trailer camps, camp grounds, schools, municipal buildings, churches,\ngreenhouses, and dairies.\n 1.8 “Commercial Service” means the furnishing of natural gas for exclusive use of the individual customer for cooking,\nwater heating, space heating, heat applications, and miscellaneous purposes in a commercial establishment.\n 1.9 “Commission” shall mean the Colorado Public Utilities Commission (PUC) and any other governmental body or bodies\nsucceeding to, lawfully exercising, or superseding any powers of the PUC.\n 1.10 “Construction Cost of Distribution Facilities” means the combined costs of all facilities necessary to the distribution\nextension, including satisfactory rights-of-way.\n 1.11 “Curtailment” means the inability of the distribution customer to receive natural gas due to a shortage of natural gas\nsupply.\n 1.12 “Customer” means any individually metered end user connected, or requesting to be connected, to the City's gas\nfacilities.\n 1.13 “Delivery Charge” means the rate designed to reimburse the City for expenses incurred in the delivery of natural gas\nto its customers, including, without limitation, a portion of operations and maintenance expenses, depreciation, payroll\nand associated expenses, capital outlays, in-lieu-of tax payments, and transfers to the general fund.\n 1.14 “Distribution Extension” means any construction of distribution facilities, including high and low pressure\ndistribution pipes, service lines and laterals, and all appurtenant facilities excepting meters and meter installation facilities\nnecessary to supply service to additional customers.\n 1.15 “Distribution System” means all of the City’s natural gas system and facilities used for the purpose of general\ndistribution of natural gas to its customers.\n 1.16 “Extension Completion Date” means the date on which the construction of a Distribution Extension or Distribution\nReinforcement is completed as shown by City records.\n 1.17 “Gas Supply Charge” means the rate designed to reimburse the City for expenses paid to gas suppliers and pipelines,\nincluding, without limitation, the cost of all gas supplies, upstream pipeline transportation expenses, and storage\nexpenses.\n 1.18 “Interruption” means the City’s inability to provide distribution service to a distribution customer due to constraints\non the distribution system.\n 1.19 “Local Pressure Base” means the pressure base at which the City delivers natural gas to its customers.  Local Pressure\nBase is 12.10 p.s.i.a.\n 1.20 “Meter Location” means the physical location of the meter measuring the amount of natural gas supplied to the\ncustomer.  Meter locations in all instances will be determined by the City and will be located so as to be accessible to the\nCity’s meter readers at all times.\n 1.21 “Metering & Billing Charge” means the rate designed to reimburse the City for expenses that do not vary with the\nvolume of natural gas consumed by customers, including, without limitation, meter reading expenses, accounting\nexpenses, and a portion of operations and maintenance expenses.\n 1.22 “MCF” means one thousand (1,000) cubic feet of gas.\n 1.23 “MMBTU” means one million (1,000,000) British thermal units.\n 1.24 “Point of Delivery” or “Delivery Point” means the point where the City’s facilities are first connected to the facilities of\nthe customer.  The location of the point of delivery will be determined by the City in accordance with standard practice or\nas individual circumstances may dictate.\n 1.25 “Point of Receipt” or “Receipt Point” means the point(s) at which the upstream facilities are interconnected with the\nCity’s distribution facilities and at which the gas flow is metered.\n 1.26 “p.s.i.a.” means pounds per square inch absolute.\n 1.27 “Residential Service” means the use of natural gas for cooking, water heating, space heating, clothes drying, and other\nsimilar purposes in a home, apartment, or other dwelling in which a person or people reside.\n 1.28 “Residence” means a home, apartment, or other dwelling in which a person or people reside.\n 1.29 “Service Line” means the pipe line and associated facilities located between the City’s distribution main line and the\npoint of delivery to the customer.  A Service Line provides service for the customer’s exclusive use.  \n2.0 Meters, Meter Reading, and Billing   \n  2.1 Metering of Service\n The City will install, own, and maintain suitable metering and other equipment necessary for measuring the natural gas\nsupplied.  All service to a customer under one applicable rate will be measured by a single meter installation, and meter\nreadings of one meter installation shall not be combined with the meter readings of another meter installation for billing\npurposes.\n Where service is supplied directly from a high-pressure transmission or distribution main, herein termed “main line”, to a\ncustomer or group of customers, and the City does not own or maintain the piping beyond the main line metering point,\nthe customer or group of customers so supplied shall be responsible for and pay the City for all gas as measured on the\nmain line meter.\n Standard delivery pressure of natural gas supplied by the City is four (4) ounces per square inch above average\natmospheric pressure.  Where necessary, the volume of gas as registered on the service meter may be adjusted to the\nforegoing condition for billing purposes.\n Customer shall consult the City regarding the necessity of changing the location of gas service before building any addition\nor structure, and the customer shall not build over existing natural gas lines.  Customer shall not enclose any exposed\nportion of gas service facilities unless approved by the City.  Customer shall notify the City of any leak or defect observed in\nthe City’s facilities.  \n  2.2 Meter Reading and Bill Forms\n Except as provided in paragraph Section IV.2.1, each service meter shall indicate clearly the cubic feet or other units of\nservice for which charge is made to the customer.  In cases where the dial reading of a meter (other than an orifice or other\nchart-type gas meter) must be multiplied by a constant to obtain the units consumed, the proper constant to be applied\nshall be clearly marked on the face or dial of the meter, if practical.  \n  2.3 Billing\n The Utility Service and Billing procedures set forth in Chapter 12, Article 1, of the Trinidad City Code, which are applicable\nto all utility services provided by\n the City of Trinidad, Colorado, are hereby incorporated by this reference as if fully set forth herein.  \n3.0 Continuity of Service   \n  3.1 City Responsibility – Non-liability\n The City will endeavor to furnish and supply, but does not guarantee, uninterrupted natural gas service.  The City will not\nbe liable for interruptions due to maintenance functions considered necessary or to causes or contingencies beyond the\ncontrol of the City, including, but not limited to, accidents, breakdown of equipment, acts of God, floods, storms, fires,\nstrikes, riots, vandalism, war, or authority and orders of government, or for disconnection because of unsafe\napparatus(es), operation of equipment detrimental to other customers, non-payment of bills for service, or diversion of\nnatural gas.  The City shall also not be liable for any injury, loss, or damage occasioned by any interruptions arising from\nthe foregoing causes.  Such interruptions shall not relieve the customer of responsibility for payment for service under\napplicable contract or rate schedules.  \n  3.2 Outage for Alterations\n For the purposes of making repairs to or changes in the City’s plant, equipment, transmission or distribution system, or\nother property, the City may, without incurring any liability therefore, suspend service for such period as may be required,\nbut will not inconvenience the customer unnecessarily.  The City will attempt to give reasonable notice to the customer\nprior to such suspension of service.  \n  3.3 Outage Records\n The City will keep a record of all interruptions of service upon its entire system or major divisions thereof, including a\nstatement of the time, duration, and cause of any such interruption.  \n  3.4 Emergency Load Interruptions\n In case of an emergency, the City shall have the right to grant preference to that service which, in its opinion, is most\nessential to the public safety and welfare.  The priority for emergency load interruptions shall be as follows:  \n  A. Priority 1\n Requirements of customers using natural gas for residential purposes, and service to:\n (1) Schools, defined as a facility delivering instruction to regularly enrolled students in attendance at such facility;\n (2) Hospitals, defined as a facility delivering medical care to patients who remain at the facility, including nursing and\nconvalescent homes; and\n (3) Police, fire protection, correctional, and sanitation facilities.  \n  B. Priority 2\n Requirements of commercial customers having peak day requirements of more than 50 MCF and less than 450 MCF, and\ncommercial customers having peak day requirements of more than 450 MCF for plant protection purposes, provided the\ngas requirement for plant protection purposes is less than 450 MCF.  \n  C. Priority 3\n Requirements of commercial customers having peak day requirements of more than 450 MCF.  \n  3.5 Curtailment Due to Gas Supply Shortages\n In case of a shortage of supply, the City shall have the right to limit the availability of service under any sales rate\nschedule.  Such limitations will follow the priority order contained in Section IV.3.4.  \n4.0 Requested Alterations to City’s Facilities   \n  4.1 Requests by Customers\n Requests for alterations to the City’s facilities by the customers will be individually considered by the City and, if found to\nbe desirable or feasible, will be made.  If, in the opinion of the City, such alterations, or portions of alterations, are made\nfor the convenience of the customer and do not result in a substantial improvement to the City’s system or to the service\nprovided, the customer will be required to pay the total cost of the alteration or portion of the alteration.  \n  4.2 Request by Others\n Other requests, such as for road changes, house moving, joint use, etc., shall be made sufficiently in advance to enable the\nCity to properly schedule the requested alteration.  The total cost of such alteration will be guaranteed by a cash deposit,\ncontract, or some other method agreeable to the City.  An exception to this rule will be alterations for road changes where\nthe City’s facilities are located on public right-of-way and the governing body requires that the cost to alter the line will be\nthe City’s cost.  \n  4.3 Easements\n By making application for natural gas service the applicant agrees to grant or arrange for an easement on applicant’s\nproperty for the installation, operation, and maintenance of natural gas lines and other equipment of the City necessary to\nrender service to the applicant.  When requested by the City, the applicant shall, without expense to the City, make or\nprocure conveyance to the City of satisfactory right-of-way easements.  \n5.0 Customer Use and Facilities   \n  5.1 Customer Installation\n Concurrently with or prior to requesting gas service, the customer shall submit to the City, on forms supplied by the City,\nwritten data detailing the service requested, to enable the City to determine if the type of service, quantity, capacity, and\npressure desired by the customer is available; to determine if extensions of, or additions to, the City’s facilities will be\nrequired; and to secure a definite location of the point of delivery.  Before any additions to or alterations of existing\ninstallations are made by the customer which will materially affect the amount of service required, or which may require a\nchange in the type of service or the point of delivery, the City must be notified reasonably in advance thereof as to the\nproposed additions or alterations in order that the City may first determine if the service desired is available and if\nfacilities may be arranged for and completed.  \n  All gas piping and other natural gas equipment on the customer’s side of the point of delivery will be furnished, installed,\nand maintained at all times by the customer in conformity with good practice and all applicable regulations, and will be\ninspected and approved by a City inspector, or by the state plumbing inspector, before a meter is installed.  However, the\nCity, by such inspection or\n approval, accepts no responsibility or liability for injury or damage caused by defects in the customer’s piping or\nequipment.  \n  No equipment or apparatus will be connected to the City’s distribution system the operation of which may cause such an\nabnormal pressure variation in said system to impair or endanger the natural gas service supplies to other customers of\nsaid system or to adversely affect operation of the City’s metering or pressure regulating equipment.  In the event that\nequipment having a high instantaneous demand, such as a gas engine, is to be connected, the customer shall provide an\nadequate pulsation or surge tank, shut-off valves, and other protective devices as may be required by the City.  Customer\nshall, in every case, confer with the City before any equipment or apparatus requiring extremely close regulation or\npressure or quantity of gas is connected to the City’s distribution system.  \n  When the City is required, by order of properly constituted authorities, to move or alter its existing distribution system,\nthereby necessitating a change in the location of the service lead and the point of delivery, the City will designate a new\npoint of delivery to which the customer, at the customer’s expense, will bring the service lead.  \n  Service will be delivered to the customer for each premise at one point of delivery designated by the City.  For the mutual\nprotection of the customer and the City, only authorized employees of the City are permitted to make connections between\nthe City’s gas service and the customer’s gas piping.  \n  The City reserves the right to require the customer to reimburse the City for any cost due to a change in meters or other\napparatus, or in their location, made at the request of the customer.  Meters and other equipment of the City will be\nremoved and relocated only by employees of the City.  \n  5.2 Protection of Sub-Surface Facilities\n The customer shall consult the City regarding the necessity of changing the location of gas service before building any\naddition or structure.  The customer shall notify the City before operating or permitting the operation of any power\nexcavating or ditching equipment in the proximity of the City’s underground gas service on the Customer’s premises.  \n  5.3 Foreign Gas or Fuel – Emergency Fuel\n The customer shall make exclusive use of service provided by the City, and no other source of gas or fuel shall be\nconnected to any installation, which in turn is connected to the City’s gas distribution system.  This does not preclude the\nuse of emergency fuel systems owned by the customer, provided that switching arrangements are installed to prevent the\npossibility of the emergency fuel and the City gas service being connected to the load simultaneously.  The matter of\nconnection of any emergency fuel system must be approved by the City prior to use.  \n  5.4 Resale of Natural Gas\n Natural gas service supplied by the City is for the exclusive use of the customer.  Consequently, the customer will not be\npermitted by submetering, prorating, or any other means, to determine a quantity of natural gas and resell the same as\nsuch to any other person or persons on the customer’s premises or for use on any other premises.  The sale of energy by a\ncustomer, where natural gas purchased from the City is the fuel used for production of such energy for sale, shall be\nconstrued as a resale of the natural gas and is not permitted.  \n The City reserves the right to refuse to furnish natural gas to any customer where the purchase of such service is for the\npurpose of resale by the customers to others.  In the event natural gas is resold in conflict herewith, the City shall have the\nright, at its option, either to discontinue service to the customer or to furnish service directly to the sub-customer.  \n  5.5 Access to Premises\n The customer will provide access to the customer’s premises at all reasonable times for authorized employees of the City\nfor any purpose incidental to the supplying of natural gas service.  \n  5.6 City Apparatus Remains City Property\n All lines, apparatuses, instruments, meters, regulators and materials supplied by the City shall remain its property and\nshall be returned to it by the customer in the same condition as when received by customer except for ordinary wear\n and depreciation, and the City may at any time examine, change, or repair its property on the premises of the customer\nand may remove all such property at any time after the termination of service.  The City’s property shall not be worked\nupon or interfered with by the customer or other unauthorized persons.  All damages or injury to the lines, apparatuses, or\nmaterials of the City on the customer’s premises caused by any act or neglect of the customer shall be repaired by City\npersonnel and paid for by the customer.  \n  5.7 Indemnity to City\n The customer assumes all responsibility on customer’s side of the point of delivery for service supplied or taken, as well as\nfor the natural gas installation and appliances used in connection therewith, and will indemnify, save harmless, and\ndefend the City against all claims, demands, costs, or expense for loss, damage, or injury to persons or property in any\nmanner directly or indirectly connected with or growing out of the distribution or use of natural gas service by the\ncustomer at or on the customer’s side of the point of delivery.  \n6.0 Definition of a Cubic Foot of Gas   \n  6.1 For Testing\n For the purpose of testing natural gas, a cubic foot of gas shall be taken to be that amount of gas which occupies a volume\nof one cubic foot when saturated with water vapor and at a temperature of 60 degrees Fahrenheit, and under an absolute\npressure of 30 inches of mercury at 32 degrees Fahrenheit.  \n  6.2 For Delivery\n For the purpose of measurement of gas to a customer, a cubic foot of gas shall be taken to be the amount of gas which\noccupies a volume of one (1) cubic foot under the conditions existing in such customer’s meter as and where installed;\nprovided, however, that when gas is metered at a pressure in excess of 4 ounces above average local atmospheric pressure,\na suitable correction factor shall be applied to provide for measurement of gas as if delivered and metered at a pressure of\n4 ounces above average local atmospheric pressure.  In cases where gas is supplied to the customer through an orifice or\nother type meter at other than standard low-pressure distribution conditions, the City shall apply suitable correction\nfactors or equipment as it deems necessary for measurement of gas as if metered at standard delivery pressure.  \n7.0 Meter Testing   \n  7.1 Meter Accuracy and Testing\n The City shall, at any time, have the authority to make a test of the accuracy of any gas service meter.  If the meter is\ndetermined to be inaccurate, the City may repair or replace the meter at its discretion.  \n  7.2 Meter Testing on Request\n The City shall, at any time when requested by a customer, make a test of the accuracy of any gas service meter free of\ncharge; provided, first, that such meter has not been tested within the twelve-month period prior to such request, and,\nsecond, that the customer will agree to accept the result of such test made by the City as the basis for settling any\ndifference claimed.  A written report giving the result of every such test shall be made to the customer who requested it,\nthe original record being kept on file at the office of the Trinidad Municipal Natural Gas Department for a period of at least\ntwo years.  If the meter is determined to be inaccurate, the City may repair or replace the meter at its discretion.  \n  7.3 Records of Tests and of Meters\n A “meter record card” shall be maintained on each meter owned or used by the City.  Such records shall show the date of\npurchase, manufacturer’s serial number, record of the present location, and date and results of the last test performed by\nthe City, which record shall be retained for the life of the meter.\n Whenever a meter is tested either on request or upon complaint, the test record shall include the information necessary\nfor identifying the meter, the reason for making the test, the reading of the meter if removed from service, the result of the\ntest, together with all data taken at the time of the test in sufficiently complete form to permit the convenient checking of\nthe methods employed and the calculations made.  Such record shall be retained for a period of two years.  \n8.0 Gas Supply Charge   \n  8.1 Applicability\n All customers receiving service under the following rate schedules shall be billed a Gas Supply Charge:  \n                Rate Schedule RS – Residential Sales Service\n                Rate Schedule CS – Commercial Sales Service\n \n Additionally, customers served under Rate Schedule SC may also be subject to the Gas Supply Charge if so provided in the\nspecial contract required to receive service under said rate schedule.  \n  8.2 Purpose\n The purpose of the Gas Supply Charge is to recover the cost of purchasing natural gas for the City’s customers.  Such costs\ninclude the cost of upstream pipeline transportation, storage, and other services incurred to deliver the natural gas\nsupplies to the City’s distribution system at the City’s Receipt  Point.  \n  8.3 Determination of Gas Supply Charge\n The Gas Supply Charge shall be computed using the following formula:  \n   A+B \n C  \n  WHERE:  \nA=  \n  Forecasted Gas Cost obtained by adding the forecasted cost of purchased gas and the forecasted cost of upstream\npipeline services.  \n  B=  \n  Deferred Gas Cost obtained by comparing the actual purchased gas cost plus the actual cost of purchased pipeline\nservices with the revenue recovered by the Gas Supply Charge.  If the Gas Supply Charge revenue exceeds costs, there\nshall be an over-recovery of gas costs.  If costs exceed the Gas Supply Charge revenue, there shall be an under-\nrecovery of gas costs.  \n  C=  \n  Forecasted Gas Sales obtained by normalizing an historical twelve-month period of gas sales volumes.  \n  The Gas Supply Charge shall be calculated on an annual basis and changes to it will be effective on November 1 of each\nyear, unless otherwise approved by the City Council.  Additionally, the Gas Supply Charge may be calculated and changed\nfrom time to time during the year, if the change amounts to at least $0.01 per CCF or greater.  \n  9.0 Extension Policy\n The purpose of the Trinidad Municipal Natural Gas Department’s extension policy for its natural gas distribution system\nis to: (1) set forth its service connection and distribution line extension requirements; (2) protect the City against making\nunwarranted or uneconomical investment which might adversely affect rates or service upon existing customers; and (3)\nprovide for the classification of natural gas distribution service to customers and the appropriate terms and conditions\nunder which service facilities will be extended.  \n  9.1 Gas Service and Main Line Installations  \n  A. Association, Subdivision, and Master Tap Applicants.  \n  (1) Application for gas taps by an Association, Subdivider, or Master Tap Applicant shall contain the number of\nindividual service lines to be granted the Association, Subdivider, or Master Tap Applicant.  \n  (2) In no event shall the number of individual service lines actually granted to and utilized by the Association,\nSubdivider, or Master Tap Applicant, after the approval of the tap, exceed the number specified in the application.  A\nviolation of this subparagraph shall result in termination of gas service to the Association, Subdivider, or Master Tap\nApplicant; provided, however, an Association, Subdivider, or Master Tap Applicant may be granted additional\nservices upon submission and approval of an amended application.  \n  (3) Association taps, Subdivision taps, and Master taps may be allowed for out-of-city services from City gas mains\non an\n individual contract basis with the City.  The City shall be responsible for the quality of gas only to the point of\ndelivery.  Maintenance of the Association, Subdivider, or Individual lines past the point of delivery shall be borne by\nthe Association, Subdivider, or Master Tap Applicant.  \n  9.2 Gas Mains, Taps, Service Lines, and Meters  \n  A. All taps on the City mains shall be performed by City forces and shall be charged to the person requesting the tap.\n Materials will be charged at City cost plus fifteen percent (15%).  Charges for such installations shall be based upon a\nschedule determined by the Gas Superintendent to include the cost of materials, equipment, and hourly labor rates\npaid by the City.  Sales taxes shall be charged where applicable.  Said fee shall be payable upon completion of the\nwork.  \n  B. All gas mains and service lines shall be of steel or polyethylene pipe installed in accordance with all applicable\ncodes and specifications.  \n  C. Service lines from the main to the meter shall be installed by City forces upon the issuance of a gas service permit\nby the Trinidad Municipal Natural Gas Department.  \n  D. In the event of a leaking or ruptured gas service line or main, the City shall perform the repair work.  The\nproperty owner, developer, and/or contractor will be responsible for payment of such repairs if the damage to the\npipeline is caused by the property owner, developer, and/or contractor, including any expenses the City may incur in\nturning the gas service off.  \n  E. If, in establishing a new grade for a street, the street grade is lowered causing the gas service to have less than\neighteen inches (18\") of burial, the City shall replace the line, except that if the changing of the grade is part of an\nimprovement district or development project the charges shall be borne by the project.  \n  F. Property to be served must be adjacent to City mains and must be served directly therefrom.  \n  G. No tap shall be made on a City main until the applicable front foot costs have been paid or a payment plan has\nbeen approved by the Gas Department Superintendent.  \n  H. No gas service line shall be connected from the service on one (1) building to any other building, vehicle, trailer,\nmobile home, or other structure or facility, fixed or mobile.  \n  I. Any complex of buildings containing ten (10) or more separate dwelling units, whether the same be apartments,\nhomes, duplexes, or otherwise, but not including sleeping rooms, and owned by any one (1) person, or a licensed\ntrailer coach park owned by one (1) person, if the said buildings or trailer coach park are all located on one (1)\ncontinuous tract of ground owned by one (1) person, shall be allowed to install one (1) or more metered service lines,\nand may make such taps from these service lines as are approved from plans submitted in advance of construction\nsubject to Sections IV.9.1A(1), IV.9.1A(2), and IV.9.1A(2), herein.  No additional taps shall be made on these service\nlines until revised plans are submitted and approved.  No tap shall be made to sell or give away gas to any agency,\ncorporation, or person.  It is further provided that in the event any property or properties owned by such person shall\nbe sold or disposed of, and such property or properties does not have a separate service line, the new owner must\ninstall a separate service line if gas service is to be retained.  \n  J. If the City initiates a main installation for replacement of an existing City main, the City shall bear the cost of\ntransferring taps and re-connecting the customer's service lines.  \n  K. Where taps are provided in the laying of a gas main, no connection shall be made to these taps until the\napplicable front foot costs have been paid.  \n  L. Where gas service is abandoned and/or the building being served is razed, the customer's service shall be\ndisconnected from the main at the customer's expense and the tap capped and closed.  Service will not be re-\nestablished until the line is replaced at the property owner's expense.  Service will not be re-established for any use\nother than that originally authorized unless approved in advance by the City.  \n \n 9.3 General Requirements for Main Extensions  \n  A. The City shall make or cause to be made such extensions or replacements to the gas distribution system, as it deems\nnecessary and feasible to serve any dwelling, commercial or industrial establishment, or property situated within the\nservice area of the Trinidad Municipal Natural Gas Department.  \n  B. All gas main extensions of the Trinidad Municipal Natural Gas Department are to be under the exclusive control and\nownership of the City.  The request for a main extension shall be made in accordance with the provisions of this Tariff.\n The Trinidad Municipal Natural Gas Department shall have sole discretion in making main extensions and constructing\nappurtenant facilities both inside and outside the corporate limits of the City.  \n  C. All requests for main extensions, whether they are for a single customer or for a developer of an area, shall be\nsubmitted to the City in writing so that the Gas Superintendent and other City departments, as may be required, may\nreview and consolidate their planning.  Plans shall be approved prior to construction.  \n  D. All new gas services shall be served from mains only, and from mains adjacent to the property being served.  \n  E. Developers shall submit plans for approval that shall include such information as street widths, lot size, street names,\nutility easements, and utility design, and other information as may be required by City departments.  \n  F. Agreements on cost-sharing distribution shall be entered into prior to construction, and, rather than assessment of a\nfront foot cost, the developer of an area may elect to include the price of utilities in the cost of the lot.  \n  G. Owners or developers of properties either inside or outside the City requiring the construction of new mains or\nreinforcement of existing mains in order to be served by the utilities shall bear the cost of such facilities.  Costs shall\ninclude design, supervision, valving, cathodic protection, and appurtenances.  \n  H. Mains shall be laid only in platted streets, alleys, or recorded right-of way-easements with provisions for access to\nmaintain the facilities.  \n  I. The City shall bear the cost of main extensions only under the following circumstances:  \n  (1) When the City requires a larger main for purposes of system improvement or system extension above and\nbeyond that required to serve a customer or a developer's present and anticipated needs in completely developing\nhis/her property, the City shall pay the estimated cost of over-sizing and over-design requirements.  \n  (2) Lines laid by the City for the exclusive use of transmission lines or lines laid for general system upgrading to\nprovide better pressure, or multiple feeding for greater reliability, shall be at City expense.  A     customer allowed to\ntap such lines shall pay to the City a front foot cost as though the main were laid for the customer’s service.  \n  (3) Lines laid to municipal development such as parks or City owned industrial parks shall be at City expense.  \n  J. No services will be provided for unplatted properties located within the City.  \n \n 9.4 Elements in Planning, Constructing, and Financing Main Extensions  \n A. The location, route, and length of gas extensions shall be determined by the City Gas     Superintendent based\nupon service requirement capabilities and ultimate requirements of the City utility system.  Generally, properties\nshall be serviced from mains in the street or alley fronting the property, and gas mains laid within the public right-of-\nways shall be no smaller than two inches (2\") in diameter.  The size, materials, valving, cathodic protection, and\nother main extension requirements shall be determined by the City Gas Superintendent prior to the authorization of\nsuch work and material installation.  \n \n B. The “Guidance Manual for Operators of Small Gas Systems,” as published and hereafter amended by the U.S.\nDepartment of Transportation, Research and Special Programs Administration, U.S. Government Printing Office\n1991-568-282, and Title 49, §§ 190-99, of the Code of Federal Regulations (49 CFR §§ 190-99), are hereby adopted\nby reference and incorporated fully as if set out at length herein.  \n \n C. No tap shall be allowed on a main to serve a property until the main is extended to the far property line, unless\nthe owner of the property signs an agreement approved in form by the City Attorney that he/she will pay the front\nfoot costs for such main extension to or past his/her far property line.  Such agreement shall contain the total\namount of monthly\n payment installments to be made, not to exceed twelve (12) months without authorization of City Council.  City\nCouncil may waive this requirement if it finds and determines that no practical or useful purpose would be served by\nextending the main to the far property line or beyond.  \n \n D. A main may be extended to serve a single customer, a group of customers, a “pocket” consisting of a house or\nhouses between developed areas, or a development.  At the option of the City, and depending on the availability of\nCity funds for investment in new mains, any of the following means of financing may be arranged:  \n (1) If the City elects to lay a main, either with City forces or by contract at City expense, no service shall be allowed to any\ncustomer until front foot costs are paid for that property, or until arrangements are agreed to for deferred payment.  \n \n (2) Main Extensions to serve a subdivision, development, or area generally will be financed by the property owner or the\nperson developing the property.  Within the development, all costs of the main extensions shall be absorbed in the\ndevelopment costs.  Upon completion of construction of the mains, they shall become the property of the City.  \n E. In submitting a main extension proposal, the developer shall submit two (2) copies of a preliminary plat that indicates\npoint(s) of connection to existing City mains, valving existing lines or structures, and other pertinent factors controlling\nline sizing.  Two (2) copies of the final plat shall be submitted for approval to the Gas Superintendent.  \n \n F. The City may assume all or a portion of the cost of replacement of undersized or deteriorated mains which the City\ndeems to have served their useful purpose.  At its discretion, the City may assume all or a portion of the cost of main\nextensions to properties already having service.  \n G. At the City's discretion, payment for main extension may be in cash, or by a fifty percent (50%) down payment with the\nbalance handled as a miscellaneous charge by consolidated billing apportioned over no more than twelve (12) months with\na handling charge of one and one-half percent (1 1/2%) per month on the unpaid balance.  The outstanding unpaid balance\nshall constitute a lien on the property served.  \n  9.5 Ownership of Constructed Facilities\n The ownership of any equipment and facilities provided wholly or in part at the expense of an applicant under these rules\nshall at all times be vested exclusively in the City.  \n  9.6 Cost of Right of Way\n Where applicants for service are so located that it is necessary or desirable to use private and/or government right-of-way\nto furnish service, such applicants may be required to provide or pay the cost of providing such right-of-way in addition to\nany applicable construction or aid to construction charges.  \n  9.7 Construction to Be Part of City System\n The branch of the distribution system necessary to supply service to an individual customer shall be included as part of\nthe City’s general distribution system, unless said distribution line is owned, operated, and maintained by the customer.  \n   \n10.0 Meter Locations \n 10.1 In all cases where gas piping is installed, and the gas piping will be directly connected to the gas utility's gas meter or\nservice gas piping outlet, the person installing such gas piping shall provide, or see that there is provided, a suitable and\nsufficient space for the location of such gas meter or service gas piping outlet.  \n \n 10.2 No gas meter shall be located inside any building or structure.  \n11.0 Pipe Material, Pipe Sizes, and Installation of Piping \n Pipe material, pipe sizes, and the installation of piping shall conform to the requirements set forth in the Plumbing Code,\nas adopted by reference in Section 15-1 of the Trinidad City Code.  \n12.0 Penalty for Violation \n It shall be unlawful for any person to violate any of the provisions of this Tariff or to cause, permit, or suffer the same to\nbe done; and any person violating any of the provisions of this Tariff shall be deemed guilty of a misdemeanor, and upon\n conviction of any such violation, such person shall be punished as provided in Section 1-8 of the Trinidad City Code.  \n13.0 Non-liability of City \n This Tariff shall not be construed as imposing upon the City any liability or responsibility for damages to any person\ninjured by any defect in any gas piping and/or appliances herein mentioned, or by the installation thereof, nor shall the\nCity or any official or employee thereof be held as assuming any such liability or responsibility by reason of the inspection\nauthorized hereunder or certificate of inspection issued by the City or state gas inspector.\n"}