{
    "chapter": "Chapter 17 - Streets and Sidewalks",
    "content": "Chapter 17 - Streets and Sidewalks\nARTICLE 1.  IN GENERAL.\nSections:\n17-1                       Street names - Reference to map and plat.\n17-2                       Street names to be placed on corners.\n17-3                       Sprinkling sidewalks before sweeping.\n17-4                       Shaking or cleaning rugs in streets or sidewalks prohibited.\n17-5                       Placing obstructions on streets; consent required; limitation.\n17-6                       Obstruction to gutters prohibited.\n17-7                       Openings in sidewalk; disrepair of sidewalk.\n17-8                       Merchandise on sidewalk; passageway; time limitation.\n17-9                       Property owner to keep sidewalks cleaned.\n17-10                     Property owner to remove snow and ice from sidewalks.\n17-11                     Slippery sidewalks; City not liable.\n17-12                     Work done by City; assessment of costs.\n17-13                     Installation of underground structures; plat and data to be filed.\n17-14                     Plats - Contents.\n17-15                     Line for poles on streets.\n17-16                     Operating tractors on pavement.\n17-17                     Oil on pavement - Pouring or spilling prohibited.\n17-18                     Oil on pavement; oil delivery wagons and tanks.\n17-19                     Water and sewer connections in proposed paving districts.\nARTICLE 2.  NUMBERING BUILDINGS.\n17-20                     Owners and occupants to number buildings.\n17-21                     Manner of numbering.\n17-22                     Allotment of numbers.\n17-23                     Street maps with numbers to be prepared.\n17-24                     Assigning numbers; certificate of designation.\n17-25                     Size and location of configuration.\n17-26                     Refusal to place numbers on existing buildings.\n17-27                     Refusal to place, or placing unauthorized numbers on new buildings.\n17-28                     Altering numbers or street names - Consent required.\nARTICLE 3.  EXCAVATION.\n17-29                     Excavation permit required; contents of application.\n17-30                     Excavation permit; conditions of issuance.\n17-31                     Excavation permit; work requirements.\n17-32                     Excavation permit; indemnification.\n17-33                     Excavation permit; warranty.\n17-34                     REPEALED (Ord. 1516, 8-26-1995)\n17-35                     REPEALED (Ord. 1516, 8-26-1995)\nARTICLE 4.  CONSTRUCTION OF SIDEWALK, CURB AND GUTTER.\n17-36                     Maximum and minimum widths of sidewalks.\n17-37                     Sidewalks to conform to established grade; supervision of laying.\n17-38                     Slope.\n17-39                     Sidewalk construction - Permit required.\n17-40                     Application for permit.\n17-41                     Sidewalk openings for fuel and light to be covered.\n17-42                     Access to basement to be covered.\n\n17-43                     Curb, gutter, and/or sidewalk requirements - New construction.\n17-44                     Hearing to consider construction of curb, gutter and/or sidewalk.\n17-45                     Order to construct curb, gutter and/or sidewalk.\n17-46                     Failure of owner to construct.\n17-47                     Assessment of cost against property owner.\n17-48                     Notice of assessment.\n17-49                     Protest of assessment.\n17-50                     Failure of owner to pay assessment.\n17-51                     Curbs and gutters - Materials.\n17-52                     Curbs on curb lines; gutters to attach to curbs.\n17-53                     Street lawns and parks to conform to grade.\n17-54                     Article not applicable in commercial districts; City's jurisdiction over parks.\n17-55                     Removal of grade or line stakes prohibited.\n17-56                     Curb line and curb radius.\n17-57                     Fund established to front costs of repairs or replacement.\n17-58                     Repair or replacement of curb, gutter and/or sidewalk.\nARTICLE 5.   CULVERTS.\n17-59                     When construction of culvert required.\n17-60                     Notice to owner to construct culvert.\n17-61                     Failure of owner to construct; construction by City; certification to City Clerk.\n17-62                     Notice to owner of cost; assessment and hearing.\n17-63                     Hearing on assessments; penalty; collection.\n17-64                     Driveway - Culvert fund.\nARTICLE 6. CLOSURE OF CITY STREETS FOR ATHLETIC OR SPECIAL EVENTS.\n17-65                     Closure of City streets for athletic or special events.\n17-66                     Penalty for failure to obtain permit or to comply with terms of permit.\nARTICLE 7. VACATION PROCEEDINGS.\n17-67                     Repealed\n17-68                     Repealed\n17-69                     Repealed\n17-70                     Repealed.\nCHAPTER 17.  STREETS AND SIDEWALKS.\nARTICLE 1.  IN GENERAL.\nSection 17-1.        Street names - Reference to map and plat.\nThe several streets, avenues and public places in the City shall be known and designated by names applied thereto on the\nmap and plat of the City located in the City Clerk's office, as well as the maps and plats of the several additions by the City\nlawfully accepted, and on file with the City Clerk. (Code 1958, Sec. 25-1.)\nCross reference: As to prohibition against altering street names, see Section 17-28.\nSection 17-2.        Street names to be placed on corners.\nThe names of all streets or avenues shall be placed on the street or avenue corners.  (Code 1958, Sec. 25-2.)\nSection 17-3.        Sprinkling sidewalks before sweeping.\nIt shall be unlawful for the owner or occupant of any premises to sweep or clean or cause to be swept or cleaned the street\nsidewalks in front of the premises owned or occupied by him/her unless the same shall have first been sprinkled\nsufficiently to lay the dust and dirt to prevent the raising and scattering of the dust and dirt collected thereon.  (Code 1958,\nSec. 25-3.)\nSection 17-4.        Shaking or cleaning rugs in street or sidewalks prohibited.\nIt is unlawful for the owner or occupant of any premises to sweep, clean or shake, or cause to be swept, cleaned or shaken,\nupon any street sidewalk any rugs, carpets or other like articles.  (Code 1958, Sec. 25-4.)\nSection 17-5.        Placing obstructions on streets; consent required; limitation.\nNo person shall be granted permission to place or keep any building material in any street, alley or other public place for a\nlonger period than thirty (30) days unless expressly authorized by the Council.\nSection 17-6.        Obstruction to gutters prohibited.\nIt shall be unlawful for any person to place any obstruction in a gutter or ditch at the side of any street for the purpose of\ncarrying off water from such street, or to fill in or deposit earth, sand, gravel or other substance in such gutter or ditch at\nthe point of entrance into a driveway from the street or elsewhere.  (Code 1958, Sec. 25-7.)\nSection 17-7.        Openings on sidewalk; disrepair of sidewalks.\nIt shall be unlawful for any person to leave or keep any cellar door, pit or vault or other\nsubterraneous opening on any sidewalk, street or alley, or suffer the same when in or under his/her charge to be left or\nkept open or to be in an insecure condition so that passersby may be in danger of falling into any such place, or suffer any\nsidewalk in front of any premises owned or occupied by him/her to become so broken as to endanger life or limb or so out\nof repair as to cause water to collect and remain in pools thereon.\nSection 17-8.        Merchandise on sidewalks; passageway; time limitation.\nIt shall be unlawful for any person to place or keep or suffer to be placed or kept, upon any sidewalk any goods, wares or\nmerchandise which he/she may be receiving or delivering without leaving a passageway clear upon such sidewalk of six\nfeet (6') wide for the use of foot passengers, and no person receiving and delivering such goods shall suffer the same to be\nor remain upon such sidewalk for a longer period than three (3) hours.  (Code 1958, Sec. 25-9.)\nSection 17-9.        Property owner to keep sidewalks cleaned .\nEvery owner of real property shall keep clean or cause to be kept clean the sidewalk or sidewalk areas in front of or lying\nalong his/her property and shall remove or cause to be removed therefrom all earth, ashes, weeds, trash, refuse and\nrubbish of all kinds.  (Code 1958, Sec. 25-13.)\nSection 17-10.      Property owner to remove snow and ice from sidewalks .\nEvery owner of real property shall within four (4) hours (from 5:00 p.m. to 7:00 a.m., excepted) after any fall of snow,\ncause the same and any ice which may have formed, to be removed from the sidewalk in front of or lying along his/her\nproperty into the carriageway of the street, and in so doing, shall not interfere with water running in the gutter, with the\npassage of vehicles more than can be avoided, or to obstruct any street crossing.  (Code 1958, Sec. 25-14.)\nSection 17-11.      Slippery sidewalks; City not liable .\nWhen it is not practicable to remove all the snow and ice from any sidewalk by reason of its being frozen then the owner of\nthe real property shall sprinkle and spread or cause to be sprinkled and spread upon the sidewalk, ashes, salt or some\nsuitable material to prevent such sidewalk from being slippery.  The failure of any owner of real property to do so shall not\nrender the City liable to any person for damages on account of injuries upon such sidewalk, in any manner different than if\nthe City had not required such owner to clean or sprinkle such walk.  (Code 1958, Sec. 25-15.)\nSection 17-12.      Work done by City; assessment of costs.\nIf any owner of real property shall fail, neglect, or refuse to comply with the provisions of Sections 17-9, 17-10 and 17-11,\nthe City may at once proceed to remove from such owner's real property and from the alley in the rear thereof and from\nthe sidewalk and sidewalk area in front of or lying along such owner's real property all weeds, brush, ashes, manure,\nrefuse, trash and rubbish of all kinds and may at once proceed to remove all snow, ice, earth and mud from the sidewalk in\nfront of or lying along such owner's real property.  Such work shall be done, under the direction and supervision of the\nSuperintendent of Streets and Bridges, by employees or agents of the City or by contract.  The City may assess the cost and\nexpense of such work against each lot or tract of real property, upon and for the benefit of which such work was done.  The\ncost of such work, together with five percent (5%) for the inspection and other costs, shall be assessed, levied and collected\nin the same manner as provided by ordinance for assessing, collecting and certifying sidewalk assessment.  The\nassessment, if not paid, shall be certified by the City Clerk to the County Treasurer or to the officer of the County having\ncustody of the tax list at the time of such certification, together with a ten percent (10%) penalty thereon for collection.\n The amount of such assessment shall constitute a lien against the real property described in such assessment.  (Code 1958,\nSec. 25-16.)\nSection 17-13.      Installation of underground structures; plat and data to be filed.\nAll persons occupying or using any of the streets or alleys, or any part thereof, underground, with water mains, gas mains,\nor any other kind of main pipes or conduits for wires or in any other manner occupying any part or any of the streets or\nalleys by franchise or otherwise, with any of the aforesaid things beneath the surface of any such streets or alleys, shall,\nwithin ten (10) days after the completion thereof, file in the office of the City Engineer for the use of his/her office, a plat\nand data showing as nearly as such persons can practicably show, the location and dimensions of all such underground\nstructures so used by them.  Such plats and data shall be certified to by such person, or by some office of such company, as\nbeing practically correct.  (Code 1958, Sec. 25-17.)\nSection 17-14.      Plats - Contents.\nAll plats mentioned in Section 17-13 shall show the location thereof in reference to the side lines of the street or alley in\nwhich the same is located and the depth of the same below the surface of the ground; they shall also show the dimensions\nand kind or size of pipe or conduit or other construction used.  (Code 1958, Sec. 25-18.)\nSection 17-15.      Line for poles on streets.\n(1)  The established line for poles and posts of whatever nature upon all residence streets platted over eighty feet (80') in\nwidth, shall be nineteen feet (19') from the center line of such street measured at right angles each way.\n(2)  The established line for poles and posts of whatever nature upon all residence streets platted from forty (40) to and\nincluding eighty feet (80') shall be sixteen and one half feet (16 ½') from the center line of such streets, measured at right\nangles each way.\n(3)  Upon all other residence streets not specified in (1) and (2) and upon all business streets, all poles or posts or whatever\nnature shall be put on line next to the curb between the property line and the curb.\n(4)  All poles and posts of whatever nature will be distant at least three feet (3') from any water main or service pipe, sewer\npipe or lateral that may be upon that street.  (Code 1958, Sec. 25-19.)\nSection 17-16.      Operating tractors on pavement.\nIt shall be unlawful for any person to operate over, across or upon any pavement of whatever kind, any tractor, road-\ngrader or other machine or vehicle of such construction that the metal parts thereof come into contact with the surface of\nthe pavement, or which has caterpillar traction construction, or the wheels equipped with cleats, spikes or any other\ngripping device, which tractor, road-grader or other machine or vehicle in the course of locomotion breaks, cuts into,\nindents, leaves an imprint in, mars or defaces, in any manner or to any degree, the surface of such pavement; provided,\nhowever, if such road-grader, machine or other vehicle is propelled or moved over planks or other runways in such\nmanner as to prevent defacement of the pavement, then it shall be lawful to operate such tractor, road-grader or other\nmachine or vehicle over the pavement.  (Code 1958, Sec. 25-20.)\nSection 17-17.      Oil on pavement - Pouring or spilling prohibited.\nIt shall be unlawful for any person to pour, spill or permit to be poured or spilled, or to drip or flow upon, or to deposit or\nplace in any receptacle upon any asphalt or bituminous macadam paving on any street or alley or public place, any\nkerosene, benzoin, gasoline, lubricating oil or other similar oil or oily substance, or salt or salt water, except as the same\nmay be the ordinary and natural drip from vehicles and their axles, bearings and equipment when the same are carefully\nhandled and operated. (Code 1958, Sec. 25-21.)\nSection 17-18.      Oil on pavement, oil delivery and tanks.\nAll oil delivery wagons or tanks shall have securely fastened under the taps or faucets thereunto attached, water- tight\nboxes or trays, and in handling the contents of such wagons or tanks no drip or overflow shall be permitted to fall upon\nsuch paving, and no receptacle for handling such contents shall be placed on such paving.  (Code 1958, Sec. 25-22.)\nSection 17-19.      Water connections in proposed paving districts.\nAll property and places in areas proposed to be paved, where, in the opinion of the City Council, water service connections\nor sewer connections are likely to be needed, the owner of such property, shall be required to install water service pipes\nand sewer connections, from the trunk or main lines in such streets proposed to be paved to the curb line of such property.\n If such owner refuses to install such water and sewer lines within thirty (30) days after notice thereof from the City\nCouncil, or its authorized agent, such notice to be addressed to last known address of such owner, then the City shall make\nsuch installation and charge the same against the property, such charge to become a lien upon such property.  (Code 1958,\nSec. 25-23.)\nCross reference: As to provision requiring connection with sewer system, see Section 12-46.\nARTICLE 2.  NUMBERING BUILDINGS.\nSection 17-20.      Owners and occupants to number buildings.\nOwners and occupants of all buildings shall number the buildings in the manner prescribed in this Article and as may be\nprovided by the City Council.  (Code 1958, Sec. 25-24.)\nSection 17-21.      Manner of numbering.\nThe following is adopted and declared the manner and mode of numbering of houses in the City:\nMain street, and any and all extensions thereof that may hereafter be made, shall be the division street, dividing the City\ninto north and south sections, and the parts of each street intersecting such division street shall be designated as north or\nsouth according as the parts of such intersecting streets shall be north or south of Main Street; and Commercial Street,\nfrom its southern terminus throughout to its connection with Arizona Avenue and thence with Arizona Avenue north, and\nany and all extensions of Commercial Street south or of Arizona Avenue north, that may hereafter be made, shall be the\ndivision line, dividing the City into east and west sections, and the parts of each street intersecting Commercial Street or\nthat part of Arizona Avenue north from its connection with Commercial Street shall be designated as east or west of the\ndivision line according as such parts of the intersecting street shall be east or west of the division line.  All houses and\nbuildings on streets intersecting Main Street shall be numbered north or south from Main Street, and all houses and\nbuildings on streets intersecting Commercial Street and that part of Arizona Avenue north of its connection with\nCommercial Street shall be numbered east or west from the division streets.  Houses and buildings fronting on streets that\ndo not intersect Main Street or Commercial Street or such part of Arizona Avenue shall be numbered, as nearly as possible,\nin conformity with the manner and system of numbering hereby prescribed.  One hundred (100) numbers shall be\nassigned for each block east or west and north or south from the division streets, being fifty (50) numbers to each side of\nthe street.  Blocks approximately double the ordinary frontage shall be given two hundred (200) numbers, and across all\ntracts of land intervening between portions laid out into blocks, the lines of streets shall be considered to cross the same in\nregular continuation of streets in blocks adjoining.  Numbering shall begin with \"100\" in the first (1st) blocks north or\nsouth and east or west of the division lines.  The even numbers shall be on the south and east sides and the odd numbers\non the north and west sides of the streets.  (Code 1958, Sec. 25-25.)\nSection 17-22.      Allotment of numbers.\nWhile one hundred (100) numbers are allotted to each block from the division streets, the division numbers to the\nfrontage thereof shall be one (1) number to each twelve and one half feet (12 ½') in the business districts and one (1)\nnumber to each twenty five feet (25') in the residence sections of the City, or such other aliquot part of a lot frontage as\nshall, in the judgment of the City Engineer, be deemed most advisable, it being intended hereby to preserve as nearly as\npossible a general uniformity in numbering throughout the City.  (Code 1958, Sec. 25-26.)\nSection 17-23.      Street maps with numbers to be prepared.\nThe City Engineer shall cause to be prepared from time to time, when required by City Council, maps of the several streets\nof the City, showing the numbers of all houses. Where the number of any house shall hereafter be changed, by action of the\nCity Council, the same shall be changed and numbered on said plats or maps as directed.  (Code 1958, Sec. 25-27.)\nSection 17-24.      Assigning numbers; certificate of designation.\nThe City Engineer shall assign to each house its proper number or numbers and upon application shall deliver free of\ncharge, to the owner or occupant thereof, a certificate designating the proper number or numbers of such house. (Code\n1958, Sec. 25-28.)\nSection 17-25.      Size and location of configuration.\nEach of the figures of every number shall not be less than two (2\") inches in width, being marked as to be distinctly and\neasily read. Numbers shall be displayed in a color that contrasts with the color of the building. Such numbers shall be\nplaced in a conspicuous position as to be plainly visible and legible from the street, road, fire lane, or other right-of-way or\neasement fronting the building.\nBuildings that are setback more than one hundred (100) feet from a street's curb shall be required to display address\nnumbers within fifty (50) feet of the street curb, on a surface that is easily visible from the street of address.\nThe address for commercial complexes, including apartment complexes, shall be marked at the entrance to the complex in\naccordance with this section. In addition, the address of each building or business within the complex shall be marked on\neach building/business with the address visible from the access road or parking lot.\nAdditional displays of assigned numbers may be displayed at the property owner's discretion. (Ord. 3066, section 17-25\namended, eff. 3/3/23)\nSection 17-26.      Refusal to place numbers on existing buildings.\nIt shall be unlawful for any owner or occupant of any building now erected, after having been notified by the City that the\nhouse numbers are on record in the City office, to neglect or refuse for thirty (30) days thereafter to number such building\nin conformity with the provisions of this Article.  (Code 1958, Sec. 25-30.)\nSection 17-27.      Refusal to place, or placing unauthorized, numbers on new buildings.\nIt shall be unlawful for any owner or occupant of any building hereafter erected to fail, neglect or refuse for thirty (30) days\nafter it shall have been erected to number such building according to the provisions of this Article, or to number such\nbuilding without first having obtained from the City a certificate designating the proper number.  (Code 1958, Sec. 25-31.)\nSection 17-28.      Altering numbers or street names - Consent required.\nWhenever any street shall be named, numbered or renamed or re-numbered in pursuance of this Article or any ordinance\nthat may hereafter pass, such names or numbers shall not be changed or altered without the consent of the City Council.\n(Code 1958, Sec. 25-32.)\nARTICLE 3.  EXCAVATIONS.\n(Ord. 1516, eff., 8/26/95)\nSection 17-29.      Excavation permit required; contents of application.\n(1) It is unlawful for any person other than authorized City of Trinidad employees and those under specific written contract\nwith the City, to dig up, break, excavate, tunnel, drill, bore, undermine, or in any manner break up any Right Of Way\n(ROW) or to make or cause to be made any excavation in or under the surface of any ROW, or to place, deposit, or leave\nupon any ROW any earth or excavated material obstructing or tending to interfere with the free use of the ROW unless\nsuch person shall first have obtained an excavation permit therefore from the Public Works Department. (Ord. 1516, eff.,\n8/26/95)\n(2) In the event of any emergency in which a utility line in or under any ROW breaks, bursts, or otherwise is in such\ncondition as to immediately endanger the property, life, health, or safety of any individual, the person owning or\ncontrolling such utility line, without first applying for and obtaining an excavation permit under this regulation, shall\nimmediately take proper emergency measures to cure or remedy the dangerous conditions for the protection of property,\nlife, health and safety of individuals. Such person shall apply for an excavation permit not later than the end of the next\nbusiness day and shall not proceed with permanent repairs without first obtaining an excavation permit under this\nregulation. The normal excavation permit fees shall apply to any such emergency work. (Ord. 1516, eff., 8/26/95)\n(3) No excavation permit shall be issued unless a written application for the issuance of an excavation permit is submitted\nto the Public Works Department at least two business days prior to the anticipated time of the excavation work. The\nwritten application shall include the following:\n(a) Applicant's name\n(b) Applicant's address\n(c) Application date\n(d) Location of the excavation\n(e) Purpose of the excavation\n(f) Date of commencement of the excavation\n(g) Date of completion of the excavation\n(h) Proposed size of the excavation cut in square yards\n(i) Contractor's license number (if applicable)\n(4) The application shall be accompanied by a plan showing the location and extent of the proposed excavation and a\ntraffic control plan for the work area.\n(5) The application shall be accompanied with proper fees. The Application and Inspection Fee shall be $1.00 per square\nfoot of excavation with a minimum fee of $20.00. Any person doing any excavation work without a permit under other\nthan emergency repairs of utility lines that endanger the property, life, health, or safety of any individual shall be charged\ndouble the normal fees.\n(6) Any applicant shall be responsible for providing traffic control in accordance with the Manual on Uniform Traffic\nControl Devices. A traffic control plan shall be provided with the excavation permit application. It shall be the\nresponsibility of the applicant to provide all necessary traffic control devices per the traffic control plan and to assure the\nsafety of the public. (Ord. 1516, 8-26-1995)\nSection 17-30.      Excavation permit; conditions of issuance.\n(1) Following approval of the application and payment of all fees the Public Works Department shall issue a permit to the\napplicant for the work described in the application. All excavation work shall comply with all standards for construction,\ntraffic control standards, and safety regulations as have been adopted by the City to restore the surface to its original\ncondition, prevent subsidence and collapse, restore deterioration and otherwise protect the integrity of the ROW, and to\nprotect the public from hazards created by such excavation work. (Ord. 1516, 8-26-1995)\n(2) No permit shall be issued to any person who, in the opinion of the Public Works Department, is not qualified to\nperform the work in accordance with these regulations. Any person who is denied a permit may appeal such denial to the\nCity Manager within ten business days of such denial. (Ord. 1516, 8-26-1995)\n(3) The excavation permit will expire three months after the proposed completion date. One three month extension may be\nrequested prior to the expiration of the original permit. The application and inspection fee is non-refundable.\nSection 17-31.      Excavation permit; work requirements.\n(1) The permittee shall obtain utility locations from all utility companies prior to commencing the excavation work. (Ord.\n1516, eff. 8/26/95)\n(2) A permit issued under these regulations shall at all times be in the possession of a competent person actually on the\nsite representing the applicant. (Ord. 1516, eff. 8/26/95)\n(3) The Public Works Director may suspend or revoke any permit for:\n(a) Violation of any condition of the permit, any provision of this regulation, or any other applicable law.\n(b) The existence of any condition or the doing of any act endangering life or property. (Ord. 1516, eff. 8/26/95)\n(4) A stop work order may be issued by the Public Works Director to any person doing or causing any work to be done in\nthe public right of way without a permit or in violation of any provision of this regulation. Stop work orders shall be\neffective immediately.  It is unlawful for any person to continue work for which a stop work order has been issued.\n(5) Protection of utilities. Every permittee making an excavation in or under any street, sidewalk or right of way shall, at\nhis expense, sustain, secure and protect any pipes, poles, mains, cables, utilities or conduits laid or erected in the ROW\nfrom injury and replace and compact the earth wherever the same shall have been removed, loosened or disturbed, under\nor around them, so that they shall be well and substantially supported. If any permittee fails to sustain, secure or protect\nsuch pipes, poles, mains, cables, utilities or conduits from injury or to replace and compact the earth under or around\nthem, as the provisions of this section require, then the same may be done by the entity to whom the same may belong and\nthe cost thereof and all damages sustained by such entity thereby shall be paid by such permittee and in default thereof,\nsuch entity may maintain an action against him therefor.\n(6) Excavation backfill. The permittee shall backfill the excavation in accordance with one of the two following\nmethodologies as set forth below:\n(a) METHOD A\n(I)  Backfill below the top two (2) feet shall be compacted to 90% of its maximum Modified Proctor density\n(ASTM D 1557). Backfill material shall be clean dry material free from muck, frozen lumps, vegetative matter or\nrubbish. All fill shall be placed in uniform and relatively level layers not to exceed eight inches prior to\ncompaction.\n(II)  The top two (2) feet shall be backfilled with well graded aggregate with a maximum size of one inch\nmaterial and shall be compacted to 95% of its maximum Modified Proctor density (ASTM D 1557). The fill shall\nbe placed and compacted at a moisture content within + 2% of its optimum moisture. All fill shall be placed in\nuniform and relatively level layers not to exceed eight inches prior to compaction.\n(III)  The City may perform compaction density tests on any excavation.  Any backfill not meeting the\ncompaction requirements will be removed by the permittee and recompacted as necessary to meet the\nrequirements.\n(b) METHOD B\n(I)  Backfilling shall be accomplished via the use of flowable fill. Flowable fill is a self-leveling flowable, lean\nconcrete mix which can be placed in one or more lifts with no tamping required. The 28 day compressive\nstrength shall be less than 60 psi to ensure the backfill can be easily re-excavated to facilitate future repairs, but\nshall be greater than 40 psi to ensure stability of the trench.\n(II)  The flowable fill mix design shall be as determined by the City of Trinidad Engineering Department based\nupon the availability of materials and shall consist of water, portland cement, fine and coarse aggregates.\nFlowable fill shall be mixed in accordance with ASTM Standard Specifications for Ready Mix Concrete. The\nflowable fill shall be thoroughly mixed prior to discharging to ensure a uniform product and shall be discharged\nas close as practical to its final location to reduce segregation. Use of a spud vibrator is recommended to\nimprove the consolidation of the flowable fill mix.\n(III)  Use of flowable fill eliminates the need for any compaction of the\nbackfill. The maximum layer thickness shall be four feet. Additional layers\nshall not be placed until the flowable fill can be walked on without indenting\nmore than two inches.\n(7) Pavement repair.\n(a)  On asphalt paved streets, the contractor shall place hot bituminous pavement to the depth of the existing street\nsurface or a minimum of three (3) inches, whichever is greater.\n(b)  On bricked streets, the contractor shall reconstruct the excavated portion of the street by means of the following\nprocedure: A two inch thick asphalt base shall be placed on the compacted subbase. This is covered with a one inch\nlayer of sand on which the bricks are laid tight. The top surface of the bricks is covered with sand which is broomed\ninto the cracks around the bricks. A small vibratory compactor is used to settle the sand down into the cracks to\nprovide a tight fit.\n(c)  Any excavations done during periods that hot bituminous pavement is not available shall be temporarily patched\nwith cold bituminous asphalt. Within a one-year period of time all temporary patches shall be made permanent by\nthe permittee. The warranty period will not begin until the permanent patch has been made.\n(d) If the applicant desires the City of Trinidad Street and Bridge Department to make the street patch, said applicant\nshall pay for the necessary repairs at the following rates: (Ord. 1585, eff., 5-2-98)\nAsphalt Patch - $40.00 per square yard\nBrick Patch - $85.00 per square yard\nConcrete Patch - The City of Trinidad is not capable of performing concrete patch work.  Any such work required and\nrequested of the City shall be contracted out and the applicant shall be assessed the City’s cost plus 10%. (Ord. 1585,\neff., 5-2-98)\nTraffic Control - The applicant shall be charged a minimum of $50.00 for the setup and removal of traffic control\ndevices at each excavation patch location.  Major excavation patches will be assessed for the traffic control for the\nactual time and material costs incurred. (Ord. 1585, eff., 5-2-98)\nSection 17-32       Excavation permit; indemnification. (Ord. 1516, eff., 8/26/95)\nThe permittee shall indemnify and hold the City of Trinidad harmless and free from liability on account of any injury or\ndamage to persons or property resulting from or related to the permittee's exercise of any rights under an excavation\npermit from the City of Trinidad. Such duty of indemnification shall include, but shall not be limited to, the City's\nreasonable attorney's fees and costs in defending any claims brought against it as a result of the permittee's acts or\nomissions taken with respect to or as a result of an excavation permit issued by the City of Trinidad. In the event a claim is\nbrought either jointly or independently against the City as a result of acts or omissions of permittee covered under this\nduty of indemnification, the City, in its sole and conclusive discretion, may permit defense of it by permittee or the City\nmay separately defend, without limiting or reducing the permittee's duty of indemnification hereunder.\nSection 17-33.      Excavation permit; warranty. (Ord. 1516, eff. 8/26/95)\nAny patching, backfill compaction, or other work done as part of the excavation shall be warranted by the applicant against\nall defects for a period of twenty-four (24) months from the completion of such work. Any settlement of the surface within\nsuch twenty-four (24) month period shall be deemed conclusively to have resulted from improper construction techniques\nor defective compaction by the applicant. Nothing contained in these regulations shall be construed to require the\napplicant to maintain any repairs to pavement made by the City of Trinidad Street and Bridge Department if such repairs\nshould prove to have been defective. If any repairs are required to the excavation area (due to improper construction\ntechniques or defective compaction) during the warranty period, the applicant shall be billed for said repairs if they are\nperformed by City forces.\nSections 17-34 and 17-35 - REPEALED (Ord. 1516, eff. 8/26/95)\nARTICLE 4.  SIDEWALK CONSTRUCTION.\nSection 17-36.      Maximum and minimum widths of sidewalks.\nAll sidewalks shall be not less than five feet (5') and not more than twelve feet (12') in width, unless otherwise ordered by\nthe City Council, measured from the front line of the lots upon each street at right angles with such line toward the center\nof the street.  (Code 1958, Sec. 25-43.)\nSection 17-37.      Sidewalks to conform to established grade; supervision of laying.\nAll sidewalks shall be laid to the established grade of the City, which shall be shown or designated by the City Engineer free\nof charge to the owner of the abutting property, which grade shall be established by ordinance, or proper survey adopted\nby the City Council.  If the sidewalks are not so laid upon the grades so designated, the City Council may direct them to be\nrebuilt or repaired as hereinafter provided; and each sidewalk shall be laid under the direction and supervision of the City\nEngineer.  (Ord. 1200, Sec. 1, 4/21/81.)\nSection 17-38.      Slope.\nAll sidewalks shall be constructed with a dip or incline and with the same uniform grade or slope along the streets as the\nstreets themselves.  Whenever the streets have a grade other than longitudinal, there shall be no steps or setoffs upon the\nsidewalk other than that deemed necessary by the City Council.    (Code 1958, Sec. 25-45.)\nSection 17-39.      Sidewalk construction - Permit required.\nNo person shall begin the construction of any sidewalks without having first obtained a permit from the City Engineer.\n (Code 1958, Sec. 25-46.)\nSection 17-40.      Application for permit.\nThe City Engineer shall designate the grade upon which the sidewalk shall be built; and shall issue a permit and\ninstructions thereof, whenever application is made in due form upon printed blanks to be provided by the City, setting\nforth specifically the location and nature of the walk to be constructed.  (Code 1958, Sec. 25-47.)\nSection 17-41.      Sidewalk openings for fuel and light to be covered.\nAll openings for the admission of fuel and light in sidewalks shall be securely covered with iron or iron and glass covers.\n (Code 1958, Sec. 25-48.)\nSection 17-42.      Access to basement to be covered.\nThe owner or occupant of any building used for business purposes may construct and maintain, so long as the building\nshall be used for such purposes, upon the sidewalk in front of such building or upon any public alley at the side thereof, an\nopening for the purpose of affording ingress to and egress from the basement of such building; provided, however, no such\nopening shall be allowed unless it be constructed entirely within the lines of the lot upon which the building shall stand;\nand, provided further, every such opening shall be provided with a substantial cover or grating of iron, or shall be\nprotected by a substantial and safe railing of iron to be approved by the City Engineer.  (Code 1958, Sec. 25-49.)\nSection 17-43.      Curb, gutter and/or sidewalk requirements - New construction.\nWhenever any new building or structure is constructed or erected, and no sidewalk, curb and/or gutter exists in front of or\nalong the property where such construction is taking place or the existing sidewalk, curb and/or gutter does not extend the\nfull length of the property, that abuts an existing street right-of way, the City's Engineering Department shall order the\nproperty owner to construct such sidewalk, curb and/or gutter or portion thereof.  The Engineering Department may\nwaive such requirement upon good cause shown.  Should the property owner fail or refuse to comply with the order to\nconstruct sidewalk, curb and/or gutter, or should the property owner wish to appeal the order of the Engineering\nDepartment, either the City or the property owner may request a hearing before City Council.  Conduct of the hearing, and\naction taken pursuant to the hearing shall be in accordance with Sections 17-44 through 17-50 of this Code.  The City\nCouncil shall order the construction of such sidewalk, curb and/or gutter unless good cause be shown.  No certificate of\noccupancy with respect to the new building or structure shall be issued until the sidewalk, curb and/or gutter has been\nconstructed or the construction requirement has been waived by the City.  Any waiver granted pursuant to this Section\nshall not be permanent, and shall not prevent the City Council from ordering the construction of curb, gutter and/or\nsidewalk at such location at a later date.  (Ord. 1453, 08/03/93.)\nSection 17-44.      Hearing to consider construction of sidewalk, curb and/or gutter.\nUpon the request of the City Manager or upon its own motion, City Council may conduct a hearing to determine whether\nto order any sidewalk, curb and/or gutter or portion thereof, to be constructed by the adjacent or abutting property owner.\n Written notice of such hearing shall be served upon the adjacent or abutting property owner by either first class mail to\nthe last known address of such property owner, or by delivering a copy thereof to the owner or his/her agent, or by leaving\na copy thereof at the owner's usual place of abode with any member of the owner's family over the age of eighteen (18)\nyears, at least five (5) days prior to the date of the hearing.  At the hearing, the adjacent or abutting owner(s) shall have the\nright to be heard on the question of whether the sidewalk, curb and/or gutter or portion thereof shall be constructed or\nrepaired.  (Ord. 1453, 08/03/93.)\nSection 17-45.      Order to construct curb, gutter and/or sidewalk.\nIf following the hearing the City Council determines that it is necessary that any sidewalk, curb and/or gutter, or portion\nthereof, be constructed, it shall on its own motion, order the same to be done by the adjacent or abutting property owner.\n A written notice of said order shall be served on the adjacent or abutting property owner in the manner set forth in\nSection 17-46. Such notice shall direct the property owner to construct the sidewalk, curb and/or gutter within a period of\ntime not less than fifteen (15) days from the date of service of the notice, and shall further advise the property owner that if\nthe same is not constructed by the owner within the time specified, the City may construct or repair the same, and assess\nthe costs thereof against the property owner.  (Ord. 1453, 08/03/93.)\nSection 17-46.      Failure of owner to construct.\nWhenever any sidewalk, curb and/or gutter shall be ordered by the City Council to be constructed, and the abutting or\nadjacent property owner fails to do so within the time specified in the notice to construct, such work may be done by City\nforces or by an independent contractor retained by the City for such purpose. (Ord. 1453, 08/03/93.)\nSection 17-47.      Assessment of cost against property owner.\nUpon the completion of construction of sidewalk, curb and/or gutter by  City forces or by independent contractors\nemployed by the City for such purposes, the costs thereof shall be assessed against the abutting or adjacent property owner\nor owners.  The assessment shall be the actual costs of labor, equipment or the contract price of an independent contractor\nplus five percent of said costs for inspection and other incidental costs in connection therewith.  (Ord. 1453, 08/03/93.)\nSection 17-48.      Notice of assessment.\nThe City Clerk, as soon as practicable after such charge has accrued, shall send by first class mail, addressed to the owner\nof such abutting or adjacent property at the last known post office address of such owner, a notice of such assessment,\nwhich notice shall contain a description of such abutting or adjacent property, the name of the owner or owners of such\nproperty, the amount of the assessment, a statement advising that the owner may protest the amount of the assessment in\nwriting to the City Clerk within ten (10) days of the mailing of the Notice, and a statement that the assessment must be\npaid within thirty (30) days of the mailing of notice unless a timely written protest has been filed with the City Clerk.  (Ord.\n1453, 08/03/93.)\nSection 17-49.      Protest of assessment.\nUpon receipt of the written protest of assessment, the City Clerk shall refer the protest to the City Council, which shall\nschedule a hearing on the protest.  The property owner shall be notified in writing of the date and time of the hearing.  At\nthe hearing, the property owner shall have the right to be heard before the Council as to the justness and correctness of the\namount of the assessment.  (Ord. 1453. 08/03/93.)\nSection 17-50.      Failure of owner to pay assessment.\nIf the property owner shall fail to pay the assessment within thirty (30) days of the mailing of the notice, or the date by\nwhich City Council has ordered payment to be made in full or any installment payment, the City Clerk shall certify the\nassessment to the County Treasurer, to be collected in the same manner as other taxes assessed upon said property.  The\nassessment shall be a lien against such lot or tract of land until paid and shall have priority over all other liens except\ngeneral taxes and prior special assessments.  (Ord. 1453, 08/03/93.)\nSection 17-51.      Curbs and gutters - Materials.\nAll curbs and gutters, or curbs and gutters combined, shall be laid, constructed, rebuilt or repaired of concrete, in\naccordance with the requirements of the City ordinances and the specifications promulgated by the City Engineer.  Said\nspecifications shall be maintained in the Office of the City Engineer.  (Ord. 1200, 04/21/81.)\nSection 17-52.      Curbs on curb lines; gutters to attach to curbs.\nAll curbs shall be built upon the established curb lines of the street and the elevation of such curb shall be determined and\ndesignated by the City Engineer.  All gutters shall be laid and constructed upon the established grade of the street and shall\nabut or be attached to the outside of the curb.  (Code 1958, Sec. 25-59.)\nSection 17-53.      Street lawns and parks to conform to grade.\nThe space between the sidewalks and the street curb shall be for street lawns and parks.  All street lawns or parks shall be\nmade so as to conform to the grade of that part of the street upon which they abut, and shall be kept by the owner of the\npremises free from holes, depressions, ridges or obstructions that are liable to cause injury.  (Code 1958, Sec. 25-60.)\nSection 17-54.      Article not applicable in commercial districts; City's jurisdiction over parks.\nNothing in this Article shall in any manner be construed to conflict or interfere with the laying of sidewalks or paving in\nthe business part of the City or with the jurisdiction of the City over the parks for the construction of any public or other\nimprovement that the City may desire or authorize constructed over, upon or across such property.  (Code 1958, Sec. 25-\n61.)\nSection 17-55.      Removal of grade or line stakes prohibited.\nNo grade or line stakes set by the City Engineer for the purposes of this Article shall be removed or otherwise disturbed\nexcept by order of the City Engineer or City Council.  (Code 1958, Sec. 25-62.)\nSection 17-56.      Curb line and curb radius.\nCurb lines of all residential streets and curb radii at intersections shall be determined in accordance with the State of\nColorado Department of Highways, Roadway Design Manual, latest revised edition.  (Ord. 1200, Sec. 4, 04/21/81.)\nSection 17-57.      Fund established to front costs of repair or replacement.\nThere is established a fund to front the cost of repair or replacement of existing sidewalk, curb and gutter.  The City\nCouncil, in its discretion, shall determine when monies from such fund shall be used to front the cost of repair or\nreplacement of sidewalk, curb and/or gutter.  If the City Council directs the fronting of monies to pay such costs, the\nadjoining or abutting property owners may be required to reimburse the City for its costs.  The City may enter into an\nagreement with the adjoining or abutting property owners allowing such property owners to reimburse the City in\ninstallment payments over a period of time.  Any such agreement shall be approved by City Council.  (Ord. 1453,\n08/03/93.)\nSection 17-58.      Repair or replacement of curb, gutter and/or sidewalk.\n(1)  The City Council may in its discretion, order the repair or replacement of any sidewalk, curb and/or gutter pursuant to\nthe procedures set forth in Sections 17-44 and 17-45 of the Code of Ordinances.\n(2)  If the adjoining or abutting property owners fail to comply with the order to repair or reconstruct sidewalk, curb and\ngutter, the City Council may order that such work be done by City forces or by independent contractor pursuant to the\nprocedures set forth in Section 17-46, and assess costs for such work in accordance with the procedures set forth in Section\n17-47 through 17-50.  The City may be reimbursed for expenses pursuant to an agreement with the adjoining or abutting\nproperty owners, as set forth in Section 17-57.  (Ord. 1453, 08/03/93.)\nARTICLE 5. CULVERTS.\nSection 17-59.      When construction of culvert required.\nWhenever the owner or tenant of any property shall, in order to gain access from a public street to his/her property, fill in\nor cause to be filled in any ditch or gutter, lying between such street and such property, used for street drainage purposes,\nor shall, in order to gain access, place earth, sand, gravel or any other substance in such ditch or gutter, whereby the flow\nof water may be obstructed, the City Council, upon report of such condition by the Superintendent of Streets may, by\nresolution, order the owner of the property to place or construct in such ditch or gutter, at the point of access from the\nstreet to such property, a suitable culvert, which shall be in accordance with specifications to be prepared by the City\nEngineer, and which when in place shall be capable of carrying the full capacity of such ditch and at the same time permit\na ready ingress to and egress from such property.  The City Engineer shall, upon order of the Council, prepare\nspecifications for the type of culvert best suited for the case in question.  (Code 1958, Sec. 25-74.)\nSection 17-60.      Notice to owner to construct culvert.\nUpon the entry of an order by the Council, the Superintendent of Streets shall forthwith cause to be served on the property\nowner a written notice of such order requiring the installation of such culvert within fifteen (15) days from the date of\nservice, which service shall be accomplished by delivering a copy of said notice to such owner, or his/her agent, or by\nleaving a copy thereof at the usual place of abode of such owner with any member of his/her family over the age of\neighteen (18) years.  In case such owner be a nonresident, and have no resident agent, service shall be made by mailing\nsaid notice addressed to such owner at the latest address of such owner contained on the general tax assessment roll in the\noffice of the Treasurer of Las Animas County.  (Code 1958, Sec. 25-75.)\nSection 17-61.      Failure of owner to construct; construction by City; certification to City Clerk.\nUpon failure or refusal of the property owner to construct such culvert within the time specified, it shall be constructed\nunder the direction of the Superintendent of Streets and Bridges, who, upon completion of work shall certify in writing to\nthe City Clerk the cost of such culvert, together with a description of the real estate served by it and the name of the owner\nof such real estate.  (Code 1958, Sec. 25-79.)\nSection 17-62.      Notice to owner of cost; assessment and hearing.\nThe Clerk shall, by registered mail, return receipt requested, notify the owner of the property to be assessed that the\nculvert has been constructed, the cost thereof, and that any complaints or objections which may be made in writing by\nsuch owner to the City Council shall be filed in the office of the Clerk within fifteen (15) days from the date of such notice\nand will be heard and determined by the Council before the passage of a resolution assessing the cost of such culvert; and\nthe date when and place where such complaints and objections will be heard.  (Code 1958, Sec. 25-77.)\nSection 17-63.      Hearing on assessments; penalty; collection.\nAt the time specified in the notice, or, at some adjourned time, the Council shall hear and determine all such complaints\nand objections, and shall thereupon, by resolution, assess the cost of the culvert, together with all costs and expenses of\nthese proceedings, on the property it serves.  The amount so assessed shall from the date of such assessment constitute a\nlien against the real estate of such owner, and unless the same be paid within ten (10) days after such assessment, it shall,\ntogether with ten percent (10%) penalty, be certified by the City Clerk to the County Treasurer in the same manner as\nspecial improvement taxes are certified to such officer, to be collected according to law.  (Code 1958, Sec. 25-78.)\nSection 17-64.      Driveway - Culvert Fund.\nThere is created the driveway - culvert fund to be composed of money paid in under the provisions of this Article, warrants\nin payment of culvert construction costs shall be drawn on and payable out of this fund; provided, however, when there\nshall be insufficient moneys in said fund to meet a payment, such deficit may be met from the street and bridge fund which\nshall thereafter be reimbursed from such driveway - culvert fund.  (Code 1958, Sec. 25-79.)\nARTICLE 6.  CLOSURE OF CITY STREETS FOR ATHLETIC OR SPECIAL EVENTS.\nSection 17-65.      Closure of City streets for athletic or special event.\n(1)       (a)  City streets or designated portions of City streets may be partially or completely closed for the purpose of\nconducting athletic or special events thereon or for the purpose of ensuring the safe and efficient movement of traffic to\nand from or around an athletic event or special event which is in such  proximity to a City street that the event or any\ntraffic attendant thereto will have a significant effect on the normal traffic flow.\n(b)  When the term \"close\" or \"closure\" is used in this Section, it shall be deemed to include the partial closure of any land\nor other portion of a City street or the restriction or regulation of traffic on the City street by the Trinidad Police\nDepartment.\n(c)  The City Manager has the authority to close a City street or portion thereof for the purposes of paragraph (a) of this\nsubsection (1), when an athletic or special event is proposed to be held on such street or when a proposed event may cause\na significant disruption to the normal flow of traffic on a City street.\n(d)  The City Manager shall not approve an event which the City does not have sufficient resources to properly manage in\nthe manner consistent with the preservation of the public peace, health and safety.\n(2)  A closure by the City Manager may be authorized only if:\n(a)  A written application therefor is submitted to the City Manager at least fifteen (15) days prior to the date of the\nproposed closure, containing such information as the City Manager deems necessary, and the application is approved by\nthe City Manager.\n(b)  If in the opinion of the City Manager, liability coverage by the applicant is necessary in order to protect the public\npeace, health and safety, the applicant shall pay for and provide evidence of liability coverage in amounts deemed\nadequate by the City Manager to protect the City from any injuries or damages which may arise out of the closure of the\nCity's assistance in ensuring the safe conduct of the closure.\n(c)  The closure is implemented in a manner that will cause the least inconvenience to the driving public consistent with\nthe requirements of the athletic or special event and the event can be conducted in a manner consistent with the\npreservation of the public peace, health and safety.\n(3)  If the City Manager approves the application, a permit shall be issued to the applicant authorizing the closure as\nrequested by the applicant or as modified by the City.\n(4)  No liability shall attach to the City of Trinidad for any injuries or damages which are caused solely by the use of a City\nstreet for an athletic or special event when such event has not been approved by the City Manager.  (Ord. 1396, 6/04/91.)\nSection 17-66.      Penalty for failure to obtain permit or to comply with terms of permit.\nAny person who conducts an athletic or special event on a City street when a permit for said event has not been issued or\nany person who violates the terms of a permit which has been issued for an athletic or special event, commits a\nmisdemeanor and is subject to a fine of up to Three Hundred Dollars ($300.00) or imprisonment of up to ninety (90)\ndays, or both.  (Ord. 1306, 6/04/91.)\nARTICLE 7.  VACATION PROCEEDINGS.\nSection 17-67.      Repealed (Ord. 3007, eff. 10/30/20)\nSection 17-68.      Repealed (Ord. 3007, eff. 10/30/20)\nSection 17-69.      Repealed (Ord. 3007, eff. 10/30/20)\nSection 17-70.      Repealed (Ord. 3007, eff. 10/30/20)\n"
}