{
    "chapter": "Chapter 20 - Vehicles and Traffic",
    "content": "Chapter 20 - Vehicles and Traffic\nARTICLE 1.  MUNICIPAL TRAFFIC CODE.       \nSections:    \n20-1                       Model Traffic Code for Colorado - Adoption.    \n20-2                       Additions and modifications.    \n20-3                       Penalties.    \n20-4                       Application.    \n20-5                       Validity, Repeal and Interpretation.    \nARTICLE 2.  GENERAL PROVISIONS.               \n20-6                       Certain streets as part of State Highway.    \n20-7                       Commercial activity within right of way prohibited.    \n20-8                       Parking restrictions; traffic control devices.    \n20-9                       Parking prohibited during snow removal.    \n20-10                     Traffic regulations subject to approval by Department of Transportation.    \n20-11                     Penalty for violation.    \n20-11.1                  State of Colorado, State Highway Access Code, Volume 2, Code of Colorado Regulations 601-1, March\n2002, as amended    \nARTICLE 3.  AUTHORITY TO IMPOUND VEHICLES AND DISPOSE OF IMPOUNDED\nVEHICLES.     \n20-12                     Definitions.    \n20-13                     Impounding of vehicles; emergency circumstances.    \n20-14                     Impoundment of illegally parked vehicles.   \n20-15                     Abandonment of vehicles; procedures preceding impoundment.    \n20-16                     Leaving of wrecked, junked or partially dismantled vehicles on the street or other public property.    \n20-17                     Wrecked, junked or partially dismantled vehicles on private property.    \n20-18                     Disposal of vehicles removed and impounded pursuant to this Article.    \nARTICLE 4.  ADDITIONAL TRAFFIC REGULATIONS.      \n20-19                     Parking in freight loading zone.    \n20-20                     Limitations on parking.    \n20-21                     Repealed (Ord. 1854, eff. 6/27/08)    \n20-22                     Registered owner liable for parking violations.    \n20-23                     Persons prohibited from restricting parking on public streets.    \n20-24                     Parking not to obstruct traffic.    \nARTICLE 5. PARKING RESTRICTIONS FOR RECREATIONAL VEHICLES AND UTILITY\nTRAILERS.      \n20-25                     Definitions.    \n20-26                     Restricted areas and times.    \n20-27                     School zones.    \n20-28                     Penalty for violation.    \nARTICLE 6. COMMERCIAL TRUCK TRAFFIC          \n20-29                     Definitions    \n\n20-30                     Designation of routes, maps    \n20-31                     Operation of commercial trucks    \n20-32                     Use of engine compression brake prohibited    \n20-33                     Penalty for violation    \n   \nCHAPTER 20.  VEHICLES AND TRAFFIC.      \nARTICLE 1.  MUNICIPAL TRAFFIC CODE.     \nSection 20-1.        Model Traffic Code for Colorado - Adoption.     \n    Pursuant to parts 1 and 2 of article 16 of title 31 and part 4 of article 15 of title 30, C.R.S., there is hereby adopted by\nreference the 2020 edition of the \"Model Traffic Code” promulgated and published as such by the Colorado Department of\nTransportation, Traffic Engineering and Safety Branch, 2829 W Howard Place, Denver, CO 80204. The subject matter of\nthe Model Traffic Code relates primarily to comprehensive traffic control regulations for the City. The purpose of this\nOrdinance and the Code adopted herein is to provide a system of traffic regulations consistent with state law and generally\nconforming to similar regulations throughout the state and the nation. Three (3) copies of the Model Traffic Code adopted\nherein are now filed in the office of the Clerk of the City of Trinidad Colorado, and may be inspected during regular\nbusiness hours.  (Ord. 3016, repealed and reenacted, eff. 4/1/21)         \nSection 20-2.        Additions and modifications.  (Ord. 1822, eff., 12/15/06)    \n    The adopted Model Traffic Code is subject to the following modification:    \n    (1)   Section 1412(10)(b).    \n    No person shall ride a bicycle or skateboard upon any sidewalk located within the following street segments of the\ndowntown area:    \n    Commercial Street from Colorado Avenue (Five Points) to First Street;    \n    Main Street from Carbon Street and Santa Fe Trail to Walnut Street;    \n    Animas Street from Nevada Avenue and University Street to First Street.    \n    (2)   A violation of any provision of Chapter 20 of this code shall be deemed to be a traffic infraction if, at the time of the\ncommission of the violation, its counterpart violation under the provisions of Article 4 in Title 42 of the Colorado Revised\nStatutes, if any, is designated by state law as being a traffic infraction.  If no counterpart violation exists under state law,\nthe violation shall be deemed to be a traffic infraction.  All other violations under Chapter 20 of this code shall be\nconsidered misdemeanors punishable as described in paragraph (2) of Section 20-3.  Any person against whom judgment\nis entered for a traffic infraction under this code shall be subject to the penalty of a fine not exceeding one thousand dollars\nand shall not be subject to imprisonment on account of such judgment.  \n \n    (a)   Model Traffic Code Parts 1 and 2, and 5 to 15 and 19 are traffic infractions, except as otherwise provided in\nsubsections (b), (c), and (d) below.    \n      \n    (b)   Model Traffic Code Sections 107, 228(8), 233, 235, 507, 508, 509, 1005, 1401, 1402(1), 1413, and 1903(1)(a)\nare class 2 traffic misdemeanors.    \n       \n    (c)   In section 1101 of the Model Traffic Code a violation of driving one to twenty-four miles per hour in excess of\nthe reasonable and prudent speed or in excess of the maximum lawful speed limit of seventy-five miles per hour is a\ntraffic infraction; a violation of driving twenty-five or more miles per hour in excess of the reasonable and prudent\nspeed or in excess    \n    of the maximum lawful speed limit of seventy-five miles per hour is a class 2 misdemeanor traffic offense.    \n       \n    (d)   Violation of subsection (2) of section 1402 is a class 1 traffic misdemeanor.    \nSection 20-3.        Penalties.   (Ord. 3016, Sec. 20-3 repealed and reenacted, eff. 4/1/21)    \nThe following penalties, herewith set forth in full, shall apply to this ordinance:\n(1) It is unlawful for any person to violate any of the provisions adopted in this Ordinance.\n(2) Every person convicted of a violation of any provision adopted in this ordinance shall be punished by a fine not to\nexceed Two\nThousand Six Hundred and Fifty Dollars ($2,6500.00) or by imprisonment not exceeding ninety (90) days, or by both\nsuch fine and imprisonment.\n(3) (a) Any persons convicted of a violation of the Compulsory Insurance requirements of the State, MTC 1409(1), (2), or\n(3), shall be subject to a mandatory minimum fine of not less than five hundred dollars ($500.00). The court may suspend\nup to one half of the fine upon a showing that appropriate insurance as required pursuant to CRS 10-4-619 or 10-4-624 has\nbeen obtained.\n(b) Nothing in this paragraph (3) shall be construed to prevent the court from imposing a fine greater than the minimum\nmandatory fine.\n(c) Upon a second or subsequent conviction under MTC 1409(1), (2), or (3), within a period of five years following a prior\nconviction under said MTC 1409(1), (2), or (3), in addition to any imprisonment imposed pursuant to paragraph 2 of this\nsection, the defendant shall be punished by a maximum mandatory fine of one thousand dollars ($1,000.00). The court\nmay suspend up to one half of the fine upon a showing that appropriate insurance as required pursuant to CRS 10-4-619 or\n10-4-624 has been obtained.\n(d) In addition to the penalties prescribed in paragraphs 3(a), (b), and (c) of this section, any person convicted pursuant to\nthis section may, at the discretion of the court, be sentenced to perform not less than forty hours of community service.\n(e) Testimony of the failure of any owner or operator of a motor vehicle to present immediate evidence of a complying\npolicy or certificate of self-insurance in full force and effect as required by law, when requested to do so by a peace officer,\nshall constitute prima facie evidence, at a trial concerning a violation charged under this paragraph (3), that such owner or\noperator of a motor vehicle violated said MTC 1409(1), (2), or (3).\n(4) All penalties collected pursuant to this article shall be paid to the City Department of Finance and deposited into the\nGeneral Fund of the City of Trinidad in support of the Trinidad Police Department.\nSection 20-4.        Application.  (Ord. 3016, Sec. 20-4 repealed and reenacted, eff. 4/1/21)    \n    This ordinance shall apply to every street, alley, sidewalk area, driveway, park, and to every other public way or public\nplace or public parking area, either within or outside the corporate limits of this municipality, the use of which this\nmunicipality has jurisdiction and authority to regulate. The provisions of section 1401, 1402, 1413, and part 16 of the\nadopted Model Traffic Code, respectively concerning reckless driving, careless driving, eluding a police officer, and\naccidents and accident reports shall apply not only to public places and ways but also throughout this municipality.    \nSection 20-5.        Validity, Repeal and Interpretation.     (Ord. 3016, Sec. 20-5 repealed and reenacted 4/1/21)    \n(1) Validity. If any part or parts of this ordinance are for any reason held to be invalid such decision shall not affect the\nvalidity of the remaining portions of this ordinance. The City Council hereby declares that it would have passed this\nordinance and each part or parts thereof, irrespective of the fact that any one part or parts be declared invalid.\n(2) Repeal. Existing or parts of ordinances covering the same matters as embraced in this ordinance are hereby repealed\nand all ordinances or parts of ordinances inconsistent with the provisions of this ordinance are hereby repealed, except\nthat this repeal shall not affect or prevent the prosecution or punishment of any person for any act done or committed in\nviolation of any ordinance hereby repealed prior to the taking effect of this ordinance.\n(3) Interpretation. This ordinance shall be so interpreted and construed as to effectuate its general purpose to conform\nwith the State’s uniform system for the regulation of vehicles and traffic. Article and section headings of the ordinance and\nadopted Model Traffic Code shall not be deemed to govern, limit, modify or in any manner affect the scope, meaning or\nextent of the provisions of any article or section thereof.    \nARTICLE 2.  GENERAL PROVISIONS.  \n Section 20-6.        Certain streets as part of State Highway.     \n    The portions of the streets in the City which State Highway 12 lies are hereby dedicated to the people of the State as\nconnecting links in and as a part of Colorado State Highway No. 12 and the streets or highways shall have priority over\nlocal intersecting streets.  (Ord. 914, 7/3/67.)    \nSection 20-7.        Commercial activity within right of way prohibited.     \n    No commercial activity or encroachment shall be permitted within the right-of-way boundaries of the streets described\nin Section 20-6 and that the width from curb to curb of said streets shall be a minimum of fifty-six feet (56'). (Ord. 914,\n7/3/67.)    \nSection 20-8.        Parking restrictions; speed limitations.     \n   Parking on the streets described in Section 20-4 or portions thereof is prohibited at certain places as specified in Section\n42-4-1204 C.R.S., as amended; parking when and where permitted shall be parallel unless otherwise specifically provided\nby other Sections of this Code; traffic control devices on said streets shall conform to the uniform standards as adopted by\nthe State Department of Highways.    \nSection 20-9.        Parking prohibited during snow removal.  (Ord. 1515, eff., 8/26/95)   \n    (1) No person shall park or otherwise leave unattended a motor vehicle within any of the following street segments\nwithin the City, which shall be designated as emergency snow routes by official signs containing the snowflake symbol,\nbetween the hours of 2:00 A.M. and 6:00 A.M. until snow removal has been completed, whenever there exists an\naccumulation of three inches of snow or more, necessitating the use of the City's emergency snow removal equipment\nwithin such designated snow emergency routes:    \n    (a)    Pine Street between State Street and Commercial Street.    \n    (b)    Commercial Street between Pine Street and First Street    \n    (c)    Animas Street between Purgatoire Drive and Main Street.    \n    (d)    Maple Street between Elm Street and First Street.    \n    (e)    Chestnut Street between Elm Street and First Street.    \n    (f)     Santa Fe Trail between Main Street and First Street.    \n    (g)    Beech Street between Main Street and First Street.    \n    (h)    Convent Street between Cedar Street and First Street.    \n    (i)     Main Street between Interstate 25 and Ash Street.    \n    (j)     Elm Street between Commercial Street and Maple Street.    \n    (k)    Plum Street between Commercial Street and Maple Street.    \n    (1)    Church Street between Commercial Street and Animas Street.        \n   (m)   First Street between Maple Street and Chestnut Street.      \n   (2) Any vehicle parked or otherwise left unattended within an emergency snow route in violation of this Section which\ncauses an obstruction to snow removal equipment, shall be subject to immediate impoundment and removal.   \nSection 20-10.      Traffic regulations subject to approval by Department of Transportation.    \n   All traffic and parking regulations hereafter adopted which pertain to the streets and roadways which form a part of the\nState Highway System and constitute a connecting link thereof shall be submitted to the Colorado Department of\nTransportation for approval in accordance with the provisions of Section 43-2-135. C.R.S., before they shall become\neffective.   \nSection 20-11.      Penalty for violation.    \n   Any violation of this Article shall be punishable in the Municipal Court of the City by penalty as provided by the Model\nTraffic Code for Colorado Municipalities, 1977, as adopted herein.  Any police officer of the City is authorized and required\nto enforce the provisions of this Article and the said Court shall have jurisdiction to hear and try any person charged with\nits violation.  (Ord. 914, 7/3/67.)   \n  \nSection 20-11.1.   State of Colorado, State Highway Access Code, Volume 2, Code of Colorado Regulations\n601-1, March 2002, as amended.    \n  The State of Colorado, State Highway Access Code, Volume 2, Code of Colorado Regulations 601-1, March 2002, as\namended originally adopted June 18, 1998 by the Transportation Commission of Colorado pursuant to §43-2-147(4),\nC.R.S. in accordance with §24-4-103, C.R.S. effective August 31, 1998 and any amendments made to the same through\nMarch, 2002, promulgated and published by the Colorado Department of Transportation, 4201 East Arkansas Avenue,\nDenver, Colorado 80222, be and the same is hereby adopted by reference and incorporated as fully as if set out at length\nherein.  At least one copy of said Access Code as above set forth has been and is now filed in the office of the City Clerk.  \n  The subject matter of the Access Code relates primarily to comprehensive standards for the design and location of\ndriveways and other points of access to public highways, including streets under the jurisdiction of the City that are not\npart of the state highway system.  The purpose of the Access Code and the City’s adoption thereof is to provide the\nprocedures and standards necessary to protect the public health, safety and welfare, to maintain smooth traffic flow, to\nmaintain highway right-of-way drainage and to protect the functional level of public highways while meeting state,\nregional, local and private transportation needs and interests.  (Ord. 1746, eff., 2/17/04, Ord. 1890, eff., 11/14/09)  \nARTICLE 3.  AUTHORITY TO IMPOUND VEHICLES AND DISPOSE OF IMPOUNDED VEHICLES.\n(Ord. 3020, Sec 20-12 to 20-18 amended, eff. 5-14-21)\nSection 20-12.      Definitions.    \n   The following definitions shall apply in the interpretation and enforcement of this Article:   \n   (1)  Vehicle  shall mean a machine propelled by power other than human power designed to travel along the ground by\nuse of wheels, treads, runners or slide to transport persons or property or pull machinery and shall include, without\nlimitation, automobile, airplane, truck, trailer, motorcycle, motor scooter, tractor, buggy and wagon.   \n   (2)  Street or highway  shall mean the entire width between the boundary lines of every right-of-way publicly maintained\nwhere any part thereof is open to the use of the public for purposes of vehicular travel.   \n   (3)  Property  shall mean any real property within the City which is not a street or highway.   \n   (4)  Collector's item  shall mean a motor vehicle which is either at least twenty-five (25) years old, a make or model\nrecognized by the Executive Director of the State Department of Revenue as being antique, or a make or model of motor\nvehicle recognized by the Executive Director of the State Department of Revenue as having unique interest or historic\nvalue.   \n   (5)  Wrecked or junked vehicle and/or recreational vehicle shall mean any vehicle and or recreational vehicle which is\nextensively damaged, such damage including but not limited to any of the following: one or more flat tires, a broken\nwindow, windshield or both, missing wheels, tires, motor or transmission; is in a general state of disrepair, or cannot be\noperated mechanically or is not legally registered to operate upon the public right-of-way.  \n   (6) Recreational Vehicle shall mean any recreational vehicle, whether machine propelled by power other than human\npower designed to travel along the ground by use of wheels, treads, runners or slide, or meant to be pulled by a Vehicle as\nherein defined.\nRecreational Vehicles is further defined as any vehicular type portable structure without permanent foundation, which can\nbe towed, hauled, or driven, and designed to serve as temporary living accommodations for recreational, camping, or\ntravel use, and including, but not limited to travel trailers, camping trailers, converted buses, and self-propelled motor\nhomes. Excluded from this definition are passenger vehicles designed for everyday use, and stock vans customized as\nconversion vans. Recreational vehicle shall include campers, trailers, and boats. Recreational vehicles are required to be\nlocated at the property where it is registered and at a legally-inhabited/inhabitable residence pursuant to Section 14-\n49.2(C)(9).\nSection 20-13.      Impounding of vehicles; emergency circumstances.    \nIn the circumstances hereinafter enumerated, preservation of the public safety and welfare requires that vehicles and/or\nrecreational vehicles be removed from the public right-of-way without delay. Therefore, police officers are hereby\nauthorized to remove, or have removed, at their discretion, a vehicle and/or recreational vehicle from any street, alley,\nhighway, roadway, sidewalk, bridge, viaduct, public parking lot, or from any other public way or place, to the lot\nmaintained by the City or the Police Department for the storage of impounded vehicles, or to any other place of safety\nunder any of the circumstances hereinafter enumerated:\n(1) When any vehicle and/or recreational vehicle is left unattended upon any street or other public way or place,\nwhere such vehicle or recreational vehicle constitutes an obstruction to traffic;\n(2) When a vehicle and/or recreational vehicle upon a street or other public way is so disabled as to constitute an\nobstruction to traffic, or the person or persons in charge of the vehicle and/or recreational vehicle are by reason of\nphysical injury incapacitated to such an extent as to be unable to provide for its custody and removal;\n(3) When any vehicle and/or recreational vehicle is left unattended upon a street or any other public way or place,\nand is parked so illegally as to constitute a hazard or obstruction to the normal flow of traffic;\n(4) When the driver of such vehicle and/or recreational vehicle is taken into custody by the Police Department and\nsuch vehicle or recreational vehicle would thereby be left unattended upon a street or other public way or place;\n(5) When the driver of any vehicle and/or recreational vehicle or the vehicle and/or recreational vehicle which\nhe/she is driving is reasonably suspected of having been involved in any hit and run accident;\n(6) When removal is necessary in the interest of public safety because of fire, flood, storm or other emergency\nreason;\n(7) When any vehicle and/or recreational vehicle is reasonably suspected of being stolen, or parts thereof to be stolen\nparts; or\n(8) When the driver of any vehicle and/or recreational vehicle is taken into custody for a suspected felony or\nmisdemeanor, or when the vehicle and/or recreational vehicle is suspected of containing stolen goods or other\ncontraband\nSection 20-14.      Impoundment of illegally parked vehicles.    \nAny vehicle and/or recreational vehicle, not subject to immediate removal under Section 20-13, which is parked in\nviolation of any provision of the Code of Ordinance of the City of Trinidad, within a public street or highway or on any\nother public property within the City for a period of twenty four (24) hours or more shall be subject to removal and\nimpoundment either by or at the direction of a police officer, without prior notice.   \nSection 20-15.      Abandonment of vehicles; procedures preceding impoundment.    \n(1) Promotion and preservation of the public health and safety requires that vehicles and/or recreational vehicles left\nabandoned on public property or private property without permission of the owner, be removed. No person shall abandon\nany vehicle and/or recreational vehicle on any street, highway or other public property within the City, or on any private\nproperty other than his/her own without the consent of the owner thereof.\n(2) A vehicle and/or recreational vehicle meeting any of the following criteria is an abandoned vehicle:\n(a) Any vehicle and/or recreational vehicle left unattended on private property for a continuous period of twenty four (24)\nhours or more without the consent of the owner or lessee of such property or his/her legally authorized agent;\n(b) Any vehicle left unattended on public property, other than a street or highway, for a continuous period of seventy two\n(72) hours or more; and any recreational vehicles left on public property, including public streets, row, lot, highway, alley,\npublic property not zoned for parking, public property that is not improved, for a continuous period of more than forty-\neight (48) hours, or in any school zone when school is in session, in accordance with Section 20-26 and 20-27 of the\nMunicipal Code, respectively;\n(c) Any vehicle left unattended within a public street or highway for a continuous period of more than seven (7) days,\nunless such vehicle is parked entirely within the area abutting residential property occupied by the owner of such vehicle\nand has current registration and at least one current license plate.\n(3) Whenever an officer has reason to believe that a vehicle and/or recreational vehicle may be abandoned within a street\nor highway, he/she shall securely affix to the windshield, the driver's side door, or other conspicuous location, a warning\nnotice, indicating that the vehicle and/or recreational vehicle is believed to be abandoned in violation of this Section, and\nthe reason for such a belief. If the vehicle and/or recreational vehicle does not have current registration and at least one (1)\ncurrent license plate, the notice shall state that the vehicle and/or recreational vehicle must be removed from the public\nright-of-way unless current registration is obtained and current license plates are affixed to the vehicle and/or recreational\nvehicle, and the\nvehicle is moved to a location in the public street or highway immediately abutting the owner's residence within seven (7)\ndays and in the case of a recreational vehicle, removed to the owner’s private property abutting their residence and not in\nthe public street or highway. If the vehicle does have current license plates, the notice shall state that the vehicle must be\neither removed from the public right-of-way or to a location in the public street or highway immediately abutting the\nowner's residence, and in the case of a recreational vehicle, removed to the owner’s private property abutting their\nresidence and not in the public street or highway, within seven (7) days. The Notice shall further state that if the vehicle\nand/or recreational vehicle is not removed as set forth above, within the seven (7) day time period, a Municipal Court\ncitation may be issued, and the vehicle and/or recreational vehicle shall be subject to immediate impoundment by the City\nfollowing the expiration of the seven (7) day period, unless a hearing has been requested in writing during that period.\n(4) No vehicle and/or recreational vehicle alleged to be abandoned may be removed and impounded by the City until the\nfollowing additional steps have been taken:\n(a) Reasonable efforts shall be made to find the owner of the vehicle and/or recreational vehicle, including checking the\nrecords of the State Department of Motor Vehicles and County Clerk and Recorder, and inquiring of residents of abutting\nproperties.\n(b) If the owner is located, he/she shall be notified by first class mail, certified mail or personal service that his/her vehicle\nand/or recreational vehicle is believed to be abandoned in violation of this Section, and the reason for such a belief, and\nthat unless either the vehicle and/or recreational vehicle is removed or a hearing is requested within seven (7) days after\nthe mailing or service of the notice, the vehicle and/or recreational vehicle shall be subject to removal and impoundment\nwithout delay.\n(c) If the owner, after reasonable efforts to locate have been made, cannot be located, the vehicle and/or recreational\nvehicle may be removed and impounded by the City without delay, provided that seven (7) days have elapsed since the\nwarning notice was affixed to the vehicle and/or recreational vehicle.\n(5) Any hearing must be requested in writing to the City Manager within seven (7) days after a warning notice has been\naffixed to the vehicle and/or recreational vehicle, if the owner cannot be located, or within seven (7) days after mailing or\nservice of the second notice, if the owner is located. If a written request is made for a hearing, a vehicle and/or recreational\nvehicle may not be impounded until after the hearing has been held and a decision rendered.\n(6) If a hearing is requested pursuant to this Section, the City Manager or his/her designee shall conduct a hearing as soon\nas practicable, at which time testimony and evidence may be presented relative to the propriety of impounding such\nvehicle and/or recreational vehicle, and the City Manager or his/her designee shall issue a written decision following the\nhearing as to whether the vehicle and/or recreational vehicle is abandoned pursuant to this Article and therefore, subject\nto impoundment. If the City Manager or his/her designee determines that such vehicle and/or recreational vehicle is\nsubject to impoundment, the owner shall have twenty four (24) hours to remove the vehicle and/or recreational vehicle\nfrom the public right-of-way, or to a location within the public right-of-way immediately abutting the owner's residence\nand in the case of a recreational vehicle, removed to the owner’s private property abutting their residence and not in the\npublic street or highway, or to satisfy any other requirement set forth in the written decision. Should he/she fail to do so,\nthe vehicle and/or recreational vehicle shall be subject to immediate impoundment by the City.\n(7) Any vehicle and/or recreational vehicle left unattended on private property for twenty four (24) hours or more without\nthe consent of the owner or lessee of such property or the owner's legally authorized agent, shall be subject to removal and\nimpoundment, without prior notice or hearing, upon the request of such owner, lessee or agent.\n(8) Any vehicle and/or recreational vehicle left unattended on public property, other than a street or highway, for a period\nof seventy two (72) hours or more, shall be subject to removal and impoundment, without prior notice or hearing.\n(9) A Municipal Court Summons and Complaint for violation of this Section may be issued after either completion of the\nadministrative hearing and rendering of the hearing officer's decision, if a hearing has been requested, and the hearing\nofficer has determined the vehicle and/or recreational vehicle to be abandoned, or expiration of all periods during which a\nhearing may be requested, if no hearing has been requested.\nSection 20-16.      Leaving of wrecked, junked or partially dismantled vehicles on the street or other public\nproperty.    \n(1) Preservation of the public health and safety requires that junked, wrecked and partially dismantled vehicles and/or\nrecreational vehicle left on public property, including streets and highways, be removed or repaired. Therefore, wrecked,\njunked or partially dismantled vehicles and/or recreational vehicle left on public property are declared to be a nuisance.\nNo person shall leave any wrecked, junked or partially dismantled vehicle and/or recreational vehicle on any public\nproperty within the City.\n(2) Whenever a vehicle and/or recreational vehicle has been left wrecked, junked or partially dismantled within a public\nstreet or highway or any other public property continuously for more than forty-eight (48) hours, an officer shall securely\naffix to the windshield or driver's side door, or other obvious location on a recreational vehicle, a conspicuous warning\nnotice indicating that the vehicle and/or recreational vehicle is believed to be wrecked, junked or partially dismantled in\nviolation of this Section and the reason for such a belief. The notice shall also state that if the vehicle and/or recreational\nvehicle is not removed from the street, highway or other public property or necessary repairs are not made within seven (7)\ndays, a Municipal Court citation may be issued, and the vehicle and/or recreational vehicle shall be subject to immediate\nimpoundment by the City following the expiration of the seven (7) day period, unless a hearing has been requested in\nwriting during that period.\n(3) No vehicle and/or recreational vehicle alleged to be wrecked, junked or partially dismantled, may be removed and\nimpounded by the City until the following additional steps have been taken:\n(a) Reasonable efforts shall be made to find the owner of the vehicle and/or recreational vehicle, including checking the\nrecords of the State Department of Motor Vehicles and the County Clerk and Recorder, and inquiring of residents of\nabutting properties.\n(b) If the owner is located, he/she shall be notified by first class mail, certified mail or personal service that his/her vehicle\nand/or recreational vehicle is believed to be wrecked, junked or partially dismantled in violation of this Section, and the\nreason for such a belief, and that unless the vehicle and/or recreational vehicle is removed from the street, highway or\nother public right-of-way or adequately repaired, or a hearing is requested within seven (7) days after the mailing or\nservice of the notice, the vehicle and/or recreational vehicle shall be subject to removal and impoundment without delay.\n(c) If the owner, after reasonable efforts to locate have been made, cannot be located, the vehicle and/or recreational\nvehicle may be removed and impounded by the City without delay, provided that seven (7) days have elapsed since the\nwarning notice was affixed to the vehicle and/or recreational vehicle.\n(4) Any hearing must be requested in writing to the City Manager within seven (7) days after a warning notice has been\naffixed to the vehicle and/or recreational vehicle, if the owner cannot be located, or within seven (7) days after mailing or\nservice of the second notice, if the owner is located.\n(5) If a hearing is requested pursuant to this Section, the City Manager or his/her designee shall conduct a hearing as soon\nas practicable, at which time testimony and evidence may be presented relative to the propriety of impounding such\nvehicle and/or recreational vehicle, and the City Manager or his/her designee shall issue a written decision following the\nhearing as to whether the vehicle and/or recreational vehicle has been left wrecked, junked or partially dismantled on\npublic property and is therefore, subject to impoundment. The hearing officer shall have the authority to require the\nvehicle and/or recreational vehicle owner to demonstrate that the vehicle and/or recreational vehicle is mechanically\noperable. If the hearing officer determines that such vehicle and/or recreational vehicle is subject to impoundment, the\nowner shall have twenty-four (24) hours to remove the vehicle and/or recreational vehicle from public property or have it\nadequately repaired. Should he/she fail to do so, the vehicle and/or recreational vehicle shall be subject to immediate\nimpoundment by the City.\n(6) A Summons and Complaint for violation of this Section may be issued after either completion of the administrative\nhearing and rendering of the hearing officer's written decision, if a hearing has been requested, and the hearing officer has\ndetermined the vehicle and/or recreational vehicle to be wrecked, junked or partially dismantled, or expiration of all\nperiods during which a hearing may be requested, if no hearing has been requested.\nSection 20-17.      Wrecked, junked or partially dismantled vehicles on private property.    \n(1) Preservation of the public health and safety requires that vehicles and/or recreational vehicles left wrecked, junked or\npartially dismantled on private property, be removed. It is therefore unlawful for any person who is the owner of any\nvehicle and/or recreational vehicle, or the owner of any real property, or who is in charge or control of any such real\nproperty, whether as owner, tenant, occupant lessee or otherwise, to permit or allow any wrecked, junked or partially\ndismantled vehicle and/or recreational vehicle or parts thereof to remain on such real property longer than thirty (30)\ndays, as determined by recorded observation or signed complaint, and such vehicle and/or recreational vehicle is declared\nto be a nuisance, provided that this Section shall not apply with regard to a collector's item where the provisions of C.R.S.\n42-12-103 have been complied with; a vehicle and/or recreational vehicle or parts of a vehicle and/or recreational vehicle\nin an enclosed building; a vehicle and/or recreational vehicle on the premises of a business enterprise operated in a lawful\nplace and manner, when necessary to the operation of such business enterprise; or a vehicle and/or recreational vehicle in\nan appropriate storage place or depository maintained for impounded vehicles by the City.\n(2) If any wrecked, junked or partially dismantled vehicle and/or recreational vehicle or parts thereof has remained on any\nprivately owned premises for more than thirty (30) days, as determined by recorded observation or signed complaint, the\npolice department shall require the removal of such vehicle and/or recreational vehicle within ten (10) days, by written\nnotice personally served on the owner of the vehicle and/or recreational vehicle, or on the owner or agent of the owner of\nthe premises whereon is situated such vehicle and/or recreational vehicle, or sent by certified mail to either the owner of\nthe vehicle and/or recreational vehicle, at his/her last known address, or owner or agent of the premises whereon is\nsituated such vehicle and/or recreational vehicle. The vehicle and/or recreational vehicle or parts thereof must be removed\nfrom public view or adequately repaired within ten (10) days of the mailing of or personal service of the notice, unless a\nwritten request for a hearing is made to the City Manager during that time period. A vehicle and/or recreational vehicle or\nparts thereof moved onto the public right-of-way or onto other public or private property after service or mailing of the\nnotice, shall be subject to removal without further notice. Change in ownership of the vehicle and/or recreational vehicle\nor the real property where it is located, after service or mailing of the notice shall not necessitate the giving of any\nadditional notice prior to removal and impoundment of the vehicle and/or recreational vehicle by the City or at its\ndirection.\n(3) The notice referred to in this Section shall state that the vehicle and/or recreational vehicle must be removed from\npublic view or repaired within ten (10) days of the mailing or service of the notice, unless a hearing is requested in writing\nwithin the ten (10) day period. The notice shall indicate that failure to remove or repair the vehicle and/or recreational\nvehicle will result in it being impounded, and any expenses incurred by the City being assessed against the owner or\nhis/her property.\n(4) For the purposes of this Section, the tenant, occupant, or lessee of any premises shall be deemed the agent of the owner\nof such premises.\n(5) Any hearing must be requested in writing to the City Manager within ten (10) days after the date of mailing or service\nof the warning notice. If a written request is made for a hearing, a vehicle and/or recreational vehicle may not be\nimpounded by the City until a hearing has been held and a decision rendered.\n(6) Upon the failure, neglect or refusal or any owner or agent of the owner so notified, to properly dispose of such vehicle\nand/or recreational vehicle or parts thereof within the time limits herein set forth, unless a hearing has been requested,\nthe Police Department is authorized and empowered to remove the same at the expense of such owner or agent of the\nowner, which expenses shall include the cost of removal plus administrative costs of the City, not to exceed five percent\n(5%) of the cost of removal.\n(7) In case the owner or agent of such property shall fail to pay such bill within thirty (30) days after the same has been\nrendered, the Police Department shall report the same to the City Manager or his/her designee who shall assess the costs\nagainst the property in question. Such assessment shall constitute a perpetual, first and prior lien on the property\ninvolved. The City Manager or his/her designee shall certify to the County Treasurer the assessments which are not paid\nwithin twenty (20) days of the date of assessment. Ten percent (10%) of the amount shall be added to the assessment to\npay the cost of collection.\n(8) If a hearing is requested pursuant to this Section, the City Manager or his/her designee shall conduct a hearing as soon\nas practicable, at which time testimony and evidence may be presented relative to the propriety of impounding such\nvehicle and/or recreational vehicle, and the City Manager or his/her designee shall issue a decision following the hearing\nas to whether the owner or other person in charge of or in control of any private property, or the owner of any vehicle\nand/or recreational vehicle has permitted or allowed such wrecked, junked or partially dismantled vehicle and/or\nrecreational vehicle or parts thereof to remain on private property longer that thirty (30) days pursuant to this Section,\nand whether such vehicle and/or recreational vehicle or parts thereof, is subject to impoundment. The fact that such\nproperty has changed owner, lessee or occupant, or that such vehicle and/or recreational vehicle has been moved to\nanother location within the City within public view, other than a licensed junkyard or garage, shall not be a bar to\nimpoundment. If the City Manager and his/her designee determines that such vehicle and/or recreational vehicle is\nsubject to impoundment, the agent of the owner of the property, or the vehicle and/or recreational vehicle owner shall\nhave twenty-four (24) hours after receipt of the written decision, to remove the vehicle and/or recreational vehicle from\npublic view or adequately repair the vehicle and/or recreational vehicle. Should he/she fail to remove or repair such\nvehicle and/or recreational vehicle, the Police Department is empowered to remove such vehicle and/or recreational\nvehicle at the expense of the owner, plus administrative expenses of the City.\n(9) A Municipal Court Summons and Complaint for violation of this Section may be issued after either completion of the\nadministrative hearing and rendering of the hearing officer's decision, if a hearing has been requested, and the hearing\nofficer has determined that the owner of other person in charge or in control of any private property, or the owner of any\nvehicle and/or recreational vehicle has permitted or allowed such wrecked, junked or partially dismantled vehicle and/or\nrecreational vehicle or parts thereof to remain on such private property longer than thirty (30) days, or expiration of the\nperiod during which a hearing may be requested, if no hearing has been requested. Such summons and Complaint may be\nissued to either the owner or agent of the owner of the premises on which the vehicle and/or recreational vehicle or parts\nthereof, is located, or to the vehicle and/or recreational vehicle owner, or all of them.\nSection 20-18.      Disposal of vehicles removed and impounded pursuant to this Article.    \n(1) If removal and impoundment of a vehicle and/or recreational vehicle is not effected by the Police Department, the\npolice officer shall cause removal and impoundment to be effected only by a private towing company which has been\nlicensed by the State Public Utilities Commission and carries adequate liability insurance to cover the cost of any damage\ninflicted on the vehicle and/or recreational vehicle during towing or storage. No vehicle and/or recreational vehicle may be\ntowed which has not first had its contents properly inventoried by a police officer or other official of the City.\n(2) Whenever a vehicle and/or recreational vehicle is impounded and ordered held pursuant to this Article, the Police\nDepartment shall notify the owner of record, if\nascertained, of the impoundment of such vehicle and/or recreational vehicle, and of the owner's and/or lienholder's\nopportunity to request a hearing to determine the validity of the impoundment.\n(3) Such notice shall be sent by United States mail to the owner of record, if ascertained, and any lienholder, if ascertained,\nwithin ten (10) working days of the receipt of the report from the Department of Motor Vehicles, and shall include the\nfollowing information:\n(a) The address and telephone number of the motor vehicle and/or recreational vehicle owner, if ascertained;\n(b) The location of storage of the motor vehicle and/or recreational vehicle;\n(c) The location from which the motor vehicle and/or recreational vehicle was towed;\n(d) The reason for which the vehicle and/or recreational vehicle was impounded;\n(e) A description of the motor vehicle and/or recreational vehicle, which shall include, if available, the make, model,\nlicense plate number, mileage and vehicle identification number.\n(f) That in order to obtain a hearing concerning the validity of the impoundment, the owner and/or lienholder must\nrequest such hearing in writing to the City Manager within ten (10) days after the date appearing on the notice, when\napplicable.\n(g) That unless the vehicle and/or recreational vehicle is claimed within thirty (30) calendar days from the date the\nnotice was sent as determined from the postmark on the notice, the vehicle and/or recreational vehicle shall be\nsubject to sale.\n(4) Any such hearing shall be conducted within a reasonable time after receipt of the owner's or lienholder's request, not to\nexceed ten (10) days after receipt of such request, unless the hearing is postponed to a later date at the owner's or\nlienholder's request. The granting of such request for postponement shall be at the discretion of the hearing officer. The\nfailure of the owner or lienholder to request a hearing or to attend a scheduled hearing shall satisfy the hearing\nrequirements of this Section.\n(5) The sole issue at the hearing shall be the legality of the impoundment of the motor vehicle and/or recreational vehicle.\nThe burden of proof shall be on the Trinidad Police Department to establish probable cause that one or more of the\ngrounds set forth in this Article exist for the impoundment.\n(6) If the hearing officer determines that the impoundment was invalid, the City of Trinidad shall be responsible for the\ncosts incurred in the towing and storage of the motor vehicle and/or recreational vehicle. If the hearing officer determines\nthat the impoundment was valid, and the vehicle and/or recreational vehicle is not reclaimed by the owner or lienholder\npursuant to State statute within thirty (30) days of the hearing officer’s decision, then unless such vehicle and/or\nrecreational vehicle is being held for evidence in a criminal case the owner could not legally reclaim such vehicle and/or\nrecreational vehicle during the thirty (30) day period, the vehicle and/or recreational vehicle shall be presumed to be\nabandoned and the provisions for sale and disposal of same set forth in C.R.S. 42-4-1806 shall apply.\n(7) Any motor vehicle and/or recreational vehicle owner who has been previously afforded an opportunity to request a pre-\nimpoundment hearing shall not be entitled to a post-impoundment hearing.\nARTICLE 4.  ADDITIONAL TRAFFIC REGULATIONS    \nSection 20-19.      Parking in freight loading zone.    \n   (1)  No person shall park a vehicle for any purpose or length of time other than for the expeditious unloading and delivery\nof pickup and loading of materials in any place officially marked as a freight loading zone during hours when the\nprovisions applicable to such zones are in effect. (Ord. 1532, eff., 5-18-96)   \n   (2) In no case shall the parking for loading and unloading of materials exceed thirty (30) minutes. (Ord. 1532, eff., 5-18-\n96)   \nSection 20-20.      Limitations on parking.    \n   No person shall park a vehicle at a location for a period of time greater than that permitted by   \n   official signs or during those hours in which parking is prohibited by official signs. (Ord. 1532, 20-20, 5-18-96)   \nSection 20-21.      Repealed.    (Ord. 1854, 6-27-08)   \nSection 20-22.      Registered owner liable for parking violations.    \n   The registered owner of any motor vehicle is liable for payment of a parking violation fine.  It is no defense to the\nprosecution of a parking violation, that at the time of the parking violation, the vehicle was in the care, custody or control\nof another person. (Ord. 1532, 20-22, 5-18-96)   \nSection 20-23.      Persons prohibited from restricting parking on public streets.     \n   (1)  No person shall place, maintain, or display upon or in view of any street or highway any unauthorized sign, signal,\nmarking or device which attempts to regulate, limit, restrict or prohibit the parking of any motor vehicle on or within any\npublic street or highway, nor shall any person, without lawful authority, in any other way attempt to regulate, limit,\nrestrict, or prohibit the parking of any motor vehicle on or within any public street or highway.(Ord. 1562, 5-31-97)   \n   (2)  Every such prohibited sign, signal or marking is declared to be a public nuisance, and the City is empowered to\nremove the same or cause it to be removed without notice. (Ord. 1562, 5-31-97)   \n   (3)  Any person who violates any provision of this Section shall be guilty of a Misdemeanor, and shall be subject to the\npenalties set forth in Section 1-8 of this Code. (Ord. 1562, 5-31-97)   \nSection 20-24       Parking not to obstruct traffic.    \n   No person shall park any vehicle upon a public street, alley, or highway in a manner or under such conditions as to leave\navailable less than twelve (12) feet of the width of the roadway for free movement of vehicular traffic. (Ord. 1725, eff., 6-13-\n03)   \nARTICLE 5. PARKING RESTRICTIONS FOR RECREATIONAL VEHICLES AND UTILITY TRAILERS    \nSection 20-25       Definitions.    \n   (1) “Commercial Vehicle” shall mean any vehicle having more than two axles, or any single commercial vehicle or\ncombination of said vehicles which exceed twenty feet (20’) in length, any single commercial vehicle or combination of\nsaid vehicles eighty-four inches (84”) or more in width, or any single commercial vehicle or combination of said vehicles\nhaving a manufacturer’s gross vehicle weight rating of ten thousand pounds (10,000#) or more.  A Commercial Vehicle\nincludes, but is not limited to, commercial delivery trucks, commercial vehicle hauling trailers, flatbed trucks, dump\ntrucks, stake-side trucks, semitrucks, semi tractors, semitrailers, tow trucks, contractor equipment and trucks and trailers,\ntrash or refuse trucks, transit mix concrete trucks, tank trucks, tank trailers, privately-owned school buses, and other such\nvehicles. (Ord. 3046, amended, eff., 8/26/22)\n   (2) “Recreational Vehicle” shall mean any vehicular type portable structure without permanent foundation, which can be\ntowed, hauled, or driven, and designed to serve as temporary living accommodations for recreational, camping, or travel\nuse, and including, but not limited to travel trailers, camping trailers, converted buses, and self-propelled motor homes.\n Excluded from this definition are passenger vehicles designed for everyday use, and stock vans customized as conversion\nvans. (Ord. 1725, eff., 6-13-03)   \n   (3) “Utility Trailer” shall mean a vehicle without motorized power, designed to be towed by a passenger automobile or\ntruck, but not designed for human occupancy, and which may included but not limited to a utility trailer, boat trailer,\nhorse trailer, snowmobile trailer, animal trailer, produce trailer, goods or commodity trailer. (Ord. 1725, eff., 6-13-03)   \nSection 20-26       Restricted areas and times.    \n   It shall be unlawful for any person to park or stand or to allow any recreational vehicle or utility trailer to park or stand\nupon any public street, highway, alley, or public right-of-way between any street and alley located within or adjacent to a\nlow density residential zone district, a medium density residential zone district, the historic preservation zone district, or a\nneighbor-hood service zone district, for a period of more than forty-eight (48) hours.\n   It shall be unlawful for any person to park or stand or to allow any commercial vehicle on any public or private property\nin any residential zone district except during the loading and unloading of such vehicle or while currently being used for\non-site construction work.  In addition, it shall be unlawful to store, park, or maintain any farm or construction equipment\nin any residential zone district.   (Ord. 3046, Sec. 20-26 amended, eff., 8/26/22)\nSection 20-27       School zones.    \n   It shall be unlawful to park a recreational vehicle, commercial vehicle, or utility trailer on a public street in a school zone\nwhen school is in session.  This restriction shall not apply to the parking of such vehicles for such time as it actually\nnecessary to loan or unload passengers. (Ord. 1725, eff., 6-13-03)   \nSection 20-28       Penalty for violation.    \n   Every person convicted of a violation of this Article shall be punished by a fine of not more than Three Hundred Dollars\n($300.00). (Ord. 1725, eff., 6-13-03)   \nARTICLE 6.  COMMERCIAL TRUCK TRAFFIC     \nSection 20-29.  Definitions.   \n  The following definitions shall apply in the interpretation and enforcement of this Article:  \n  (1)  Commercial Truck  means any motor vehicle having more than two axels, or any single commercial vehicle or\ncombination of said vehicles which exceed 20 feet in length, any single commercial vehicle or combination of said vehicles\n84 inches or more in width, or any single commercial vehicle or combination of said vehicles having a manufacturer’s\ngross vehicle weight rating or gross combination rating of 10,000 pounds or more designed or used primarily for the\ntransportation of property, including vehicles used for delivery purposes.  This definition excludes privately-owned\nrecreational vehicles, as defined in Section 20-25(2), and publicly owned mass transportation motor vehicles.  \n  (2)  Immediate area of operation  means a segment of a restricted route between successive  \n  intersecting streets, including any restricted route which provides the only practical access to that\n  segment of the restricted route.  \n   \n  (3)  Through truck travel  means operation of a truck without an origin or destination in the immediate area of operation.\n Origin or destination shall not include the residence of the owner, lessee or   operator of the truck.  \n  (4)  Truck route    means any street, highway, public way or portion thereof designated specifically for  the operation of\ncommercial trucks.  \nSection 20-30.  Designation of routes, maps.   \n       (1)   In accord with a City Council approved truck route plan, City Council shall have the authority to designate all or\nportions of those streets, highways, public ways and roadways upon which trucks       shall operate. The City Council shall\nhave the additional authority to restrict the operation of trucks upon streets, highways, public ways or portions thereof.\nSuch designation and restrictions shall be       made upon the recommendation of the Public Works Director and shall be\nbased on traffic engineering investigations and studies, public safety, environmental considerations, economic factors\naffecting trucking and the trucking industry, desires of the inhabitants and neighborhood characteristics of affected areas.  \n      \n   (2) Public Works shall maintain in the Public Works Office maps designating truck routes. Copies of the maps shall be\nmade available to trucking interests and the public through the Public Works       Office and/or the Police Department. Any\nchange to truck routes shall be published by the Public Works.               \n   (3) Public Works shall post with appropriate signs those routes that are restricted. Public Works may also post\ndesignated truck routes with appropriate signs. Truck route maps shall be made available to  all persons upon request. The\nposting of signs shall not be required for enforcement.  \n \nSection 20-31.   Operation of commercial trucks.   \n   (1)  Through truck travel shall be unlawful upon prohibited routes. It shall be unlawful for any person to operate or cause\nto be operated a commercial truck upon a prohibited route without an origin or destination in the immediate area of\noperation.   \n   (2)   Upon the designation of truck routes, it shall be unlawful for any person to operate or cause to be operated a\ncommercial truck upon any other street, highway or other public way. Commercial trucks may deviate from truck routes\nwhile traveling to or from a truck terminal, garage, place of repair, place of performing a service or place of loading or\nunloading, and may proceed from a destination not located upon a truck route to another destination without returning to\na truck route if to so return would unreasonably increase the distance to be traveled between destinations.   \n   (3)   Any person operating a commercial truck upon all or any portion of a street, highway, public way or roadway that is\nnot a truck route, or upon a prohibited route, shall have in the person's possession a log book, delivery slip or other\nevidence of the point of origin and destination to justify the presence of the vehicle upon the route. Failure to produce\nevidence upon request of a police officer shall be unlawful.   \n   (4)   The following   City streets within the limits of the City of Trinidad are hereby designated as truck routes:   \n    SH 12    \n    Commercial Street (Colorado Avenue to Elm Street)    \n    Linden Avenue (Goddard Avenue to Main Street)    \n    160 Bypass    \n    Goddard Avenue (I-25 to Nevada Avenue)    \n    Elm Street (Commercial Street to Maple Street)    \n    Plum Street (Elm Street to Commercial Street) \nSection 20-32.  Use of engine compression brake prohibited.    \n   Use of engine compression brakes within the corporate city limits of Trinidad shall be prohibited.           \nSection 20-33.  Penalty for violation.    \n   Every person convicted of a violation of this Article shall be punished by a fine of not more than Three Hundred Dollars\n($300.00).\n"
}