{
    "chapter": "Chapter 13 - Parks and Recreation",
    "content": "Chapter 13 - Parks and Recreation\nSections:\n13-1    Discharging firearms in Monument Lake Park not permitted.\n13-2    Public Parks, Property, and Trails – Hours Closed.\n13-3    Unauthorized vehicles in Public Parks prohibited.\n13-4    Penalty for violation.\n13-5    Rules and regulations for fishing in Central Park Lake.\nCHAPTER 13.  PARKS AND RECREATION.\nSection 13-1.  Discharging firearms in Monument Lake Park not permitted.\nNo person shall discharge any gun, fowling piece, pistol, revolver or firearm of any kind or description in or upon lands\nand premises owned by the City know as and called Monument Lake Park, which lands and premises are described as\nfollows:\nNE 1/4 of NE 1/4, SE 1/4 of NE 1/4, NE 1/4 of SE 1/4, SE 1/4 of SE 1/4, in Section 36, Twp. 32, South of Range 69 West;\nNE 1/4 of NE 1/4 of Section 1, Twp. 33, South of Range 69 West; NW 1/4 of NW 1/4, SW 1/4 NW 1/4, NW 1/4 SW 1/4, SW\n1/4 of SW 1/4, and that part of the SE 1/4 of SW 1/4 lying south of the Maxwell Land Grant line, all in Section 31, Twp. 32\nSouth, Range 68 West; NE 1/4 of NW 1/4, NW 1/4 of NW 1/4, Section 6, Twp. 33, South of Range 68 West; all in Las\nAnimas County, comprising 480 acres.  (Ord. 1958, Sec. 23-9.)\nCross reference :  As to prohibition against discharging firearms in City, see Section 16-23.\nSection 13-2. Public Parks, Property, and Trails – Hours Closed.\nIt shall be unlawful for any person to be within the bounds of any public park, public property, or public trail between the\nhours of 10:00 p.m. and 5:00 a.m. except as authorized by the City. (Ord. 2002, Sec. 13-2 repealed and reenacted, eff. 4-\n19-16)\nSection 13-3. Unauthorized vehicles in Public Parks prohibited.\nIt shall be unlawful for any person to ride or drive any horse, team, or other animal, motorcycle, automobile or other\nmotorized vehicles within the boundaries of any public park except as authorized by the City. (Ord. 2002, Sec. 13-3\nrepealed and reenacted, eff. 4-19-16)\nSection 13-4.     Penalty for violation.\nAny person who shall violate either Section 13-2 or Section 13-3 of this Code shall be subject to punishment as provided in\nSection 1-8 of this Code.\nSection 13-5.   Rules and regulations for fishing in Central Park Lake.\n(1)  Fishing is hereby permitted in Central Park Lake during daylight hours.\n(2)  Fishing by persons over the age of Sixteen (16) years of age at Central Park Lake is prohibited; except that\nhandicapped persons of any age requiring wheelchairs shall be permitted to fish in Central Park Lake. (Ord. 1534,\n7/13/96.)\n(3)  Persons over the age of Sixteen (16) years of age shall be permitted to assist any child Sixteen (16) years of age or\nyounger in fishing at Central Park Lake. (Ord. 1534, 7/13/96.)\n(4)  All fishing at Central Park Lake shall be from the shore line only.\n(5)  Any manager or officer of the Colorado Division of Wildlife shall be authorized to enforce the rules and regulations in\nthis Section and to issue summonses and complaints for any violations of this Section into Municipal Court.\n(6)  Any person who violates any of the provisions of this Section shall be subject to a fine not to exceed Three Hundred\n\nDollars ($300.00).\n(7)  Any manager or officer of the Colorado Division of Wildlife shall have the authority to enforce any State Statutes or\nRegulations pertaining to fishing at Central Park Lake.  (Ord. 1423, Sec. 1, 06/23/92.)\n"
}