{
    "chapter": "Chapter 5 - Buildings",
    "content": "Chapter 5 - Buildings\nARTICLE 1. IN GENERAL.\nSections:\n5-1.    International Building Code.\n5-2.    International Residential Code.\n5-3.    Reserved.\n5-4.    International Mechanical Code.\n5-5.    International Fuel Gas Code.\n5-6.    International Energy Conservation Code.\n5-7.    International Existing Building Code.\n5-8.    International Property Maintenance Code.\n5-9.    Reserved.\nARTICLE 2.  CONTRACTOR LICENSING.\n5-10.   Definitions, Classifications and Fees.\n5-11.   Testing.\n5-12.   Insurance Requirements.\n5-13.   Duties and Responsibilities of Licensee.\n5-14.   Suspension and Revocation of License.\n5-15.   Application Form and Contents.\n5-16 – 5-22  Reserved.\nARTICLE 3.  NON-CONFORMANCE\n5-23.        Reserved.\nARTICLE 4.  MEANS OF APPEAL\n5-24.        Board of Building Code Appeals and Means of Appeal.\n5-25.        Building Code Variance Petition.\nARTICLE 5.  VACANT PROPERTY REGISTRATION\n5-25.        Title, purpose and intent.\n5-26.        Definitions.\n5-27.        Registration required.\n5-28.        Fees.\n5-29.        Property maintenance obligations.\n5-30.        Inspections.\n5-31.        Unlawful conduct; penalties; enforcement.\n5-32.        Joint and several liability.\n5-33 – 5-44. Reserved.\nARTICLE 5.  ANTI-DILAPIDATION CODE\n5-45.        Title, purpose and intent.\n5-46.        Definitions.\n5-47.        Dilapidated Buildings.\n5-48.        Inspections.\n5-49.        Dilapidated Buildings prohibited.\n5-50.        Violations; penalties; enforcement.\n5-51 – 5-54. Reserved.\nARTICLE 6. - ADMINISTRATIVE ENFORCEMENT\n5-55.        Purpose.\n5-56.        Definitions.\n5-57.        Notice of violation.\n5-58.        Administrative citations – general provisions.\n5-59.        Issuance of administrative citation.\n5-60.        Administrative citation – contents.\n5-61.        Appeals – notice and scheduling.\n5-62.        Conduct of appeals hearings.\n5-63.        Failure to obey subpoena.\n\nSchedule of Permit Fees\nTotal Valuation:\nFee:\n$1.00 to $500.00\n$24.00\n$501.00 to\n$2,000.00\n$24.00 for the first $500.00; plus $3.00 for each additional $100.00 or\nfraction thereof, to and including $2,000.00\n$2,001.00 to\n$40,000.00\n$69.00 for the first $2,000.00; plus $11.00 for each additional $1,000.00\nor fraction thereof, to and including $40,000.00\n$40,001.00 to\n$100,000.00\n$487.00 for the first $40,000.00; plus $9.00 for each additional\n$1,000.00 or fraction thereof, to and including $100,000.00\n$100,001.00 to\n$500,000.00\n$1,027.00 for the first $100,000.00; plus $7.00 for each additional\n$1,000.00 or fraction thereof, to and including $500,000.00\n$500,001.00 to\n$1,000,000.00\n$3,827.00 for the first $500,000.00; plus $5.00 for each additional\n$1,000.00 or fraction thereof, to and including $1,000,000.00\n$1,000,001.00 to\n$5,000,000.00\n$6,327.00 for the first $1,000,000.00; plus $3.00 for each additional\n$1,000.00 or fraction thereof, to and including $5,000,000.00\n$5,000,001.00 and\nup\n$18,327 for the first $5,000,000.00; plus $1.00 for each additional\n$1,000.00 or fraction thereof\nOther Inspections and Fees:\n1. Plan review fee......................Sixty five percent (65%) of the permit fee2. \n2. Inspections outside of normal business hours.............  $50.00 per hour* (Minimum charge –\ntwo hours)\n3.  Reinspection fees assessed under provisions of IBC § 108.4..........................  $50.00 per hour*\n4.  Inspections for which no fee is specifically indicated............................  $50.00 per hour*\n5.  Additional plan review required by changes, additions, or revisions to plans\n……..............$50.00 per hour*\n6.  For use of outside consultants for plan checking and inspections, or both..... …….......…...……\nActual Cost**\n7.  For issuance of each temporary Certificate of Occupancy ................................$750.00***\n8.  Administrative Fees...........................  $150.00 min  ($50.00 per hour thereafter)\nNOTATION:  Reference City of Trinidad Municipal Code Chapter 7, Article 3, Section 7-23\nregarding imposition of Use Tax.\n5-64.        Failure to attend administrative appeal.\n5-65.        Failure to comply with administrative enforcement order.\n5-66.        Penalties assessed.\n5-67.        Failure to pay fines.\nCHAPTER 5.  BUILDINGS\n(Ord. 1949, Chapter 5, repealed and reenacted eff. 12/17/13)\nARTICLE 1.  IN GENERAL.\n(Ord. 2061, Article 1, repealed and reenacted eff. 7-13-18)\nSection 5-1.  International Building Code.\n1. The International Building Code, 2018 Edition, including Appendix Chapter C\n(“Group U Agricultural Buildings”) and J (\"Grading\"), as published by the International Code Council, 500 New Jersey\nAvenue, NW, 6th Floor, Washington, DC 20001 (headquarters), is hereby adopted by reference as the Building Code of the\nCity of Trinidad, Colorado, as if fully set forth in this ordinance, together with the additions, insertions, and changes\nprescribed in this Section. At least one (1) copy of said International Building Code, 2018 Edition, shall remain on file in\nthe Office of the City Clerk and open to public inspection.\n2. The following sections of the International Building Code, 2018 Edition (\"IBC\"), are hereby revised:\na. Amend IBC § 101.1, Title, as follows: insert \"the City of Trinidad, Colorado\" where indicated.\nb. Amend IBC § 109.2, Schedule of permit fees, as follows: insert the following Schedule of Permit Fees:\nc. Amend IBC § 114.4,\n*  Or the total hourly cost to the City, whichever is greatest.  The cost shall include supervision,\noverhead, equipment, hourly wages, and fringe benefits of the employees involved.\n**  Actual costs include administrative and overhead costs.\n***  $500.00 shall be refunded if a Certificate of Occupancy is issued prior to the expiration of the\nTemporary Certificate of Occupancy.\nGROUND\nSNOW\nLOAD \nWIND DESIGN \nSEISMIC \nDESIGN \nCATEGORY \nSUBJECT TO DAMAGE\nFROM \nWINTER\nDESIGN\nTEMP \nICE BARIER\nUNDERLAYMENT\nREQUIRED \nFLOOD\nHAZARDS \nAIR\nFREEZ\nINDEX\nSpeed(mph) \nTopographic\neffects \nSpecial\nwind\nregion \nWind\nborne\ndebris\nzone \nWeathering \nFrost\nline\ndepth \nTermite \n30 \n115 \nNO \nNO \nNO \nB \nSevere \n32” \nSlight to\nmoderate \n6 \nYes \nAdopted\n5/2/98\nFIRM\n080107\n0001 B\n4/3/84 \n597 \nMANUAL J DESIGN CRITERIA \nElevation \nLatitude \nWinter\nheating  Summer cooling \nAltitude\ncorrection\nfactor \nIndoor design\ntemperature \nDesign  \ntemperature  \ncooling \nHeating \ntemperature  \ndifference \n5761 \nNorth 37  6 \n90 \n.82 \n70 \n75 \n64 \nCooling temperature\ndifference \nWind\nvelocity\nheating \nWind\nvelocity\ncooling \nCoincident wet bulb \nDaily range  Winter humidity  Summer humidity \n-- \n15 \n15 \n7.5 \n60 \nH \n30% \n50% \n-- \nEXTERIOR WALL\nELEMENT\nMINIMUM FIRE\nRESISTANCE RATING\nMINIMUM FIRE SEPARATION\nDISTANCE\nWalls\n(Fire-resistance\nrated)\n1 hour with exposure from\nboth sides\n0 feet\n(Not fire-resistance\nrated)\n0 hours\n5 feet \nProjections\n(Fire-resistance\nrated)\n1 hour on the underside\n2 feet\n(Not fire-resistance\nrated)\n0 hours\n5 feet \nOpenings\nNot allowed\nNot applicable\n< 3 feet\n25% maximum of\nwall area\n0 hours\n>= 3 feet and < 5 feet\n \n0 hours\n>= 5 feet\nViolation penalties, to\nread: Any person who\nviolates a provision of\nthis code or fails to\ncomply with any of the\nrequirements thereof, or\nwho erects, constructs,\nalters, or repairs a\nbuilding or structure in violation of the approved construction documents or directive of the building official, or of a\npermit or certificate issued under the provisions of this code, shall be subject to penalties as prescribed in Chapter 1,\nSections 1-8 and 1-9 of the Code of the City of Trinidad, Colorado.\nd. Amend IBC § 115.3, Unlawful continuance, to read: Any person who shall continue any work after having been served\nwith a stop work order, except such work as that person is directed to perform to remove a violation or unsafe condition,\nshall be subject to penalties as prescribed in Chapter 1, Sections 1-8 and 1-9  of the Code of the City of Trinidad, Colorado.\nf. Amend IBC § 1612.3, Establishment of flood hazard areas, as follows: insert name of jurisdiction as \"the City of Trinidad,\nColorado,\" and insert \"April 3, 1984,\" as the date of issuance.\nTABLE R302.1\nEXTERIOR WALLS\n1\n2\nPenetrations All\nComply with IRC § R302.4\n< 3 feet\nNone required\n>= 3 feet\nFee Schedule\nValuation of Work:\nPermit Fee:\nNot more than\n$2,000.00\n$30.00\nMore than $2,000.00\n$30.00 plus, $10.00 per each $1,000.00\nvaluation or fraction thereof.\n1. Fire separation\ndistance of three (3) feet\ncan be used if the\nexterior wall cladding and trim are of noncombustible material. (Refer to IRC § R202 for a definition of \"noncombustible\nmaterial.\")\n2. Fire separation distance of three (3) feet can be used if the soffit cladding and facia board are of noncombustible\nmaterial. (Refer to IRC § R202 for a definition of \"noncombustible material.\")\ng. Amend IRC § R313.2, One- and two-family dwellings automatic fire systems, to delete the exception and to read: An\nautomatic residential fire sprinkler system may be installed in one- and two-family dwellings.\nh. Amend IRC R315.2.2, Alterations, repairs and additions, by deleting exception 2.\ni. Amend IRC § R315.3, Location, to read:  Carbon monoxide alarms in dwelling units shall be installed outside of each\nseparate sleeping area within 15’ of the bedroom doors. Where a fuel-burning appliance is located within a bedroom or its\nattached bathroom, a carbon monoxide alarm shall be installed within the bedroom.\nj. Delete IRC Chapter 11, entitled \"ENERGY EFFICIENCY,\" in its entirety. Please refer to the International Energy\nConservation Code, adopted in Section 5-12 of this Article, for energy conservation requirements.\nk. Amend IRC § P2603.5.1, Sewer depth, as follows: insert \"thirty-two (32)\" in two locations.\nSection 5-3. Reserved.\nSection 5-4. International Mechanical Code.\n1. The International Mechanical Code, 2018 Edition, including Appendix A (\"Chimney Connector Pass-Throughs\"), as\npublished by the International Code Council, 500 New Jersey Avenue, NW, 6th Floor, Washington, DC 20001\n(headquarters), is hereby adopted by reference as the Mechanical Code of the City of Trinidad, Colorado, as if fully set\nforth in this ordinance, together with the additions, insertions, and changes prescribed in this Section. At least one (1) copy\nof said International Mechanical Code, 2018 Edition, shall remain on file in the Office of the City Clerk and open to public\ninspection.\n2. The following sections of the International Mechanical Code, 2018 Edition (\"IMC\"), are hereby revised:\na. Amend IMC§ 101.1, Title, as follows: insert \"the City of Trinidad, Colorado\" where indicated.\nb. Amend IMC § 106.5.2, Fee schedule, as follows: insert the following fee schedule:\nc. Amend IMC§ 106.5.3, Fee refunds, as follows: insert \"fifty percent (50%)\" as the specified percentage in both\nlocations.\nd. Amend IMC§ 108.4, Violation penalties, to read: Persons who shall violate a provision of this code or shall fail to\ncomply with any of the requirements thereof, or who shall erect, install, alter, or repair mechanical work in violation\nof the approved construction documents or directive of the code official, or of a permit or certificate issued under the\nprovisions of this code, shall be subject to penalties as prescribed in Chapter 1, Sections 1-8 and 1-9 of the Code of the\nCity of Trinidad, Colorado.\ne. Amend IMC § 108.5, Stop work orders, to read: Upon notice from the code official that mechanical work is being\ndone contrary to the provisions of this code or in a dangerous or unsafe manner, such work shall immediately cease.\nSuch notice shall be in writing and shall be given to the owner of the property, or to the owner's agent, or to the\nperson doing the work. The notice shall state the conditions under which work is authorized to resume. Where an\nemergency exists, the code official shall not be required to give a written notice prior to stopping the work. Any\nperson who shall continue any work on the system after having been served with a stop work order, except such work\nas that person is directed to perform to remove a violation or unsafe condition, shall be liable for a fine of not less\nthan Three Hundred Dollars ($300.00) nor more than Two Thousand Six Hundred Fifty ($2,650.00).\nf. Amend IMC § 109.1, Application for appeal, to read: Any person shall have the right to appeal an order, decision, or\ndetermination of the code official to the board of appeals. An application for appeal shall be based on a claim that the\ntrue intent of this code or the rules legally adopted thereunder have been incorrectly interpreted, the provisions of\nthis code do not fully apply, or an equally good or better form of construction is proposed. The application shall be\nfiled no later than fifteen (15) days following the issuance of the order, decision, or determination.\ng. Delete IMC§§ 109.2 through 109.6, regarding membership and procedures of the board of appeals. \nSection 5-5. International Fuel Gas Code.\nFee Schedule\nValuation of Work:\nPermit Fee:\nNot more than $2,000.00\n$30.00\nMore than $2,000.00\n$30.00 plus $10.00 per each\n$1,000.00 valuation or\nfraction thereof.\n1. The International Fuel Gas Code, 2018 Edition, as published by the International Code Council, 500 New Jersey\nAvenue, NW, 6th Floor, Washington, DC 20001 (headquarters), is hereby adopted by reference as the Fuel Gas Code of the\nCity of Trinidad, Colorado, as if fully set forth in this ordinance, together with the additions, insertions, and changes\nprescribed in this Section. At least one (1) copy of said International Fuel Gas Code, 2018 Edition, shall remain on file in\nthe Office of the City Clerk and open to public inspection.\n2. The following sections of the International Fuel Gas Code, 2018 Edition (\"IFGC\"), are hereby revised:\na. Amend IFGC § 101.1, Title, as follows: insert ''the City of Trinidad, Colorado\" where indicated.\nb. Amend IFGC § 106.1, Where required, to read: An owner, authorized agent, or contractor who desires to erect,\ninstall, enlarge, alter, repair, remove, convert, or replace an installation regulated by this code, or to cause such\nwork to be done, shall first make application to the code official and obtain the required permit for the work;\nprovided, however, that such a permit shall only be required from the City of Trinidad, Colorado, if the City, rather\nthan the State of Colorado, is performing fuel gas inspections. Exception: Where appliance and equipment\nreplacements and repairs are required to be performed in an emergency situation, the permit application shall be\nsubmitted within the City's next working business day.\nc. Amend IFGC § 106.6.2 Fee schedule, to read: The fees for all fuel gas work requiring a permit from the City of\nTrinidad shall be as indicated in the following schedule:\nd. Amend IFGC § 106.6.3, Fee refunds, as follows: insert \"fifty percent (50%)\" as the specified percentage in both\nlocations.\ne. Amend IFGC § 108.4, Violation penalties, to read: Persons who shall violate a provision of this code, fail to comply\nwith any of the requirements thereof, or erect, install, alter, or repair work in violation of the approved construction\ndocuments or directive of the code official, or of a permit or certificate issued under the provisions of this code, shall\nbe subject to penalties as prescribed in Chapter 1, Sections 1-8 and 1-9 of the Code of the City of Trinidad, Colorado.\ne. Amend IFGC § 108.5, Stop work orders, to read: Upon notice from the code official that work is being done\ncontrary to the provisions of this code or in a dangerous or unsafe manner, such work shall immediately cease. Such\nnotice shall be in writing and shall be given to the owner of the property, the owner's agent, or the person doing the\nwork. The notice shall state the conditions under which work is authorized to resume. Where an emergency exists,\nthe code official shall not be required to give a written notice prior to stopping the work. Any person who shall\ncontinue any work on the system after having been served with a stop work order, except such work as that person is\ndirected to perform to remove a violation or unsafe condition, shall be subject to penalties as prescribed in Chapter 1,\nSections 1-8 and 1-9 of the Code of the City of Trinidad, Colorado.\nf. Amend IFGC § 109.1, Application for appeal, to read: Any person shall have the right to appeal an order, decision,\nor determination of the code official to the board of appeals. An application for appeal shall be based on a claim that\nthe true intent of this code or the rules legally adopted thereunder have been incorrectly interpreted, the provisions\nof this code do not fully apply, or an equally good or better form of construction is proposed. The application shall be\nfiled no later than fifteen (15) days following the issuance of the order, decision, or determination.\nf. Delete IFGC §§ 109.2 through 109.6, regarding membership and procedures of the board of appeals\nSection 5-6. International Energy Conservation Code.\n1. The International Energy Conservation Code, 2018 Edition, as published by the International Code Council, 500 New\nJersey Avenue, NW, 6th Floor, Washington, DC 20001 (headquarters), is hereby adopted by reference as the Energy\nConservation Code of the City of Trinidad, Colorado, as if fully set forth in this ordinance, together with the additions,\ninsertions, and changes prescribed in this Section. At least one (1) copy of said International Energy Conservation Code,\n2018 Edition, shall remain on file in the Office of the City Clerk and open to public inspection.\n2. The following sections of the International Energy Conservation Code, 2018 Edition (\"IECC\"), are hereby revised:\na. Amend IECC § C101.1 and R101.1, Title, as follows: insert ''the City of Trinidad, Colorado\" where indicated.\nb. Amend IECC § C108.4 and R108.4, Failure to comply, to read: Any person who shall continue any work after having\nbeen served with a stop work order, except such work as that person is directed to perform to remove a violation or\nunsafe condition, shall be subject to penalties as prescribed in Chapter 1, Sections 1-8 and 1-9 of the Code of the\nCity of Trinidad, Colorado.\nc. Delete IECC § C103.6.3 Systems operation control in its entirety.\nd. Amend IECC § C403.6.1 Variable air volume and multiple-zone systems, #1 and #2 to add “Direct Digital Control”\nin front of the letters DDC to read: …for systems with Direct Digital Control (DDC)…\ne. Amend IECC § R402.4.1.2 Testing to read: The building or dwelling unit shall be tested and verified as having an\nair leakage rate not exceeding five air changes per hour or 0.30 cubic feet per minute for multi-family units and not\nexceeding three air changes per hour or 0.24 cubic feet per minute for all other residential buildings and dwelling\nunits.  (remainder of section unchanged).\nf. Delete IECC §§ C404.5 through C404.5.2.1 in their entirety. (Amended Ord. 2073, eff. 3/15/19)\nSection 5-7. International Existing Building Code.\n1. The International Existing Building Code, 2018 Edition, as published by the International Code Council, 500 New Jersey\nAvenue, NW, 6th Floor, Washington, DC 20001 (headquarters), is hereby adopted by reference as the Existing Building\nCode of the City of Trinidad, Colorado, as if fully set forth in this ordinance, together with the additions, insertions, and\nchanges prescribed in this Section. At least one (1) copy of said International Existing Building Code, 2018 Edition, shall\nremain on file in the Office of the City Clerk and open to public inspection.\n2. The following sections of the International Existing Building Code, 2018 Edition (\"IEBC\"), are hereby revised:\na. Amend IEBC § 101.1, Title, as follows: insert \"the City of Trinidad, Colorado\" where indicated.\nb. Amend IEBC § 113.4, Violation penalties, to read: Any person who violates a provision of this code or who fails to\ncomply with any of the requirements thereof, or who repairs, alters, or changes the occupancy of a building or\nstructure in violation of the approved construction documents or directive of the code official, or of a permit or\ncertificate issued under the provisions of this code, shall be subject to penalties as prescribed in Chapter 1, Sections\n1-8 and 1-9 of the Code of the City of Trinidad, Colorado.\nc. Amend IEBC § 114.3, Unlawful continuance, to read: Any person who shall continue any work after having been\nserved with a stop work order, except such work as that person is directed to perform to remove a violation or\nunsafe condition, shall be liable for a fine of not less than Three Hundred Dollars ($300.00) nor more than Two\nThousand Six Hundred Fifty ($2,650.00).\nd. Add to IEBC § 106.2.7. Phased Construction, (only for existing and historic structures within the city limits) as\nfollows:\ni. A Colorado licensed design professional will do an assessment of the building or structure which will be\nprovided to the Building Official for review to ascertain the current type of construction and structural\nadequacy.\nii. A building may use a Phased approach to a remodel project only if complete, stamped plans for that\nphase and the location/description of future phases including intended occupancy are provided to and\napproved by the Building Official prior to the initiation of the project. \nA Phased approach plan submittal shall include:\nA code analysis of all intended occupancies based on construction type.\nConstruction documents shall be of sufficient clarity to indicate the location, nature and extent of\nthe work proposed and show in detail that it will conform to the provisions of this code and relevant\nlaws, ordinances, rules and regulations, as determined by the code official. The work areas shall be\nshown along with fire protection system(s) shop drawings, means of egress, exterior wall envelope,\ninterior environment and site plan.\nSection 5-8. International Property Maintenance Code.\n1. The International Property Maintenance Code, 2018 Edition, including Appendix Chapter   A (\"Boarding Standard\"), as\npublished by the International Code Council, 500 New Jersey Avenue NW, 6th Floor, Washington, DC 20001\n(headquarters), is hereby adopted by reference as the Property Maintenance Code of the City of Trinidad, Colorado, as if\nfully set forth in this ordinance, together with the additions, insertions, deletions, and changes prescribed in this Section.\nAt least one (1) copy of said International Property Maintenance Code, 2018 Edition, shall remain on file in the Office of\nthe City Clerk and open to public inspection.\n2. The following sections of the International Property Maintenance Code, 2018 Edition (\"IPMC\"), are hereby revised:\na. Amend IPMC § 101.1, Title, as follows: insert \"the City of Trinidad, Colorado\" where indicated.\nb. Amend IPMC § 103.5, Fees, as follows: See Building Permit Fees, Section 5-1(2)(b).\nc. Amend IPMC § 106.4, Violation penalties, to read: Any person who shall violate a provision of this code, or fail to\ncomply therewith, or with any of the requirements thereof, shall be subject to penalties as prescribed in Chapter 1,\nSections 1-8 and 1-9 of the Code of the City of Trinidad, Colorado.\nd. Amend IPMC § 111.1, Application for appeal, to read: Any person directly affected by an order, decision, or\ndetermination of the code official or a notice or order issued under this code shall have the right to appeal to the\nboard of appeals, provided that a written application for appeal is filed no later than fifteen (15) days following the\nissuance of the order, decision, or determination.  An application for appeal shall be based on a claim that the true\nintent of this code or the rules legally adopted thereunder have been incorrectly interpreted, the provisions of this\ncode do not fully apply, or the requirements of this code are adequately satisfied by other means.\ne. Delete IPMC §§ 111.2 through 111.6, regarding membership and procedures of   the board of appeals.\nf. Amend IPMC § 112.4, Failure to comply, to read: Any person who shall continue any work after having been served\nwith a stop work order, except such work as that person is directed to perform to remove a violation or unsafe\ncondition, shall be subject to penalties as prescribed in Chapter 1, Sections 1-8 and 1-9 of the Code of the City of\nTrinidad, Colorado.\ng. Amend IPMC § 302.4, Weeds, as follows: insert \"six inches (6\").\"\nh. Delete IPMC § 304.14, Insect screens.\ni. Amend IPMC § 602.3, Heat supply, as follows: insert \"January 1 to December 31.\"\nj. Amend IPMC § 602.4, Occupiable work spaces, as follows: insert \"January 1 to December 31.\"\nSection 5-9  Reserved.\nARTICLE 2. CONTRACTOR LICENSING.\n(Ord. 2061, Article 2, repealed and reenacted, eff. 7-13-18)\nSection 5-10. Definitions, Classifications and Fees.\n1. Contractor. Contractor means a person who supervises himself or herself, his or her firm or one (1) or more trades or\nsubcontractors, and who for any compensation undertakes any landscaping, construction, addition, alteration, repair,\ndemolition, removal or moving of any building, structure or utility. A resident homeowner shall not be required to obtain a\ncontractor's license for any landscaping, construction, addition, alteration or repair of the homeowner's occupied\nresidence, or a building or structure accessory to such residence, provided that the homeowner shall first assume all duties\nand responsibilities of a contractor as set forth in this Section by executing a form furnished by the Chief Building Official\npursuant to which the homeowner agrees to assume all duties and responsibilities.\n2. Classification.\na. Contractor A. A Contractor A license is authorized to work with respect to multi-unit residential buildings, office\nbuildings, commercial buildings, tenant finish and alterations thereto and any work authorized under Contractor B,\nC and D licenses. This license covers all buildings including those three (3) stories and above. Requires proof of ICC\ntesting.\nb. Contractor B. A Contractor B license is authorized to work with respect to multi-unit residential buildings, office\nbuildings, commercial buildings, tenant finish and alterations thereto and any work authorized under Contractor C\nand D licenses. This license covers buildings under three (3) stories or less. Requires proof of ICC testing.\nc. Contractor C. A Contractor C license is authorized to work with respect to detached single-family residential\nbuildings and alterations thereto and any work authorized under Contractor D license. Requires proof of ICC\ntesting.\nd. Contractor D. A Contractor D license is authorized to work as a single trade only i.e. home repair, siding, plastering,\nsheetrock installation, excavation, concrete work not in a city right-of-way. No proof of ICC testing required.\ni. Plumbing and electrical contractors fall under D licensing but because they are required to hold a State\nMasters License are not required to show proof of ICC testing.\nii. Mechanical and roofing contractors fall under D licensing but are required to show proof of lCC testing.\n3. Fees.    Contractor's licenses shall be issued for a calendar year. The annual license fee shall be as stated below unless\namended by resolution of the City Council in accordance with the licensing classifications as set forth above [Section 5-\n10(2)]. In addition to the license fee, there is a processing/application fee for new applicants in the amount of $50.00.\na. Contractor A - $150.00\nb. Contractor B - $125.00\nc. Contractor C - $100.00\nd. Contractor D - $75.00 for each license type i.e. roofing and stucco= $150.00\ne. License fees are not refundable. Any fee paid under this Section shall not be refunded for any reason after the\nlicense has been issued.\n4. Violations. A fine as prescribed in Chapter 1, Sections 1-8 and 1-9 of the Code of the City of Trinidad, Colorado shall be\nassessed to the following:\na. Any contractor or subcontractor working within the City limits without possessing a current contractor's license;\nand\nb. Any contractor or subcontractor performing work outside the scope of their license.\nSection 5-11. Testing.\nICC Standardized Contractor Exams. Contractors are required to successfully pass the ICC Contractor Exam. The City and\nits citizens benefit from such commonality having a solid foundation upon which to issue licenses to practice.\nSection 5-12. Insurance Requirements.\n1. The City of Trinidad shall be identified as the Certificate Holder on insurance certificates. Every contractor shall procure\nworkers' compensation coverage as required by state law and general liability coverage with the following minimum limits:\na. General Aggregate: two million dollars ($2.000.000.00).\nb. Products, completed operations: two million dollars ($2,000,000.00).\nc. Personal and advertising injury: one million dollars ($1,000,000.00).\nd. Each occurrence: one million dollars ($1,000,000.00).\ne. A license and permit bond shall be procured for a minimum of $5,000 for all new contractor licenses and any\nrevoked/suspended licensees seeking reinstatement.\n2. No contractor's license shall be issued under this Article until the following documents are filed with the Chief Building\nOfficial:\na. A statement or certificate signed by an authorized agent of an insurance company licensed to do business in the\nState, stating that a policy or policies have been issued to the applicant with the coverage amounts set forth in\nSubsection (1) hereof, and including the effective date and expiration date of the policy or policies; and\nb. A copy of an endorsement to the policy requiring at least ten (10) days' prior written notice to the Chief Building\nOfficial of cancellation of the policy for any reason.\n3. In the event of cancellation of any policy required by this Section, the Chief Building Official shall immediately suspend\nthe contractor's license. The license shall be reinstated when the licensee furnishes the documentation required by\nSubsection (2) hereof.\nSection 5-13. Duties and Responsibilities of Licensee.\n1. All licensees under this Article shall be responsible for the following:\na. All work covered by his/her permit, whether or not such work is done directly by the licensee or his/her employees\nor subcontractors. Subcontractors are required to be licensed with the City even if they are working under the\nsupervision of a licensed contractor.\nb. All funds or property received by him/her for completion of a specific contract or for a specific purpose.\nc. Obtaining any required permits for himself/herself and any subcontractor under his/her supervision.\nd. Safety measures and equipment to protect workers and the public in compliance with applicable federal and state\nlaws.\ne. Compliance with all applicable City ordinances, codes and regulations.\nf. Constructing any building or structure in substantial compliance with the drawings and specifications approved by\nthe Chief Building Official and the permit issued for the same, unless changes are approved by the Chief Building\nOfficial.\ng. Completing all work authorized by the permit unless there is good cause for the non-completion of the work.\nh. Obtaining inspection services where required by this Chapter and any technical code.\ni. Paying any fee assessed under the authority of this Code or any technical codes.\nj. Obeying any order or notice issued pursuant to this Code or any technical code.\nk. Presenting his/her license when requested by the Chief Building Official.\nl. Maintaining workers' compensation and liability insurance as required by Section 5-12.\nSection 5-14. Suspension and Revocation of License.\n1. The Chief Building Official may suspend or revoke a license for any of the following:\na. Failure to comply with any of the duties and responsibilities set forth in Section 5-13.\nb. Using a contractor's license to obtain a permit required under this code for any other person, corporation or legal\nentity.\nc. Violating any provisions of the Trinidad Building Code including any codes which are adopted by reference.\nd. Failure to reveal any material fact in the application for a contractor's license or permit, or the supplying of\ninformation which is untrue or misleading as to any material fact in the application for a contractor's license or\npermit.\ne. Failure to obtain a proper permit for any work for which a permit is required.\nf. Receipt of three (3) or more written verified complaints.\n2. Upon written notification of revocation or suspension of license, the contractor shall have the right to appeal their case\nby oral and documentary evidence, to submit rebuttal evidence, and to conduct such cross-examination as may be required\nfor a full and true disclosure of the facts to the Board of Building Code Appeals.\nSuspension or revocation of a contractor's license shall not be construed to release the contractor from liabilities and\nobligations of completing his contract. During the period prior to the hearing before the Board of Building Code Appeals,\nthe contractor shall not be allowed to submit an application for any other projects.\n3. The Board of Building Code Appeals (BOBCA) may reinstate a license for any contractor whose license has been\nrevoked, provided a majority of the BOBCA votes in favor of such reinstatement for such reason as the BOBCA may deem\nsufficient. In such case where the contractor's license has been revoked and the contractor is petitioning the BOBCA for\nreinstatement, the petitioner shall follow the established policies for requesting such hearing and pay all applicable fees.\nSection 5-15. Application Form and Contents.\n1. Along with the application, proof of ICC testing (if required) and certificates of insurance listing the City of Trinidad as\nthe Certificate Holder must be provided. An application for a contractor's license shall be on a form furnished by the City,\nshall be filed with the Chief Building Official and shall contain the following information under oath:\na. Correct business contact information.\nb. ICC testing information.\nc. Insurance carrier information.\nd. Business references.\ne. Signature, title and date of person making oath of accuracy.\nSections 5-16 through 5-22 RESERVED. (Ord. 2061, eff. 7-13-18)\nARTICLE 3.  NON-CONFORMANCE\nSection 5-23.  Reserved. (Ord. 1976, eff. 6-26-15)\nARTICLE 4.  MEANS OF APPEAL\nSection 5-24.  Board of Building Code Appeals and Means of Appeal.\n(1) Application for appeal. Any person directly affected by a decision of the code official or a notice or order issued\nunder this code shall have the right to appeal to the board of appeals, provided that a written application for appeal is filed\nwithin fifteen (15) days after the day the decision, notice or order was served.  An application for appeal shall be based on a\nclaim that the true intent of this code or the rules legally adopted thereunder have been incorrectly interpreted, the\nprovisions of this code do not fully apply, or the requirements of this code are adequately satisfied by other means.  The\nBoard may only rule on the code interpretation of the CBO.\n(2) Membership of board. The board of appeals shall consist of a minimum of three members who are qualified by\nexperience and training to pass on matters pertaining to property maintenance and who are not employees of the\njurisdiction.  The board shall be appointed by the City Council, and shall serve staggered and overlapping two-year terms.\n(a) Alternate Members. The City Council shall appoint two or more alternate members who shall be called by the\nboard chairman to hear appeals during the absence or disqualification of a member.  Alternate members shall\npossess the qualifications required for board membership.\n(b) Chairperson. The board shall annually select one of its members to serve as chairperson.\n(c) Disqualification of member. A member shall not hear an appeal in which that member has a personal,\nprofessional or financial interest.\n(d) Secretary. The chief administrative officer shall designate a qualified person to serve as secretary to the board.\n The secretary shall file a detailed record of all proceed ings in the office of the chief administrative officer.\n(e) Compensation of members. Compensation of members shall be determined by law.\n(3) Notice of meeting. The board shall meet upon notice from the chairperson, within 20 days of the filing of an appeal,\nor at stated periodic meetings.\n(4) Open hearing. All hearings before the board shall be open to the public.  The appellant, the appellant’s\nrepresentative, the code official and any person whose interests are affected shall be given an opportunity to be heard.  A\nquorum shall consist of not less than two-thirds of the board membership.\n(a) Procedure. The board shall adopt and make available to the public through the secretary procedures under\nwhich a hearing will be conducted.  The procedures shall not require compliance with strict rules of evidence, but\nshall mandate that only relevant information be received.\n(5) Postponed hearing. When the full board is not present to hear an appeal, either the appellant or the appellant’s\nrepresentative shall have the right to request a postponement of the hearing.\n(6) Board decision. The board shall modify or reverse the decision of the code official only by a concurring vote of a\nmajority of the total number of appointed board members.\n(a) Records and copies. The decision of the board shall be recorded.  Copies shall be furnished to the appellant\nand to the code official.\n(b) Administration. The code official shall take immediate action in accordance with the decision of the board.\n(7) Court review. Any person, whether or not a previous party of the appeal, shall have the right to apply to the\nappropriate court for a writ of certiorari to correct errors of law.  Application for review shall be made in the manner and\ntime required by law following the filing of the decision in the office of the chief administrative officer.\n(8) Stays of enforcement. Appeals of notice and orders (other than Imminent Danger notices) shall stay the\nenforcement of the notice and order until the appeal is heard by the appeals board.\nSection 5-25.  Building Code Variance Petition.\n(1)   Before any variance from building codes may be granted, the Board of Building Code Appeals must find all of\nthe following:\n(a) Existence of special conditions or circumstances. That special conditions and circumstances exist which are\npeculiar to the structure or building involved and which are not applicable to other structures or buildings in\nthe same zoning district.\n(b) Conditions not created by applicant. That the special conditions and circumstances do not result from the\naction or negligence of the applicant.\n(c) Special privilege not conferred. That granting the variance requested will not confer upon the applicant any\nspecial privileges denied to other buildings or structures in the same zoning district.\n(d) Hardship conditions exist. That literal interpretation of the provisions of the building code regulations\nwould deprive the applicant of rights commonly enjoyed by other properties in this same zoning district under\nthe terms of this ordinance and would work unnecessary and undue hardship on the applicant.\n(e) Only minimum variance granted. That the variance granted is the minimum variance that will make\npossible the reasonable use of the building or structure.\n(f) Not injurious to the public welfare. That the grant of the variance will be in harmony with the general intent\nand purpose of the building code and that such variance will not be injurious to the area involved or otherwise\ndetrimental to the public interest or welfare.\n(g). Existing non-conforming uses of other property not the basis for approval. No non-conforming use of\nneighboring lands, structures, or buildings in the same district and no permitted use of lands, structures or\nbuildings in other districts shall be considered grounds for the issuance of a variance.\n(2) Application and instructions below.\n1. Fill in the owner’s information section.  It is important to have a complete address and phone number for\ncommunication between the applicant and the department.\n2. Fill in the project description box.  Explain what the building project is i.e. basement alteration, second floor\nalteration, two-story addition, etc.\n3. If there is an agent working for the owner and the agent is a better contact for information regarding the variance,\nfill in the agent information area.\n4. Answer the three questions:\na. State the code and section number with a summary of what the code says.  Also, indicate what the non-\nconforming conditions for the project are i.e. COMM21.04 minimum stair width is 36 inches; i.e. will\nhave 34 inches of stair width.\nb. State why the rule cannot be satisfied i.e. not structurally feasible.\nc. State what will be done to provide an equivalency to the code.  These items should be things that relate to\nthe item the variance is being sought for and exceed code requirements.\n5. Print the owner’s name on the line indicating to do so.\n6. The owner of the property is required to sign where indicated.  If the project is for a one or two family home, the\nform is not required to be notarized.  If the project is for a commercial building, the form is required to be\nnotarized.\nBUILDING CODE VARIANCE PROCEDURE\n1. Fill out the variance form.\n2. If the variance is for a commercial building and is not for an accessibility code contact the fire department so they\ncan fill out a fire department position statement.\n3. Submit the application and a $250.00 fee for a residential variance or a $490.00 fee for a commercial variance to\nthe building inspection department.  Also, where applicable, submit the fire department position statement.\n4. A field inspector may visit the site to verify existing conditions and the completeness of the application.\n5. If there have previously been at least 5 variances for the same item approved, the variance may be approved on\nprecedence.  In this case the applicant will not have to attend a meeting of the Board of Building Code Appeals and\nwill be notified by letter that the variance is approved.  The letter will be sent within 7 days after the scheduled\nmeeting.\n6. In all other cases the variance will be presented to the Board of Building Code Appeals at a monthly meeting.  Seven\ndays before the meeting the supervisor will review the variance for approval to be put on the agenda.  Five days\nbefore the meeting the secretary will mail out the agenda to the Board of Building Code Appeals members and to\nthe applicants.\n7. When a variance is heard by the board the applicant or agent must attend the meeting to answer questions.\n8. The meeting minutes will be mailed within 7 days after the meeting.\nARTICLE 5.  VACANT PROPERTY REGISTRATION\n(Ord. 2029, Article 5, amended, eff. 6/16/17)\nSection 5-26.    Title, purpose and intent.\n(1) This Article shall be known as the City of Trinidad Vacant Property Registration Code, or the “Property Registration\nCode.”\n(2) The purpose and intent of this Article is to mitigate the elevated risk inherently present in abandoned properties of\nbecoming deteriorated, abandoned, unsecured, vandalized and hazardous, all to the detriment of the public health, safety\nand welfare.  When allowed to proliferate, vacant properties can cause widespread blight, provide havens for criminal\nactivity and vagrancy, destroy the safety and quality of neighborhoods, pose unnecessary dangers to public safety\nprofessionals, deplete already-scarce City resources, diminish property values throughout the City, undermine the City’s\nability to enforce its criminal laws, and interfere with the City’s duty to protect its citizens from unsafe and harmful\nconditions.  This Article is intended to provide an avenue for the City to be aware of vacant properties and to monitor,\ninspect and enforce certain minimum maintenance standards at such properties that pose a threat to the public health,\nsafety, and welfare.\nSection 5-27.    Definitions\nFor the purposes of this Article, the following words and phrases shall have the following meanings, unless the context\nclearly indicates otherwise.\nCode Official means the Chief Building Official of the City of Trinidad or any other City official, employee or agent\ndesignated and authorized by the City Manager to enforce this Article.\nPerson in Control means and includes, in regards to any particular property, the person, persons, entity or entities holding\ntitle; a mortgagee or vendee; a receiver; an executor; a trustee; and any other person, entity, lessee or holder of a lesser\nestate or interest, who possesses the authority to enter the property.\nVacant Property means any property upon which any building remains unoccupied by authorized persons for any\nconsecutive period of time greater than one year.\nVacant Property Registration Form means the form required by this Article to register a vacant property and available in\nthe office of the City Clerk.\nSection 5-28.  Registration required.\n(1)  Each Vacant Property within the City must be registered with the City pursuant to this Section within thirty (30) days\nof becoming a Vacant Property under the terms of this Article.  It is the joint and several obligation of each Person in\nControl of such property to register the same and to annually renew such registration within thirty (30) days of the\nanniversary date of the original registration.  Renewal may consist of written notification, with no particular form\nrequired, when the renewal indicates that no information has changed since the last provided information.  Each renewal\nmust include the applicable renewal fee.\n(2)  Vacant Property Registration Forms shall be filed with the City Clerk and the City Clerk shall not accept any\nincomplete Form.  A complete Vacant Property Registration Form shall include, at a minimum, the following information,\nand be accompanied by the applicable registration fee:\n(a)  Location and description of the Vacant Property, including the legal description, parcel identification number,\nphysical address and mailing address, if not the same.\n(b)  The full name, mailing address, residential address (if different than mailing address) and telephone number for\neach individual known by the applicant to be a Person in Control.\n(c)  The full name, mailing address, business address (if different than mailing address) and telephone number of at\nleast one (1) officer, manager or director, for each entity known by the applicant to be a Person in Control, if such\nPerson in Control is a business entity.\n(d)  If no Person in Control has a Colorado residential or business address within fifty (50) miles of the City of\nTrinidad, the full name, mailing address, residential or business address (if different than mailing address) and\ntelephone number of the agent for the property who shall have either a residential or business Colorado address\nwithin fifty (50) miles of the City of Trinidad, along with a copy of the writing designating the agent to act as the\nrepresentative of the applicant on issues related to the Vacant Property and for receipt of notices and legal service of\nprocess related to the Vacant Property.\n(e)  An affirmation that the application is complete and contains no false, misleading or fraudulent statements.\n(f)  An affirmation of and consent to the City’s right to enter the Vacant Property for purposes of inspection for\ncompliance with this Article.\n(3)  It is the duty of each Person in Control to ensure that all of the information provided in a Vacant Property Registration\nForm is kept up to date at all times, and it shall be unlawful for a Person in Control to fail to provide updated information\nto the City within ten (10) days after the date upon which any information provided is no longer accurate.  This obligation\nincludes an obligation to notify the City in writing no later than ten (10) days after a Vacant Property is occupied in such a\nway that it no longer constitutes a Vacant Property under this Article.\nSection 5-29. Fees.\n(1)  Original registration fee.  Each original Vacant Property Registration Form filed for any particular property for any\nparticular consecutive vacancy period shall be accompanied by a registration fee of five hundred dollars ($500).\n Notwithstanding the foregoing, the original registration fee shall be waived if a Person in Control registers a Vacant\nProperty promptly after such Person in Control becomes aware that the property qualifies as such under this Article and\nprior to the City’s issuance of any written notice that the property is required to be registered under this Article.\n(2) Renewal registration fee.  Written notice of the required annual renewal of each registered Vacant Property shall be\naccompanied by a renewal registration fee of five hundred dollars ($500).  Notwithstanding the foregoing, the renewal\nregistration fee shall be waived if a Person in Control files the required annual renewal no later than thirty (30) days after\nthe anniversary date of original registration of the Vacant Property.\nSection 5-30. Property maintenance obligations.\n(1)  It is the duty and obligation of each Person in Control of a Vacant Property to maintain the same free from conditions\nthat would identify the property as a long-term vacancy to a person with ordinary sensory abilities observing the Vacant\nProperty from adjacent or nearby public property or right-of-way.  Such prohibited conditions include, but are not limited\nto:\n(a)  Signs, placards and any other written indication that the property is foreclosed or vacant, excepting, however,\nany “do not occupy” order or other notice or order issued by the City of Trinidad or any other entity with jurisdiction\nover the Vacant Property in regards to fire, health and safety regulations, required or authorized to be posted on such\nproperty by law;\n(b)  Excess debris and litter;\n(c) Broken windows or doors that are not repaired within thirty (30) days.  For purposes of this subsection,\n“repaired” shall mean restored to its original condition or replaced with a window or door of approximately the same\ndesign.  A broken window or door may be covered with plywood or similar boarding material as an emergency\nmeasure, but in no event longer than thirty (30) days;\n(d)  Handbills, circulars, newspapers, advertisements and similar materials deposited and remaining on the property\nfor more than five (5) consecutive days;\n(e)  Standing water other than what naturally occurs on the property as a result of its geographical condition and the\nweather, such as, but not limited to, standing water in swimming pools, yard decorations and or animal and bird\nfeeders;\n(f)  Any condition, or combination thereof, constituting a violation of the City of Trinidad Anti-Dilapidation Code or\nthe International Property Maintenance Code (IPMC), as adopted and amended by the City, pursuant to Section 5-14\nof this Code.\n(2)  The maintenance requirements of this Section are in addition to, and shall not be considered to conflict with or\nabrogate, any and all other property maintenance requirements set forth in the Trinidad Municipal Code and all codes\nadopted by reference thereby.  Nothing in this Section or Article shall operate to eliminate, mitigate or otherwise affect the\nlegal responsibilities and duties of each Person in Control of Vacant Property to comply with each and every other law\napplicable to such property, including but not limited to building, housing, nuisance, and zoning regulations.\nSection 5-31.  Inspections.\n(1)  Pursuant to the consent to inspect granted by the Vacant Property Registration Form, the City may enter and inspect\nany registered Vacant Property for purposes of determining compliance with this Article by filing an inspection request\nwith the Person in Control or with such other person designated as the authorized agent by the Vacant Property\nRegistration Form, at least five (5) business days prior to the requested inspection date.\n(2)  If the inspection request issued under subsection (1) above is denied or ignored, or if inspection of the Vacant Property\non the inspection date is otherwise made impossible, the City may appear before the Municipal Court Judge and request,\npursuant to Rule 241(b)(2) of the Municipal Court Rules of Procedure, as amended, a court order authorizing the City to\nenter upon the premises for purposes of inspection for compliance with the requirements and limitations of this Article.\n Upon possession of the court order, the City may enter the Vacant Property, using such reasonable force as may be\nnecessary to gain entry.\n(3)  It shall be unlawful for any person to deny entry to an authorized City employee, agent or official when such individual\nis acting pursuant to a court order that has been issued according to the procedure outlined in this section.\nSection 5-32.  Unlawful conduct; penalties; enforcement.\n(1)  It shall be unlawful for any Person in Control and any authorized agent designated by a Person in Control to fail to\nperform any act required by this Article, or to knowingly permit such failure.  Each and every day that a violation of this\nArticle exists constitutes a separate and distinct offense and any party committing such violation, upon conviction thereof,\nshall be guilty of a misdemeanor and subject to the fines and penalties set forth in Section 1-8 of this Code.\n(2)  A violation of the property maintenance obligations set forth under this Article is hereby declared to be a public\nnuisance, subject to abatement by the City in accordance with Article 7 of Chapter 16 of this Code.\n(3)  A violation of this Article may be prosecuted and enforced through the administrative enforcement process set forth\nunder Article 6 of this Chapter 5.\n(4)  Each and every remedy and enforcement avenue set forth under this Section is cumulative and distinct, and the City\nmay enforce this Article through any and all legal avenues available to it.\nSection 5-33.  Joint and several liability.\nEach Person in Control and each authorized agent designated by a Person in Control is jointly and severally responsible\nand liable for violations of this Article, and all fees, costs and fines levied as a result of such violations, arising out of the\nVacant Property over which such person has, or has been delegated, control.\nSections 5-34 – 5-45.  Reserved.\nARTICLE 5.  ANTI-DILAPIDATION CODE\n(Ord. 2009, Article 5, enacted 5-17-16)\nSection 5-45.  Title, purpose and intent.\n(1) This Article shall be known as the City of Trinidad Anti-Dilapidation Code, or the “Anti-Dilapidation Code.”\n(2) The purpose and intent of this Article is to prevent and remedy the deterioration and neglect of buildings that\nconstitute threats to the public health, safety and welfare by presenting fire hazards, threatening to collapse and damage\npersons or property, attracting and harboring illicit and illegal activity, harboring vermin and feral animals, and providing\nan environment within which mold, dust and other contagion may thrive.  This Article is intended to define such buildings\nand provide an efficient and effective enforcement mechanism to remedy the same.\nSection 5-46.  Definitions.\nFor the purposes of this Article, the following words and phrases shall have the following meanings, unless the context\nclearly indicates otherwise.\nCode Official means the Chief Building Official of the City of Trinidad or any other City official, employee or agent\ndesignated and authorized by the City Manager to enforce this Article.\nDilapidated Building means any building or structure deemed to be dilapidated under the provisions of Section 5-47 of this\nArticle.\nSection 5-47. Dilapidated Buildings.\nFor purposes of this Article, any building or structure which has any or all of the conditions or defects hereinafter\ndescribed shall be deemed to be a Dilapidated Building, provided that such conditions or defects exist to the extent that the\nlife, health, property or safety of the public or its occupants are endangered.\n(1)  Exterior doors or windows are broken, missing, damaged, not secured, or are so poorly constructed or maintained as\nto be an ineffective barrier between the interior and exterior of the building.\n(2)  Exterior walls, roofs, steps, chimneys, porches, decks, fences, fascia board, soffits, or other features are damaged,\ncollapsed or collapsing, broken, or so deteriorated as to expose the interior of the building to weather.\n(3)  Any door, aisle, passageway, stairway or other means of exit is not of sufficient width or size or is not so arranged as to\nprovide safe and adequate means of exit in case of fire or panic.\n(4) The walking surface of any aisle, passageway, stairway or other means of exit is so warped, worn, loose, torn, covered in\nor littered with some other matter or substance, or otherwise unsafe as to not provide safe and adequate means of exit in\ncase of fire or panic.\n(5) Any portion of the building has been damaged by fire, earthquake, wind, flood or by another cause, to such an extent\nthat the structural strength or stability thereof is materially less than it was before such catastrophe and is less than the\nminimum requirements of the Building Code for new buildings of similar structure, purpose or location.\n(6) Any portion or member or appurtenance thereof is likely to fail, or to become dislodged or detached, or to collapse and\nthereby injure persons or damage property, including but not limited to gutters, rain guards, ornamental trim, ornamental\ndesign, ornamental decorations, cornice, and cobbling.\n(7) The building or structure, or any portion thereof, because of dilapidation; deterioration; decay; faulty construction; the\nremoval, movement or instability of any portion of the ground; the deterioration, decay or inadequacy of its foundation; or\nany other cause, is likely to partially or complete collapse.\n(8)  The building or structure, or any part thereof, is manifestly unsafe for the purpose for which it is being used.\n(9)  The building or structure has been so damaged by catastrophe or has become so dilapidated or deteriorated as to\nbecome an attractive nuisance to children; a harbor for unauthorized occupants; or so as to provide a venue for covert\ncriminal activity.\n(10) The building or structure has been constructed, exists or is maintained in violation of any specific requirement or\nprohibition applicable to such building or structure provided by the building regulations of the City of Trinidad, or of any\nlaw or ordinance of the state, or City relating to the condition, location or structure of buildings.\n(11)  If intended for dwelling purposes, the structure or building, because of inadequate maintenance, dilapidation, decay,\ndamage, faulty construction or arrangement, inadequate light, air or sanitation facilities, or otherwise, is determined by\nthe department of health or a City official to be unsanitary, unfit for human habitation or in such a condition that is likely\nto cause sickness or disease.\n(12) The building or structure, because of obsolescence, dilapidated condition, deterioration, damage, inadequate exits,\nlack of sufficient fire-resistant construction, faulty electric wiring, gas connections or heating apparatus, or other cause, is\ndetermined by the Fire Chief, or his or her designee or another City official, to be a fire hazard.\n(13) The building or structure is condemned or posted as unsafe to occupy by the City or by any other entity with\njurisdiction over the building or structure, or the same is vacant and unregistered as required by the Property Registration\nCode.\n(14) The building, structure, or property is left in a state of incomplete construction, partial demolition, damaged by\nvandalism, fire, earthquake or other acts for a period of 6 months, excluding such time when work is in progress pursuant\nto a valid building or other construction permit.\n(15) The building, structure, or property is consistently in violation of City of Trinidad Codes or Ordinances or require a\ndisproportionate amount of City service or personnel response.\n(16) The condition of the building, structure, or property is maintained and kept in such a way that it is likely to attract,\ncontain, or harbor vermin, debris, trash, illegal dumping or other conditions which are a detriment to the public health,\nsafety and welfare.\nSection 5-48.  Inspections.\n(1) Whenever necessary to make an inspection to enforce this Article, or whenever a Code Official has reasonable cause to\nbelieve that there exists in or upon any property a Dilapidated Building, the Code Official shall first present proper\ncredentials and shall request entry. If entry is refused, such officer shall give the owner or occupant, or if the owner or\noccupant cannot be located after a reasonable effort, he or she shall leave at the property, a written notice, of intent to\ninspect not sooner than twenty-four (24) hours after the time specified in the notice of intention to inspect. The notice\nshall state that the owner or occupant has the right to refuse entry and that, in the event such entry is refused, inspection\nmay be made only upon issuance of a search warrant by the Municipal Judge or a judge of any other court having\njurisdiction.\n(2) In addition to, or in lieu of, the procedures described in Subsection (1) above, a Code Official may appear before the\nMunicipal Judge and, upon presentation of an affidavit showing probable cause, shall obtain a search warrant entitling\nsuch officer or other authorized representatives of the City to enter the property described in said warrant. For purposes of\nthis Section, probable cause exists when the supporting affidavit alleges sufficient facts to warrant a person of reasonable\ncaution to believe that a Dilapidated Building, as defined by this Article, is located or maintained on the described\nproperty.  In determining whether probable cause for issuance of a search warrant exists, the Municipal Court Judge shall\nconsider the totality of the facts and circumstances known to the affiant, and due consideration shall be given to the\naffiant's experience and training in evaluating the existence or probable existence of violations of building code\nrequirements and health, safety and welfare regulations.  In determining whether probable cause exists for issuance of the\nsearch warrant, the Municipal Court Judge shall make a practical, commonsense decision as to whether, given the totality\nof the circumstances set forth in the affidavit, there is a fair probability that conditions constituting a Dilapidated Building\nwill be found in a particular place.\n(3) After obtaining a search warrant, the Code Official and any other City representative authorized by such warrant may\nenter the property described therein using such reasonable force as may be necessary to gain entry. It shall be unlawful for\nany owner or occupant of said property to resist reasonable force used by any authorized agent acting pursuant to this\nArticle.\n(4)  Whenever an emergency situation exists in relation to the enforcement of any of the provisions of this Article, a Code\nOfficial, upon a presentation of proper credentials or identification in the case of occupied property, or possession of said\ncredentials in the case of unoccupied property, may enter into any property within the jurisdiction of the City. In said\nemergency situation, such officer may use such reasonable force as may be necessary to gain entry into said property. It is\nunlawful for any owner or occupant of the property to deny entry to the Code Official or to resist reasonable force used by\nsuch officer acting pursuant to this Subsection.\nSection 5-49. Dilapidated Buildings prohibited.\n(1) It is unlawful for any person to own, occupy or have under his or her control any property with a Dilapidated Building\nlocated thereon.\n(2)  It is unlawful and an offense for any person to construct, maintain or otherwise keep a Dilapidated Building within the\nCity, or to knowingly permit, aid, abet or facilitate any of the foregoing.\nSection 5-50.  Violations; penalties; enforcement.\n(1)  Whenever in any section of this Article the doing of any act is required, prohibited or declared to be unlawful, any\nperson or entity who shall be convicted of a violation of any such section shall, for each offense, upon conviction thereof,\nbe subject to the fines and penalties set forth in Section 1-8 of this Code. Each and every day that a violation of this Article\nexists constitutes a separate and distinct offense.\n(2)  A Dilapidated Building, as defined by this Article, is hereby declared to be a public nuisance, subject to abatement by\nthe City in accordance with Article 7 of Chapter 16 of this Code.\n(3)  A violation of this Article may be prosecuted and enforced through the administrative enforcement process set forth\nunder Article 6 of this Chapter 5.\n(4)  Each and every remedy and enforcement avenue set forth under this Section is cumulative and distinct, and the City\nmay enforce this Article through any and all legal avenues available to it.\nSections 5-51 – 5-54.  Reserved.\nARTICLE 6. - ADMINISTRATIVE ENFORCEMENT\n(Ord. 2009, Article 6, enacted 5-17-16)\n Section 5-55.  Purpose.\n  This Article is intended to encourage prompt compliance with the building regulations established by this Chapter and\nprompt payment of penalties for violations thereof.  \nSection 5-56. Definitions.\n   For the purposes of this Article, the following words and phrases shall have the following meanings, unless the context\nclearly indicates otherwise.\n  Administrative hearing officer or AHO means that person or body designated by the City Manager from time to time to\nhear appeals from administrative citations issued under this Article.\n  City Manager means the City Manager or his or her designee.\n  Code Official means the Chief Building Official of the City of Trinidad or any other City official, employee or agent\ndesignated and authorized by the City Manager to enforce any provision of this Chapter 5.\n  Municipal Court means the municipal court for the City of Trinidad, Colorado.\n  Responsible Party means a person or entity who has violated this Chapter or, in the case of property subject to an\nadministrative citation under this Article, who has possession or control of any real property or premises, whether as\nowner, co-owner, occupant, tenant, lessee, mortgagee or vendee, receiver, executor, trustee or holder of any other estate or\ninterest in such property.\nSection 5-57.   Notice of violation.\n(1) Upon becoming aware of a violation of any provision of this Chapter, a Code Official may issue a notice of violation to a\nResponsible Party. The notice shall state the date and location of the violation, the approximate time the violation was\nobserved, identifying, where applicable, the property in violation by address or legal description. The notice shall refer to\nthe applicable section violated, describe the violation, and describe the action required to correct the violation. The notice\nshall require the Responsible Party to correct the violation within thirty (30) days, and shall explain the consequences of\nfailure to correct said violation, including the issuance of an administrative citation.\n(2)  Service of a notice of a violation on a Responsible Party shall be by any of the following means:\n(a)  The Code Official may personally deliver a copy of the notice of violation to a Responsible Party; or\n(b)  A copy of the notice may be mailed by first-class, certified  mail to the last known address of a Responsible Party as\nreflected in the county real estate records; or\n(c) A copy of the notice of violation may be posted in a conspicuous place at the site of the violation.\n(3)  The City’s provision of notice pursuant to paragraph (2)(b) of this section to the last known address of a Responsible\nParty as reflected in the records of the Las Animas County Assessor’s Office shall be considered adequate notwithstanding\nany error in the county's records. An officer may reasonably rely upon current county records to obtain an accurate\naddress for a Responsible Party.\n(4)  At any hearing conducted pursuant to Section 5-62, the AHO may consider evidence of actual notice received by a\nResponsible Party in determining whether adequate notice of a violation or of a citation has been provided. The AHO may\nfind that notice is adequate despite a lack of technical compliance with subsection (2) hereof upon evidence that a\nResponsible Party received actual notice of a notice of violation at least thirty (30) days prior to the issuance of an\nadministrative citation for the specified violation(s) or actual notice of an administrative citation.\n(5) Any person in charge receiving a notice of violation may request a meeting with the City Manager or City Manager\nDesignee and the Code Official to pursue a resolution as allowed per section 5-58 (6).  The Code Official shall not issue an\nadministrative citation until after such a meeting is scheduled.  The scheduling of this meeting shall not take place any\nlonger than fourteen (14) days from the issuance of the notice of violation by the Code Official unless authorized by the\nCity Manager in writing.\nSection 5-58.   Administrative citations – general provisions.\n (1) Any Responsible Party violating any provision of this Chapter 5 may be issued an administrative citation by a Code\nOfficial as provided in this Article.\n(2) Notwithstanding any other provision of this Code, Responsible Parties cited under the provisions of this Article shall\nhave only the appeal rights granted herein.\n(3)  Administrative citations shall be issued only after the Responsible Party has received a notice of violation and has been\ngiven time to comply as stated in the notice of violation.\n(4)  Each day a violation exists or continues shall constitute a separate and distinct violation for which a separate\nadministrative citation may be issued. However, once an administrative citation has been issued for a violation of an\napplicable section, no additional administrative citation shall be issued for the same violation for ten (10) days or, if the\nResponsible Party appeals, until after the appeal has been heard and the Responsible Party has not complied with an order\nof the Administrative Hearing Officer within ten (10) days of its issuance or such other time as the AHO has specified.\n(5)  A fine assessed by means of an administrative citation issued by the Code Official shall be paid to and filed with the\nOffice of the City Treasurer/Finance Director, and if not timely paid, shall be collected in accordance with the procedures\nspecified in this Article.\n(6) Enforcement actions for violations of applicable sections are intended to be alternative in nature. At any one time, the\nCity may pursue a civil, criminal, or administrative action against a Responsible Party. The City may also choose to pursue\nan alternative action upon staying the original action.\nSection 5-59.  Issuance of administrative citation.\n(1)  If a Responsible Party has failed to correct the violation noted in the notice of violation within the time provided on\nsuch notice, a Code Official may issue an administrative citation to the Responsible Party on a form approved by the City\nManager.\n(2)  The Code Official may require that the Responsible Party provide evidence of identity and residential or working\naddress.\n(3)  The Code Official shall first attempt to issue the administrative citation to a Responsible Party at the site of any\nviolation, if a Responsible Party can be located there.  However, the Code Official may issue an administrative citation to a\nResponsible Party by any of the methods described in Subsection 5-53(2) above.\n(4)  The Code Official shall attempt to obtain the signature of the person receiving the administrative citation on the\ncitation. If that person refuses or fails to sign the administrative citation, the failure or refusal to sign shall not affect the\nvalidity of the citation and subsequent proceedings.\n(5)  Notice shall be deemed served on the earliest of: (i) the date of receipt by the Responsible Party, if personally served;\n(ii) the fourth day after the mailing of the administrative citation; or (iii) the date the administrative citation was posted.\nSection 5-60.  Administrative citation – contents.\n(1)  The administrative citation shall state the location of the violation(s) and the date(s) and approximate time(s) the\nviolations were observed. Where applicable, the administrative citation shall identify the property in violation by address\nor legal description.\n(2)  The administrative citation shall refer to the applicable sections violated and describe the violations.\n(3)  The administrative citation shall describe the action required to correct the violations.\n(4) The administrative citation shall require the named Responsible Party to correct the violations immediately and shall\nexplain the consequences of failure to correct said violations.\n(5)  The administrative citation shall state the amount of fine imposed for the violation.\n(6)  The administrative citation shall explain how the fine shall be paid, the time period by which it shall be paid, and the\nconsequences of failure to pay the fine.\n(7)  The administrative citation shall briefly state the process for appealing the administrative citation.\n(8)  The administrative citation shall contain the signature of the Code Official and the signature of the Responsible Party\nif it can be obtained.\nSection 5-61.  Appeals – notice and scheduling.\n(1) A person served with an administrative citation may file a notice of appeal within five (5) business days from the service\nof the administrative citation. Compliance with this time limit shall be a jurisdictional prerequisite to any appeal brought\nunder this Article, and failure to comply shall bar any such appeal.\n(2)  The notice of appeal shall be made in writing and shall be filed with the City Clerk in person, by facsimile transmission\nor by mail. Regardless of the manner of filing such appeal, the notice of appeal must be filed with the City Clerk within five\n(5) business days from the date the administrative citation was served.\n(3)  As soon as practicable after receiving the written notice of appeal, the City Manager or City Manager designee shall\nassign an AHO who shall schedule a date, time and location for the hearing.\n(4)  Written notice of the date, time and location of the hearing shall be personally served upon or sent by certified mail to\nthe Responsible Party at least seven (7) calendar days prior to the date of the hearing. The hearing shall be held no more\nthan thirty (30) days after a timely filed notice of appeal.\n(5)  In computing the day a notice of appeal must be filed or the day by which a hearing must be held, the first day is\nexcluded and the last day is included. If the last day of any period is a Saturday, Sunday, or legal holiday, the period is\nextended to the first day thereafter which is not a Saturday, Sunday, or legal holiday.\nSection 5-62.  Conduct of appeals hearings.\n(1) Administrative appeals are intended to be informal in nature. Formal rules of evidence and discovery do not apply. The\nprocedure and format of the administrative hearing shall follow the procedures provided in this section.\n(2) The parties to an administrative appeal shall be the named Responsible Party and the City Building Department.\nParties may be represented by legal counsel. Each party may call and question witnesses, cross-examine witnesses and\npresent evidence in support of its case.\n(3)  The AHO, at the request of any party to the hearing, may subpoena witnesses, documents and other evidence where\nthe attendance of the witness or the admission of evidence is deemed necessary to decide the issues at the hearing. All\ncosts related to the subpoena, including witness and mileage fees, shall be borne by the party requesting the subpoena. The\nform of, and the process for issuing subpoenas, shall be the same as in the Municipal Court.\n(4)  The AHO shall have the power to call and question witnesses, review and consider the relevancy of documentary or\nother tangible evidence, and rule on evidentiary questions.\n(5) The only issue to be decided by the AHO is whether the Code Official exceeded his/her authority in issuing the\nadministrative citation. To do so, the City bears the burden of proof to establish the existence of a violation of the cited\nportion(s) of this Chapter. The City's meeting of this burden of proof shall constitute prima facie evidence that the Code\nOfficial did not exceed his/her authority. The appellant shall have the burden of rebutting such evidence.\n(6)  The standard of proof required in an administrative appeal is a preponderance of the evidence.\n(7)  Copies, photographs, and photocopies may be admitted into evidence or substituted in evidence in place of original\ndocuments.\n(8)  Hearings shall be recorded by electronic means and transcripts of such recordings shall be made at the expense of the\nparty requesting the transcript.\n(9)  Whenever it appears that an appeal is not filed within the time permitted by this Article, or that the AHO for some\nother reason lacks jurisdiction, the appeal may be dismissed on the motion of any party or on the AHO's own motion.\n(10)  The decision of the AHO shall be known as an administrative enforcement order.\n(11) The AHO may uphold the administrative citation and all penalties or dismiss the administrative citation and all\npenalties or may waive or conditionally reduce the penalties assessed by the administrative citation. The AHO may also\nimpose conditions and deadlines to correct the violations or require payment of any outstanding penalties.\n(12)  In the event that the AHO does not dismiss the administrative citation, the AHO shall assess reasonable\nadministrative costs of not less than one hundred dollars ($100.00), but not to exceed two hundred dollars ($200.00).\n(13)  The administrative enforcement order shall become final on the date of mailing the order to the Responsible Party. A\ncopy of the order shall be provided to the City.\nSection 5-63.  Failure to obey subpoena.\n  It is unlawful for any person to refuse to obey a subpoena issued by an AHO. Failure to obey a subpoena constitutes\ncontempt and may be criminally prosecuted and have penalties imposed in the same manner as violation of a Municipal\nCourt subpoena.\nSection 5-64.  Failure to attend administrative appeal.\n  Any Responsible Party who fails to appear at the hearing is deemed to waive the right to a hearing and the adjudication of\nthe issues related to the hearing, provided that proper notice of the hearing has been provided. The AHO may take\ntestimony, evidence and argument from the City and issue an administrative enforcement order.\nSection 5-65.  Failure to comply with administrative enforcement order.\n  It is unlawful for a Responsible Party who has been served with a copy of the final administrative enforcement order to\nfail to comply with the order. Failure to comply with a final administrative enforcement order may be criminally\nprosecuted and have penalties imposed similar to those for failure to comply with an order of the Municipal Court.\nSection 5-66.  Penalties assessed.\n(1)  The City Manager shall develop a fine schedule based upon the Manager's assessment of the cost to the City for\nenforcing the provisions of this Article. The Manager shall publish the fine schedule on the City’s web site and post the\nsame at one (1) or more conspicuous location(s) at City Hall where the same may be inspected by the public during all\nregular City business hours.  The schedule of fines shall be graduated in amount, with the smallest fine being assessed for\nthe first administrative citation and increasingly larger fines for second, third and subsequent administrative citations. No\nsingle fine assessed for an administrative citation shall exceed one thousand dollars ($1,000.00). The schedule of fines\nshall be amended no more than once per year.\n(2) If the Responsible Party fails to correct the violation, subsequent administrative citations may be issued for violations\nof the same applicable section.\n(3) Payment of the fine shall not excuse the failure to correct the violations nor shall it bar further enforcement action by\nthe City.\n(4)  All fines assessed shall be payable to the City of Trinidad.\nSection 5-67.  Failure to pay fines.\n(1) The failure of any Responsible Party to pay the fines assessed by an administrative citation within the time specified on\nthe citation or administrative enforcement order, if an administrative hearing was held, may result in the imposition of a\nlate fee of fifty dollars ($50.00), a twenty percent (20%) charge to defray the cost of collection, and interest at a rate of ten\npercent (10%) per annum on all unpaid amounts.\n(2) In the event of failure to pay all fines assessed, the City Manager may refer the matter for collection by whatever means\nare available to the City.\n(3) As authorized by C.R.S. § 31-20-105, the City may certify all delinquent charges and assessments made under this\nArticle to the treasurer of the County to be collected and paid over by the Treasurer of the County in the same manner as\ntaxes are collected.\n(4)  An action or other process provided by law may be maintained by the City to recover or collect any amounts, including\nlate fees, interests, and administrative costs, owing under this Article.\n"
}