{
    "chapter": "Chapter 10 -  Municipal Court",
    "content": "Chapter 10 - Municipal Court\nSections:\n10-1                 Municipal Court - Creation.\n10-2                 Municipal Court - Jurisdiction and powers.\n10-3                 Municipal Court - Rules of procedure.\n10-4                 Sessions of Court - Regular and special.\n10-5                 Municipal Judges - Appointment; oath; salary; powers.\n10-6                 Procedure for issuance of warrant.\n10-7                 Court Clerk - Appointment; duties; salary; reports.\n10-8                 Appropriations for Municipal Court.\nCHAPTER 10.  MUNICIPAL COURT.\nSection 10-1.   Municipal Court - Creation.\n(1) Definitions.\nAs used in this Section, unless the context otherwise requires:\na) A municipal court in and for the City of Trinidad is hereby created and established, pursuant to and governed by the\nprovisions of Title 13 of Article 10, C.R.S. 1973, as amended, and the City Charter.\nb) The municipal court in and for said City of Trinidad, Colorado, organized to hear and try all alleged violations of\nordinance provisions of the city, is hereby established as a qualified municipal court of record pursuant to the provisions of\nC.R.S. 13-10-101 et seq. The court shall operate in conformity with the Charter and ordinances of the City, shall keep a\nverbatim record of the proceedings and evidence of trials by either electronic devices or stenographic means, and the judge\nof the court shall have been admitted to and currently be licensed in the practice of law in the State of Colorado. (Sec. 10-1,\namended Ord. 2090, eff. 12/13/19)\nSection 10-2.   Municipal Court - Jurisdiction and powers.\nThe Municipal Court shall have original jurisdiction of all cases arising under this Code and other ordinances of the City\nwith full power to punish violators thereof by the imposition of such fines and penalties as are prescribed by ordinance or\nCourt rule.\nSection 10-3.   Municipal Court - Rules of procedure.\nThe Colorado Municipal Court Rules of Procedure promulgated by the Colorado Supreme Court, which took effect on\nJanuary 1, 1989, together with all amendments contained therein, be and the same are hereby adopted by reference and\nsaid Rules are hereby enacted as the Municipal Court Rules of Procedure of the City of Trinidad.\nSection 10-4.   Sessions of Court - Regular and special.\n(1)  There shall be regular sessions of the Court for the trial of cases.  The Municipal Judge may hold a special session of\nthe Court at any time.\n(2)  All sessions shall be open to the public.  Where the nature of the case is such that it would be in the best interest of\njustice to exclude persons not directly connected with the proceeding, the Municipal Judge may order that the courtroom\nbe cleared.\nSection 10-5.   Municipal Judges - Appointment; oath; salary; powers. (Ord. 3014, Sec 10-5, amended, eff.\n2-26-21)\n\n(1)  The Court shall be presided over by a Municipal Judge appointed for a term of two (2) years by resolution of the\nCouncil.  Additional Judges may be appointed as may be needed for a term of two (2) years to transact the business of the\nCourt.\n(2)  The compensation of the Judge shall be an annual salary in an amount set by the Council and shall be payable as other\nsalaries to Municipal employees.\n(3)  Before entering the duties of his/her office, a Municipal Judge shall make an oath or affirmation that he/she will\nsupport the Constitution of the United States, the Constitution\nof the State, and the laws of the City and will faithfully perform the duties of his/her office.\n(4)  The Municipal Judge is empowered in his/her discretion to assess costs of Forty Dollars ($40.00) against any\nDefendant who pleads Guilty or Nolo Contendere or who enters into a plea agreement or who after trial, is found guilty of\nan ordinance violation. (Sec. 10-5(4), amended Ord. 2089, eff. 12/13/19)\n(5)  In addition to other powers, a Municipal Judge shall have full power and authority to make and adopt rules and\nregulations for conducting the business of the Municipal Court, consistent with the Colorado Municipal Court Rules of\nProcedure promulgated by the Colorado Supreme Court.\n(6) The Municipal Judge is empowered to order a defendant who is found guilty of violating any provision of the City of\nTrinidad Municipal Code or any of the ordinances of the City, or who is granted a deferred prosecution or deferred\nsentence, to make restitution or reparation, or both, to the victim of the defendant’s conduct for the damage or injury\nsustained.  (Ord. 1936, eff. 5/29/13)\n(7) In sentencing or fining a violator, the municipal judge shall not exceed the sentence or fine limitations established\nherein. Any other provision of the law to the contrary notwithstanding, the municipal judge may suspend the sentence or\nfine of any violator and place him on probation for a period not to exceed one year.  \nMUNICIPAL COURT/VIOLATIONS BUREAU, TRINIDAD, COLORADO\nBelow is a list of the minimum fines as set by the Judge of this Court and are payable at the office of the Court Clerk.\nSchedule of Fines\nPoints for traffic violations are assessed by the Colorado Motor Vehicle Division in accordance with the Colorado Revised\nStatutes, this Court has no control over the assessment of these points.\nIn addition to fines assessed, court costs in the amount of $40.00 may be assessed against any defendant who pleads\nguilty or nolo condere or who enters into a plea agreement or who after trial is found guilty of an ordinance violation.\nSection 10-6.   Procedure for issuance of warrant.\nThe application for and issuance of any search warrant which may be issued by the Municipal Judge to search for and seize\nproperty, or for inspection of private premises by an authorized inspector, shall be in accordance with those procedures set\nforth in the Colorado Municipal Court Rules of Procedure.\nSection 10-7.   Court Clerk - Appointment; duties; salary; reports.\n(1)  The Presiding Judge may appoint a person to serve as Clerk of the Court whose duties shall be those assigned by the\nPresiding Judge.\n(2)  The compensation of the Court Clerk shall be an annual salary in an amount set by the Council and shall be payable as\nother salaries to Municipal employees.\n(3)  The Court Clerk shall file monthly reports with the City Clerk of all moneys collected by him/her.  All moneys received\nby and in the custody of the Court Clerk shall be paid daily to the Department of Finance.\nSection 10-8.   Appropriations for Municipal Court.\nThe City Council shall, on an annual basis, budget and appropriate such moneys as may be necessary for the proper\noperation of the Municipal Court.\n"
}